[
{"chapter": "Title 22. Criminal Offenses and Penalties.", "title": [], "text": [], "address": "https://code.dccouncil.us/dc/council/code/titles/22/"},
{"chapter": "Chapter 13A. Entry into a Motor Vehicle, Unlawful.", "title": ["§ 22–1341. Unlawful entry of a motor vehicle."], "text": [", imprisoned for not more than 90 days, or both."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/13A/"},
{"chapter": "Chapter 8C. Protection of Police Animals.", "title": ["§ 22–861. Harassing, interfering with, injuring, or obstructing a police animal."], "text": [" Any person who intentionally and without justifiable and excusable cause, harasses, interferes with, injures, or obstructs a police animal when he or she has reason to believe the animal is a police animal shall be guilty of a misdemeanor and, upon conviction, shall be imprisoned not more than 180 days or fined not more than the amount set forth in ", " Any person who violates subsection (b) of this section and causes significant bodily injury to, or the death of, a police animal shall be guilty of a felony and, upon conviction, shall be imprisoned not more than 10 years, or fined not more than the amount set forth in "], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/8C/"},
{"chapter": "Chapter 8B. Crimes Against Public Officials.", "title": ["§ 22–851. Protection of District public officials."], "text": [" or imprisoned not more than 5 years, or both.", " or imprisoned not more than 3 years, or both, in addition to any other penalties authorized by law.", " or imprisoned not more than 3 years, or both, in addition to any other penalties authorized by law."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/8B/"},
{"chapter": "Chapter 8A. Crimes Committed Against Minors.", "title": ["§ 22–811. Contributing to the delinquency of a minor."], "text": [", or imprisoned for not more than 6 months, or both.", " or imprisoned for not more than 3 years, or both.", " or imprisoned for not more than 5 years, or both.", " or imprisoned for not more than 5 years, or both.", " or imprisoned for not more than 10 years, or both."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/8A/"},
{"chapter": "Chapter 12A. Detection Device Tampering.", "title": ["§ 22–1211. Tampering with a detection device."], "text": [", imprisoned for not more than 180 days, or both."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/12A/"},
{"chapter": "Chapter 10. Cruelty to Animals.", "title": ["§ 22–1001. Definitions and penalties.", "§ 22–1002. Other cruelties to animals.", "§ 22–1002.01. Reporting requirements.", "§ 22–1003. Rest, water and feeding for animals transported by railroad company.", "§ 22–1004. Arrests without warrant authorized; notice to owner.", "§ 22–1005. Issuance of search warrants.", "§ 22–1006. Prosecution of offenders; disposition of fines.", "§ 22–1006.01. Penalty for engaging in animal fighting.", "§ 22–1007. Impounded animals to be supplied with food and water.", "§ 22–1008. Relief of impounded animals.", "§ 22–1009. Keeping or using place for fighting or baiting of fowls or animals; arrest without warrant.", "§ 22–1011. Neglect of sick or disabled animals.", "§ 22–1012. Abandonment of maimed or diseased animal; destruction of diseased animals; disposition of animal or vehicle on arrest of driver; scientific experiments.", "§ 22–1013. Definitions.", "§ 22–1015. Penalty for engaging in animal fighting [Renumbered]"], "text": [" Whoever knowingly overdrives, overloads, drives when overloaded, overworks, tortures, torments, deprives of necessary sustenance, cruelly chains, cruelly beats or mutilates, any animal, or knowingly causes or procures any animal to be so overdriven, overloaded, driven when overloaded, overworked, tortured, tormented, deprived of necessary sustenance, cruelly chained, cruelly beaten, or mutilated, and whoever, having the charge or custody of any animal, either as owner or otherwise, knowingly inflicts unnecessary cruelty upon the same, or unnecessarily fails to provide the same with proper food, drink, air, light, space, veterinary care, shelter, or protection from the weather, shall for every such offense be punished by imprisonment in jail not exceeding 180 days, or by fine not exceeding $250, or by both.", " Except where the animal is an undomesticated and dangerous animal such as rats, bats, and snakes, and there is a reasonable apprehension of an imminent attack by such animal on that person or another, whoever commits any of the acts or omissions set forth in subsection (a) of this section with the intent to commit serious bodily injury or death to an animal, or whoever, under circumstances manifesting extreme indifference to animal life, commits any of the acts or omissions set forth in subsection (a) of this section which results in serious bodily injury or death to the animal, shall be guilty of a felony and, upon conviction thereof, shall be punished by imprisonment not exceeding 5 years, or by a fine not exceeding $25,000, or both.", "“Whoever overdrives, overloads, drives when overloaded, overworks, tortures, torments, deprives of necessary sustenance, cruelly beats, mutilates, or cruelly kills, or causes or procures to be so overdriven, overloaded, driven when overloaded, overworked, tortured, tormented, deprived of necessary sustenance, cruelly beaten, mutilated, or cruelly killed any animal, and whoever, having the charge or custody of any animal, either as owner or otherwise, inflicts unnecessary cruelty upon the same, or unnecessarily fails to provide the same with proper food, drink, shelter, or protection from the weather, shall for every such offense be punished by imprisonment in jail not exceeding 180 days, or by fine not exceeding $250, or by both such fine and imprisonment.”", ", imprisonment not to exceed 5 years, or both. The court may also impose any penalties listed in ", ", in subsec. (a), substituted “any animal; (5)” for “any animal; or (5)”, and substituted “that act; or (6) any person who is knowingly present as a spectator at any such exhibition, is guilty of a felony, punishable by a fine of not more than $25,000, imprisonment not to exceed 5 years, or both. The court may also impose any penalties listed in ", ".” for “that act, is guilty of a felony, punishable by a fine of not more than $25,000 or by imprisonment not to exceed 5 years, or both”; and repealed subsec. (b), which had read as follows: “(b) Any person who is knowingly present at any place or building where preparations are being made for an exhibition described in subsection (a) of this section, or who is knowingly present as a spectator at any such exhibition, or who knowingly or recklessly aids or abets another in such exhibition, is guilty of a misdemeanor, punishable by a fine of not more than $1,000 or by imprisonment not to exceed 180 days, or both.”", ", or by imprisonment in jail not more than 180 days, or both. Any agent or officer of the Washington Humane Society may lawfully destroy, or cause to be destroyed, any animal found abandoned and not properly cared for, appearing, in the judgment of 2 reputable citizens called by such officer to view the same in such officer’s presence, to be glandered, injured, or diseased past recovery for any useful purpose. When any person arrested is, at the time of such arrest, in charge of any animal, or of any vehicle drawn by any animal, or containing any animal, any agent of said society may take charge of such animal and such vehicle and its contents and deposit the same in a place of safe custody or deliver the same into the possession of the police authorities, who shall assume the custody thereof; and all necessary expenses incurred in taking charge of such property shall be a lien thereon."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/10/"},
{"chapter": "Chapter 9. Commercial Counterfeiting.", "title": ["§ 22–901. Definitions.", "§ 22–902. Trademark counterfeiting."], "text": [" or by imprisonment for not more than 180 days, or both;", " or by imprisonment for not more than 3 years, or both; and", " or by imprisonment for not more than 10 years, or both."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/9/"},
{"chapter": "Chapter 8. Burglary.", "title": ["§ 22–801. Definition and penalty."], "text": [" Whoever shall, either in the nighttime or in the daytime, break and enter, or enter without breaking, any dwelling, or room used as a sleeping apartment in any building, with intent to break and carry away any part thereof, or any fixture or other thing attached to or connected thereto or to commit any criminal offense, shall, if any person is in any part of such dwelling or sleeping apartment at the time of such breaking and entering, or entering without breaking, be guilty of burglary in the first degree. Burglary in the first degree shall be punished by imprisonment for not less than 5 years nor more than 30 years.", " Except as provided in subsection (a) of this section, whoever shall, either in the night or in the daytime, break and enter, or enter without breaking, any dwelling, bank, store, warehouse, shop, stable, or other building or any apartment or room, whether at the time occupied or not, or any steamboat, canalboat, vessel, or other watercraft, or railroad car, or any yard where any lumber, coal, or other goods or chattels are deposited and kept for the purpose of trade, with intent to break and carry away any part thereof or any fixture or other thing attached to or connected with the same, or to commit any criminal offense, shall be guilty of burglary in the second degree. Burglary in the second degree shall be punished by imprisonment for not less than 2 years nor more than 15 years."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/8/"},
{"chapter": "Chapter 9A. Criminal Abuse and Neglect of Vulnerable Adults.", "title": ["§ 22–931. Short title.", "§ 22–932. Definitions.", "§ 22–933. Criminal abuse of a vulnerable adult or elderly person.", "§ 22–933.01. Financial exploitation of a vulnerabl adult or elderly person.", "§ 22–934. Criminal negligence.", "§ 22–935. Exception.", "§ 22–936. Penalties.", "§ 22–936.01. Criminal penalties for financial exploitation of a vulnerable adult or elderly person.", "§ 22–937. Civil penalties for financial exploitation of a vulnerable adult or elderly person.", "§ 22–938. Injunctive relief and protections."], "text": [", imprisoned for not more than 180 days, or both.", ", imprisoned up to 10 years, or both.", ", imprisoned up to 20 years, or both.", ", or imprisonment for not more than 10 years, or both.", ", or imprisonment for not more than 180 days, or both.", ", or imprisoned for not more than 15 years, or both."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/9A/"},
{"chapter": "Chapter 7. Bribery; Obstructing Justice; Corrupt Influence.", "titles": ["§ 22–704. Corrupt influence; officials.", "§ 22–711. Definitions.", "§ 22–712. Prohibited acts; penalty.", "§ 22–713. Bribery of witness; penalty.", "§ 22–721. Definitions.", "§ 22–722. Prohibited acts; penalty.", "§ 22–723. Tampering with physical evidence; penalty."], "text": [" Whosoever corruptly, directly or indirectly, gives any money, or other bribe, present, reward, promise, contract, obligation, or security for the payment of any money, present, reward, or thing of value to any ministerial, administrative, executive, or judicial officer of the District of Columbia, or any employee, or other person acting in any capacity for the District of Columbia, or any agency thereof, either before or after the officer, employee, or other person acting in any capacity for the District of Columbia is qualified, with intent to influence such official’s action on any matter which is then pending, or may by law come or be brought before such official in such official’s official capacity, or to cause such official to execute any of the powers in such official vested, or to perform any duties of such official required, with partiality or favor, or otherwise than is required by law, or in consideration that such official being authorized in the line of such official’s duty to contract for any advertising or for the furnishing of any labor or material, shall directly or indirectly arrange to receive or shall receive, or shall withhold from the parties so contracted with, any portion of the contract price, whether that price be fixed by law or by agreement, or in consideration that such official has nominated or appointed any person to any office or exercised any power in such official vested, or performed any duty of such official required, with partiality or favor, or otherwise contrary to law; and whosoever, being such an official, shall receive any such money, bribe, present, or reward, promise, contract, obligation, or security, with intent or for the purpose or consideration aforesaid shall be deemed guilty of bribery and upon conviction thereof shall be punished by imprisonment for a term not less than 6 months nor more than 5 years. In addition to any other penalty provided under this section, a person may be fined an amount not more than the amount set forth in ", " or twice the monetary equivalent of the thing of value, whichever is greater, or imprisoned for not more than 10 years, or both.", " or imprisoned for not more than 5 years, or both.", ", or both. For purposes of imprisonment following revocation of release authorized by ", ", imprisoned for not more than 3 years, or both.", " rewrote subsec. (b) which had read as follows: “(b) Any person convicted of tampering with physical evidence shall be fined not more than $1,000 or imprisoned for not more than 3 years, or both.”"], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/7/"},
{"chapter": "Chapter 11. Cruelty to Children.", "title": ["§ 22–1101. Definition and penalty.", "§ 22–1102. Refusal or neglect of guardian to provide for child under 14 years of age."], "text": [" Any person convicted of cruelty to children in the first degree shall be fined not more than $10,000 or be imprisoned not more than 15 years, or both.", " or be imprisoned not more than 10 years, or both.", ", or by imprisonment in the Workhouse of the District of Columbia for not more than 3 months, or both such fine and imprisonment."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/11/"},
{"chapter": "Chapter 13. Disturbances of the Public Peace.", "title": ["§ 22–1301. Affrays.", "§ 22–1307. Crowding, obstructing, or incommoding.", "§ 22–1308. Playing games in streets.", "§ 22–1309. Throwing stones or other missiles.", "§ 22–1310. Urging dogs to fight or create disorder.", "§ 22–1311. Allowing dogs to go at large.", "§ 22–1312. Lewd, indecent, or obscene acts; sexual proposal to a minor.", "§ 22–1313. Kindling bonfires.", "§ 22–1314.01. Definitions.", "§ 22–1314.02. Prohibited acts.", "§ 22–1317. Flying fire balloons or parachutes.", "§ 22–1318. Driving or riding on footways in public grounds.", "§ 22–1319. False alarms and false reports; hoax weapons.", "§ 22–1320. Sale of tobacco to minors under 18 years of age.", "§ 22–1321. Disorderly conduct.", "§ 22–1322. Rioting or inciting to riot.", "§ 22–1323. Obstructing bridges connecting D.C. and Virginia."], "text": [" or imprisoned not more than 180 days, or both.", ", imprisoned for not more than 90 days, or both.", "“It shall not be lawful for any person or persons within the District of Columbia to congregate and assemble in any street, avenue, alley, road, or highway, or in or around any public building or inclosure, or any park or reservation, or at the entrance of any private building or inclosure, and engage in loud and boisterous talking or other disorderly conduct, or to insult or make rude or obscene gestures or comments or observations on persons passing by, or in their hearing, or to crowd, obstruct, or incommode, the free use of any such street, avenue, alley, road, highway, or any of the foot pavements thereof, or the free entrance into any public or private building or inclosure; it shall not be lawful for any person or persons to curse, swear, or make use of any profane language or indecent or obscene words, or engage in any disorderly conduct in any street, avenue, alley, road, highway, public park or inclosure, public building, church, or assembly room, or in any other public place, or in any place wherefrom the same may be heard in any street, avenue, alley, road, highway, public park or inclosure, or other building, or in any premises other than those where the offense was committed, under a penalty of not more than $250 or imprisonment for not more than 90 days, or both for each and every such offense.”", ", imprisoned for not more than 90 days, or both.", " rewrote subsec. (a), which had read as follows: “(a) It shall not be lawful for any person or persons to make any obscene or indecent exposure of his or her person, or to make any lewd, obscene, or indecent sexual proposal, or to commit any other lewd, obscene, or indecent act in the District of Columbia, under penalty of not more than $300 fine, or imprisonment of not more than 90 days, or both, for each and every such offense.”", "“(a) It shall not be lawful for any person or persons to make any obscene or indecent exposure of his or her person, or to make any lewd, obscene, or indecent sexual proposal in the District of Columbia under penalty of not more than $300 fine, or imprisonment of not more than 90 days, or both, for each and every such offense.", "“(b) Any person or persons who shall commit an offense described in subsection (a) of this section, knowing he or she or they are in the presence of a child under the age of 16 years, shall be punished by imprisonment of not more than 1 year, or fined in an amount not to exceed $1,000, or both, for each and every such offense.”", ", imprisoned for not more than 180 days, or both.", " or by imprisonment for not more than 6 months, or by both such fine and imprisonment. Prosecutions for violation of the provisions of this subsection shall be on information filed in the Superior Court of the District of Columbia by the Office of the Attorney General for the District of Columbia.", " or by imprisonment for not more than 6 months. Prosecutions for violation of the provisions of this subsection shall be on information filed in the Superior Court of the District of Columbia by the Office of the Attorney General for the District of Columbia.", " Any person violating the provisions of this subsection shall, upon conviction, be guilty of a misdemeanor and be punished by imprisonment of not more than one year or fined in an amount not more than the amount set forth in ", " Any person violating the provisions of this subsection shall, upon conviction, be guilty of a felony and may be punished by imprisonment of not more than 5 years or fined in an amount not more than the amount set forth in ", " Any person violating the provisions of this subsection shall, upon conviction, be guilty of a felony and may be punished by imprisonment of not more than 10 years or fined in an amount not more than the amount set forth in ", " rewrote subsec. (a); and added subsec. (a-1). Prior to amendment, subsec. (a) read as follows: “(a) It shall be unlawful for any person or persons to wilfully or knowingly give a false alarm of fire within the District of Columbia, and any person or persons violating the provisions of this section shall upon conviction, be deemed guilty of a misdemeanor and be punished by a fine not exceeding $100 or by imprisonment for not more than 6 months, or by both such fine and imprisonment. Prosecutions for violation of the provisions of this section shall be on information filed in the Superior Court of the District of Columbia by the Corporation Counsel of the District of Columbia or by any Assistant Corporation Counsel.”", ", imprisoned not more than 90 days, or both.", "“Whoever, with intent to provoke a breach of the peace, or under circumstances such that a breach of the peace may be occasioned thereby: (1) acts in such a manner as to annoy, disturb, interfere with, obstruct, or be offensive to others; (2) congregates with others on a public street and refuses to move on when ordered by the police; (3) shouts or makes a noise either outside or inside a building during the nighttime to the annoyance or disturbance of any considerable number of persons; (4) interferes with any person in any place by jostling against such person or unnecessarily crowding such person or by placing a hand in the proximity of such person’s pocketbook, or handbag; or (5) causes a disturbance in any streetcar, railroad car, omnibus, or other public conveyance, by running through it, climbing through windows or upon the seats, or otherwise annoying passengers or employees, shall be fined not more than $250 or imprisoned not more than 90 days, or both.”", " Whoever willfully engages in a riot in the District of Columbia shall be punished by imprisonment for not more than 180 days or a fine of not more than the amount set forth in ", " Whoever willfully incites or urges other persons to engage in a riot shall be punished by imprisonment for not more than 180 days or a fine of not more than the amount set forth in ", " If in the course and as a result of a riot a person suffers serious bodily harm or there is property damage in excess of $5,000, every person who willfully incited or urged others to engage in the riot shall be punished by imprisonment for not more than 10 years or a fine of not more than the amount set forth in ", " 1981 Ed., licensed or otherwise authorized to provide health care services in the District. (4) ”Person“ means: (A) The chief medical officer of a medical facility or the chief medical officer’s designee; (B) The chief executive officer of a medical facility or the chief executive officer’s designee; (C) An agent of a medical facility; or. (D) A law enforcement officer in the performance of the enforcement officer’s official duty.” “§ 102. Interference with entering and leaving a medical facility or home. (a) A person shall not act alone or in concert with others with the intent to prevent another person from entering or leaving a medical facility. A person shall not detain a person or obstruct, impede, or hinder a person’s free passage. (b) A person shall not act alone or in concert with others with the intent to prevent a medical provider or a member of the medical provider’s family from entering or leaving the medical provider’s home. (c) Subsections (a) and (b) of this section shall not be construed to prohibit any lawful picketing or assembly. (d) Any person who violates either subsection (a) or (b) of this section, upon conviction, shall be fined not more than $1,000, imprisoned for not more than 6 months, or both.”", " Shall be fined not less than $1,000 and not more than $5,000, and in addition may be imprisoned not more than 30 days; or"], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/13/"},
{"chapter": "Chapter 6. Breaking into Devices Designed to Receive Currency.", "title": ["§ 22–601. Breaking and entering vending machines and similar devices."], "text": ["Whoever in the District of Columbia breaks open, opens, or enters, without right, any parking meter, coin telephone, vending machine dispensing goods or services, money changer, or any other device designed to receive currency, with intent to carry away any part of such device or anything contained therein, shall be sentenced to a term of imprisonment of not more than 3 years or to a fine of not more than the amount set forth in "], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/6/"},
{"chapter": "Chapter 5. Bigamy.", "title": ["§ 22–501. Bigamy."], "text": [" Whoever, having a spouse or domestic partner living, marries or enters a domestic partnership with another shall be deemed guilty of bigamy, and on conviction thereof shall suffer imprisonment for not less than 2 nor more than 7 years; provided, that this section shall not apply to any person whose:", " rewrote the section, which had read as follows: “Whoever, having a husband or wife living, marries another shall be deemed guilty of bigamy, and on conviction thereof shall suffer imprisonment for not less than 2 nor more than 7 years; provided, that this section shall not apply to any person whose husband or wife has been continually absent for 5 successive years next before such marriage without being known to such person to be living within that time, or whose marriage to said living husband or wife shall have been dissolved by a valid decree of a competent court, or shall have been pronounced void by a valid decree of a competent court on the ground of the nullity of the marriage contract.”"], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/5/"},
{"chapter": "Chapter 9B. Criminal Street Gangs.", "title": ["§ 22–951. Criminal street gangs."], "text": [" or imprisoned for not more than 6 months, or both.", " or imprisoned for not more than 5 years, or both.", " or imprisoned for not more than 10 years, or both."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/9B/"},
{"chapter": "Chapter 4. Assault; Mayhem; Threats.", "title": ["§ 22–401. Assault with intent to kill, rob, or poison, or to commit first degree sexual abuse, second degree sexual abuse or child sexual abuse.", "§ 22–402. Assault with intent to commit mayhem or with dangerous weapon.", "§ 22–403. Assault with intent to commit any other offense.", "§ 22–404. Assault or threatened assault in a menacing manner; stalking.", "§ 22–404.01. Aggravated assault.", "§ 22–404.02. Assault on a public vehicle inspection officer.", "§ 22–404.03. Aggravated assault on a public vehicle inspection officer.", "§ 22–405. Assault on member of police force, campus or university special police, or fire department.", "§ 22–405.01. Resisting arrest.", "§ 22–406. Mayhem or maliciously disfiguring.", "§ 22–407. Threats to do bodily harm."], "text": ["Every person convicted of any assault with intent to kill or to commit first degree sexual abuse, second degree sexual abuse, or child sexual abuse, or to commit robbery, or mingling poison with food, drink, or medicine with intent to kill, or wilfully poisoning any well, spring, or cistern of water, shall be sentenced to imprisonment for not less than 2 years or more than 15 years. In addition to any other penalty provided under this section, a person may be fined an amount not more than the amount set forth in ", "Every person convicted of an assault with intent to commit mayhem, or of an assault with a dangerous weapon, shall be sentenced to imprisonment for not more than 10 years. In addition to any other penalty provided under this section, a person may be fined an amount not more than the amount set forth in ", "Whoever assaults another with intent to commit any other offense which may be punished by imprisonment in the penitentiary shall be imprisoned not more than 5 years. In addition to any other penalty provided under this section, a person may be fined an amount not more than the amount set forth in ", " or be imprisoned not more than 180 days, or both.", " or be imprisoned not more than 3 years, or both. For the purposes of this paragraph, the term “significant bodily injury” means an injury that requires hospitalization or immediate medical attention.", " rewrote subsec. (a), which had read as follows: “(a) Whoever unlawfully assaults, or threatens another in a menacing manner, shall be fined not more than $1,000 or be imprisoned not more than 180 days, or both.”", " or be imprisoned for not more than 10 years, or both.", " or be imprisoned for not more than 5 years, or both.", ", or be imprisoned for not more than 180 days; and", ", or be imprisoned for not more than 10 years, or both; and", " Whoever without justifiable and excusable cause assaults a law enforcement officer on account of, or while that law enforcement officer is engaged in the performance of his or her official duties shall be guilty of a misdemeanor and, upon conviction, shall be  imprisoned not more than 6 months or fined not more than the amount set forth in ", " A person who violates subsection (b) of this section and causes significant bodily injury to the law enforcement officer, or commits a violent act that creates a grave risk of causing significant bodily injury to the officer, shall be guilty of a felony and, upon conviction, shall be imprisoned not more than 10 years or fined not more than the amount set forth in ", " Whoever without justifiable and excusable cause intentionally resists an arrest by an individual who he or she has reason to believe is a law enforcement officer or prevents that individual from making or attempting to make an arrest of or detain another person shall be guilty of a misdemeanor and, upon conviction, shall be imprisoned not more than 6 months or fined not more than the amount set forth in ", "Every person convicted of mayhem or of maliciously disfiguring another shall be imprisoned for not more than 10 years. In addition to any other penalty provided under this section, a person may be fined an amount not more than the amount set forth in ", " or imprisoned not more than 6 months, or both, and, in addition thereto, or in lieu thereof, may be required to give bond to keep the peace for a period not exceeding 1 year."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/4/"},
{"chapter": "Chapter 31B. Terrorism.", "title": ["§ 22–3151. Short title.", "§ 22–3152. Definitions.", "§ 22–3153. Acts of terrorism; penalties.", "§ 22–3154. Manufacture or possession of a weapon of mass destruction.", "§ 22–3155. Use, dissemination, or detonation of a weapon of mass destruction.", "§ 22–3156. Jurisdiction."], "text": [" A person who commits first degree murder that constitutes an act of terrorism shall, upon conviction, be punished by imprisonment for life without the possibility of release.", " A person who commits murder of a law enforcement officer or public safety employee that constitutes an act of terrorism shall, upon conviction, be punished by imprisonment for life without the possibility of release.", " A person who commits murder in the second degree that constitutes an act of terrorism may, upon conviction, be punished by imprisonment for life.", " A person who commits manslaughter that constitutes an act of terrorism may, upon conviction, be punished by imprisonment for life.", " A person who commits kidnapping that constitutes an act of terrorism may, upon conviction, be punished by imprisonment for life.", " A person who commits any assault with intent to kill that constitutes an act of terrorism may, upon conviction, be punished by imprisonment for not more than 30 years.", " A person who commits mayhem or maliciously disfiguring another that constitutes an act of terrorism may, upon conviction, be punished by imprisonment for not more than 20 years.", " A person who commits arson that constitutes an act of terrorism may, upon conviction, be punished by imprisonment for not more than 20 years.", " A person who commits malicious burning, destruction, or injury of another’s property, if such property is valued at $500,000 or more, that constitutes an act of terrorism may, upon conviction, be punished by imprisonment for not more than 20 years.", " A person who attempts or conspires to commit first degree murder, murder of a law enforcement officer or public safety employee, murder in the second degree, manslaughter, or kidnapping that constitutes an act of terrorism may be punished by imprisonment for not more than 30 years.", " A person who attempts or conspires to commit any assault with intent to kill that constitutes an act of terrorism may, upon conviction, be punished by imprisonment for not more than 20 years.", " A person who attempts or conspires to commit mayhem or maliciously disfiguring another, arson, or malicious burning, destruction, or injury of another’s property, if such property is valued at $500,000 or more, that constitutes an act of terrorism may, upon conviction, be punished by imprisonment of not more than 15 years.", " A person who provides material support or resources for an act of terrorism may, upon conviction, be punished by imprisonment for not more than 20 years.", " A person who solicits material support or resources to commit an act of terrorism may, upon conviction, be punished by imprisonment for not more than 20 years.", " A person who manufactures or possesses a weapon of mass destruction capable of causing multiple deaths, serious bodily injuries to multiple persons, or massive destruction of property may, upon conviction, be punished by imprisonment for life.", " A person who attempts or conspires to manufacture or possess a weapon of mass destruction capable of causing multiple deaths, serious bodily injuries to multiple persons, or massive destruction of property may, upon conviction, be punished by imprisonment for not more than 30 years.", " A person who uses, disseminates, or detonates a weapon of mass destruction capable of causing multiple deaths, serious bodily injuries to multiple persons, or massive destruction of property may, upon conviction, be punished by imprisonment for life.", " A person who attempts or conspires to use, disseminate, or detonate a weapon of mass destruction capable of causing multiple deaths, serious bodily injuries to multiple persons, or massive destruction of property may, upon conviction, be punished by imprisonment for not more than 30 years."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/31B/"},
{"chapter": "Chapter 34. Use of “District of Columbia” by Certain Persons.", "title": ["§ 22–3401. Use of “District of Columbia” or similar designation by private detective or collection agency — Prohibited.", "§ 22–3402. Use of “District of Columbia” or similar designation by private detective or collection agency — Penalty.", "§ 22–3403. Use of “District of Columbia” or similar designation by private detective or collection agency — Prosecutions for violations."], "text": [" or by imprisonment for not more than 90 days, or by both such fine and imprisonment."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/34/"},
{"chapter": "Chapter 33. Trespass; Injuries to Property.", "title": ["§ 22–3301. Forcible entry and detainer.", "§ 22–3302. Unlawful entry on property.", "§ 22–3303. Grave robbery; buying or selling dead bodies.", "§ 22–3305. Placing explosives with intent to destroy or injure property.", "§ 22–3306. Defacing books, manuscripts, publications, or works of art.", "§ 22–3307. Destroying or defacing public records.", "§ 22–3309. Destroying boundary markers.", "§ 22–3310. Destroying vines, bushes, shrubs, trees or protections thereof; penalty.", "§ 22–3311. Disorderly conduct in public buildings or grounds; injury to or destruction of United States property.", "§ 22–3312.01. Defacing public or private property.", "§ 22–3312.02. Defacing or burning cross or religious symbol; display of certain emblems.", "§ 22–3312.03. Wearing hoods or masks.", "§ 22–3312.04. Penalties.", "§ 22–3312.05. Definitions.", "§ 22–3313. Destroying or defacing building material for streets.", "§ 22–3314. Destroying cemetery railing or tomb.", "§ 22–3318. Malicious pollution of water.", "§ 22–3319. Placing obstructions on or displacement of railway tracks.", "§ 22–3320. Obstructing public road; removing milestones.", "§ 22–3321. Obstructing public highway.", "§ 22–3322. Fines under § 22-3321 to be collected in name of United States."], "text": ["Whoever shall forcibly enter upon any premises, or, having entered without force, shall unlawfully detain the same by force against any person previously in the peaceable possession of the same and claiming right thereto, shall be punished by imprisonment for not more than 1 year or a fine of not more than the amount set forth in ", ", imprisonment for not more than 180 days, or both. The presence of a person in any private dwelling, building, or other property that is otherwise vacant and boarded-up or otherwise secured in a manner that conveys that it is vacant and not to be entered, or displays a no trespassing sign, shall be prima facie evidence that any person found in such property has entered against the will of the person in legal possession of the property.", ", imprisonment for not more than 6 months, or both.", " rewrote the section, which had read as follows: “Any person who, without lawful authority, shall enter, or attempt to enter, any public or private dwelling, building, or other property, or part of such dwelling, building, or other property, against the will of the lawful occupant or of the person lawfully in charge thereof, or being therein or thereon, without lawful authority to remain therein or thereon shall refuse to quit the same on the demand of the lawful occupant, or of the person lawfully in charge thereof, shall be deemed guilty of a misdemeanor, and on conviction thereof shall be punished by a fine not exceeding $100 or imprisonment in the Jail for not more than 6 months, or both, in the discretion of the court. The presence of a person in any private dwelling, building, or other property that is otherwise vacant and boarded-up or otherwise secured in a manner that conveys that it is vacant and not to be entered, or displays a no trespassing sign, shall be prima facie evidence that any person found in such property has entered against the will of the person in legal possession of the property.”", "Whoever, without legal authority or without the consent of the nearest surviving relative, shall disturb or remove any dead body from a grave for the purpose of dissecting, or of buying, selling, or in any way trafficking in the same, shall be imprisoned not less than 1 year nor more than 3 years. In addition to any other penalty provided under this section, a person may be fined an amount not more than the amount set forth in ", " and by imprisonment for not less than 2 years or more than 10 years.", ", and by imprisonment for not less than 1 month nor more than 180 days, or both, for every such offense.", " or imprisoned not more than 180  days, or both.", " and imprisoned not exceeding 180 days.", " or imprisonment for not more than 90 days, or both; or", " or imprisonment for not more than 30 days, or both.", ", or imprisoned not more than 6 months, or both.", ", or imprisoned for a period not to exceed 180 days, or both. Civil fines, penalties, and fees may be imposed as alternative sanctions for any infraction of the provisions of ", ", or imprisonment not to exceed 180 days, or both.", " shall be fined not less than $250 or more than $5,000, or imprisoned for a period not to exceed 1 year, or both.", " shall be guilty of a misdemeanor punishable by a fine not to exceed $500, or imprisonment not to exceed 1 year, or both.”", ", or imprisoned at hard labor not more than 3 years nor less than 1 year.", "Whoever maliciously places an obstruction on or near the track of any steam or street railway, or displaces or injures anything appertaining to such track, with intent to endanger the passage of any locomotive or car, shall be imprisoned for not more than 10 years. In addition to any other penalty provided under this section, a person may be fined an amount not more than the amount set forth in ", "If any person shall alter or in any manner obstruct or encroach on a public road, or cut, destroy, deface, or remove any milestones set up on such road, or place any rubbish, dirt, logs, or make any pit or hole therein, such person may be indicted, and, upon conviction thereof before the proper court, shall be fined or imprisoned, in the discretion of the court, according to the nature of the offense.", "Any person who, without lawful authority, shall obstruct the free use of any of the public highways, which had been used and recognized as public county roads for 25 years prior to May 3, 1862, and which were thereafter duly surveyed, recorded, and declared public highways according to law, shall be subject to a fine for each offense of not less than $100 nor more than $250 and be imprisoned till the fine and the costs of suit and collection of the same are paid."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/33/"},
{"chapter": "Chapter 32. Theft; Fraud; Stolen Property; Forgery; and Extortion.", "titles": ["§ 22–3201. Definitions.", "§ 22–3202. Aggregation of amounts received to determine grade of offense.", "§ 22–3203. Consecutive sentences.", "§ 22–3204. Case referral.", "§ 22–3211. Theft.", "§ 22–3212. Penalties for theft.", "§ 22–3213. Shoplifting.", "§ 22–3214. Commercial piracy.", "§ 22–3214.01. Deceptive labeling.", "§ 22–3214.02. Unlawful operation of a recording device in a motion picture theater.", "§ 22–3215. Unauthorized use of motor vehicles.", "§ 22–3216. Taking property without right.", "§ 22–3218.01. Definitions.", "§ 22–3218.02. Unlawful acts.", "§ 22–3218.03. Presumptions and rebuttal evidence.", "§ 22–3218.04. Penalties for violation.", "§ 22–3221. Fraud.", "§ 22–3222. Penalties for fraud.", "§ 22–3223. Credit card fraud.", "§ 22–3224. Fraudulent registration.", "§ 22–3224.01. Jurisdiction.", "§ 22–3225.01. Definitions.", "§ 22–3225.02. Insurance fraud in the first degree.", "§ 22–3225.03. Insurance fraud in the second degree.", "§ 22–3225.03a. Misdemeanor insurance fraud.", "§ 22–3225.04. Penalties.", "§ 22–3225.05. Restitution.", "§ 22–3225.06. Indemnity.", "§ 22–3225.07. Practitioners.", "§ 22–3225.08. Investigation and report of insurance fraud.", "§ 22–3225.09. Insurance fraud prevention and detection.", "§ 22–3225.10. Regulations.", "§ 22–3225.11. Limited law enforcement authority.", "§ 22–3225.12. Annual anti-fraud activity reporting requirement.", "§ 22–3225.13. Immunity.", "§ 22–3225.14. Prohibition of solicitation.", "§ 22–3225.15. Jurisdiction.", "§ 22–3226.01. Definitions.", "§ 22–3226.02. Application for a certificate of registration of telephone solicitor.", "§ 22–3226.03. Surety bond requirements for telephone solicitors.", "§ 22–3226.04. Security alternative to surety bonds.", "§ 22–3226.05. Exemptions.", "§ 22–3226.06. Unlawful acts and practices.", "§ 22–3226.07. Deceptive acts and practices prohibited.", "§ 22–3226.08. Abusive telemarketing acts or practices.", "§ 22–3226.09. Civil penalties.", "§ 22–3226.10. Criminal penalties.", "§ 22–3226.11. Private right of action.", "§ 22–3226.12. Statute of limitations period.", "§ 22–3226.13. Task force to combat fraud.", "§ 22–3226.15. General disclosures.", "§ 22–3227.01. Definitions.", "§ 22–3227.02. Identity theft.", "§ 22–3227.03. Penalties for identity theft.", "§ 22–3227.04. Restitution.", "§ 22–3227.05. Correction of public records.", "§ 22–3227.06. Jurisdiction.", "§ 22–3227.07. Limitations.", "§ 22–3227.08. Police reports.", "§ 22–3231. Trafficking in stolen property.", "§ 22–3232. Receiving stolen property.", "§ 22–3233. Altering or removing motor vehicle identification numbers.", "§ 22–3234. Altering or removing bicycle identification numbers.", "§ 22–3241. Forgery.", "§ 22–3242. Penalties for forgery.", "§ 22–3251. Extortion.", "§ 22–3252. Blackmail."], "text": [" or imprisoned for not more than 10 years, or both, if the value of the property obtained or used is $1,000 or more.", " or imprisoned for not more than 180 days, or both, if the property obtained or used has some value.", " or imprisoned for not more than 15 years and for a mandatory-minimum term of not less than one year, or both. A person sentenced under this subsection shall not be released from prison, granted probation, or granted suspension of sentence, prior to serving the mandatory-minimum.", " or imprisoned for not more than 90 days, or both.", " A person who offers tangible personal property for sale to the public, or an employee or agent of such a person, who detains or causes the arrest of a person in a place where the property is offered for sale shall not be held liable for detention, false imprisonment, malicious prosecution, defamation, or false arrest, in any proceeding arising out of such detention or arrest, if:", " or imprisoned for not more than 180 days, or both.", " or imprisoned for not more than 1 year, or both.", " or imprisoned for not more than 5 years, or both.", " or imprisoned for not more than 90 days, or both.", " A theater owner, or an employee or agent of a theater owner, who detains or causes the arrest of a person in, or immediately adjacent to, a motion picture theater shall not be held liable for detention, false imprisonment, malicious prosecution, defamation, or false arrest in any proceeding arising out of such detention or arrest, if:", ", imprisoned for not more than 5 years, or both.", ", imprisoned for not more than 10 years, or both, consecutive to the penalty imposed for the crime of violence; and", " If serious bodily injury results, imprisoned for not less than 5 years, consecutive to the penalty imposed for the crime of violence.", ", or imprisoned for not less than 30 months nor more than 15 years, or both.", ", imprisoned for not more than 3 years, or both.", " or imprisoned for not more than 90 days, or both.", " shall be guilty of a misdemeanor, and, upon a conviction, shall be imprisoned for not more than 60 days, or fined, not more than the amount set forth in ", " shall be imprisoned for not more than 180 days, or fined, not more than the amount set forth in ", " or twice the value of the property obtained or lost, whichever is greater, or imprisoned for not more than 10 years, or both, if the value of the property obtained or lost is $1,000 or more; and", " or imprisoned for not more than 180 days, or both, if the property obtained or lost has some value.", " or twice the value of the property which was the object of the scheme or systematic course of conduct, whichever is greater, or imprisoned for not more than 3 years, or both, if the value of the property which was the object of the scheme or systematic course of conduct is $1,000 or more; and", " or imprisoned for not more than 180 days, or both, if the property that was the object of the scheme or systematic course of conduct has some value.", ", imprisoned for not more than 180 days, or both.", ", imprisoned for not more than 10 years, or both, if the value of the property or services obtained or paid for is $1,000 or more.", " or imprisoned for not more than 90 days, or both.", " or imprisoned for not more than 15 years, or both.", " or imprisoned for not more than 5 years, or both.", " or imprisoned for not more than 10 years, or both.", " or imprisoned for not more than 180 days, or both.", "“WARNING: It is a crime to provide false or misleading information to an insurer for the purpose of defrauding the insurer or any other person. Penalties include imprisonment and/or fines. In addition, an insurer may deny insurance benefits if false information materially related to a claim was provided by the applicant.”.", " or imprisonment for not more than 4 years, or both.", " or imprisonment for not more than 3 years, or both.", " or imprisonment for not more than 6 months, or both.", ", (2) twice the value of the property obtained or (3) twice the amount of the financial injury, whichever is greatest, or imprisoned for not more than 10 years, or both, if the property obtained, or attempted to be obtained, or the amount of the financial injury is $1,000 or more.", " or imprisoned for not more than 180 days, or both, if the property obtained, or attempted to be obtained, or the amount of the financial injury, has some value, or if another person is falsely accused of, or arrested for, committing a crime because of the use, without permission, of that person’s personal identifying information.", " or imprisoned for not more than 10 years, or both.", " or imprisoned not more than 7 years, or both, if the value of the stolen property is $1,000 or more.", " or imprisoned not more than 180 days, or both, if the stolen property has some value.", " Any person who violates subsection (a) of this section shall be guilty of a misdemeanor and, upon conviction, shall be imprisoned for not more than 180 days, or fined not more than the amount set forth in ", " Any person who violates subsection (a) of this section shall be guilty of a felony if the value of the motor vehicle or motor vehicle part is $1,000 or more and, upon conviction, shall be imprisoned for not more than 5 years, or fined not more than the amount set forth in ", " Any person who violates subsection (a) of this section shall be guilty of a misdemeanor and, upon conviction, shall be imprisoned for not more than 180 days, or fined not more than the amount set forth in ", " or imprisoned for not more than 10 years, or both, if the written instrument purports to be:", " or imprisoned for not more than 5 years, or both, if the written instrument is or purports to be:", " or imprisoned for not more than 3 years, or both, in any other case.", " or imprisoned for not more than 10 years, or both.", " or imprisoned for not more than 5 years, or both."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/32/"},
{"chapter": "Chapter 31A. Stalking.", "title": ["§ 22–3131. Legislative intent.", "§ 22–3132. Definitions.", "§ 22–3133. Stalking.", "§ 22–3134. Penalties.", "§ 22–3135. Jurisdiction."], "text": [", imprisoned for not more than 12 months, or both.", ", imprisoned for not more than 5 years, or both, if the person:", ", imprisoned for not more than 10 years, or both, if the person has 2 or more prior convictions in any jurisdiction for stalking any person, at least one of which was for a jury demandable offense."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/31A/"},
{"chapter": "Chapter 31. Sexual Performance Using Minors.", "title": ["§ 22–3101. Definitions.", "§ 22–3102. Prohibited acts.", "§ 22–3103. Penalties.", "§ 22–3104. Affirmative defenses."], "text": [" or imprisonment for not more than 10 years, or both for the first offense; or", " or imprisonment for not more than 20 years, or both for the 2nd and each subsequent offense."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/31/"},
{"chapter": "Chapter 30A. Non-Consensual Pornography.", "title": ["§ 22–3051. Definitions.", "§ 22–3052. Unlawful disclosure.", "§ 22–3053. First-degree unlawful publication.", "§ 22–3054. Second degree unlawful publication.", "§ 22–3055. Exclusions.", "§ 22–3056. Affirmative defenses.", "§ 22–3057. Jurisdiction."], "text": [", imprisoned for not more than 180 days, or both.", ", imprisoned for not more than 3 years, or both.", ", imprisoned for not more than 180 days, or both."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/30A/"},
{"chapter": "Chapter 30. Sexual Abuse.", "titles": ["§ 22–3001. Definitions.", "§ 22–3002. First degree sexual abuse.", "§ 22–3003. Second degree sexual abuse.", "§ 22–3004. Third degree sexual abuse.", "§ 22–3005. Fourth degree sexual abuse.", "§ 22–3006. Misdemeanor sexual abuse.", "§ 22–3007. Defense to sexual abuse.", "§ 22–3008. First degree child sexual abuse.", "§ 22–3009. Second degree child sexual abuse.", "§ 22–3009.01. First degree sexual abuse of a minor.", "§ 22–3009.02. Second degree sexual abuse of a minor.", "§ 22–3009.03. First degree sexual abuse of a secondary education student.", "§ 22–3009.04. Second degree sexual abuse of a secondary education student.", "§ 22–3010. Enticing a child or minor.", "§ 22–3010.01. Misdemeanor sexual abuse of a child or minor.", "§ 22–3010.02. Arranging for a sexual contact with a real or fictitious child.", "§ 22–3011. Defenses to child sexual abuse and sexual abuse of a minor.", "§ 22–3012. State of mind proof requirement.", "§ 22–3013. First degree sexual abuse of a ward, patient, client, or prisoner.", "§ 22–3014. Second degree sexual abuse of a ward, patient, client, or prisoner.", "§ 22–3015. First degree sexual abuse of a patient or client.", "§ 22–3016. Second degree sexual abuse of a patient or client.", "§ 22–3017. Defenses to sexual abuse of a ward, patient, or client.", "§ 22–3018. Attempts to commit sexual offenses.", "§ 22–3019. No immunity from prosecution for spouses or domestic partners.", "§ 22–3020. Aggravating circumstances.", "§ 22–3020.51. Definitions.", "§ 22–3020.52. Reporting requirements and privileges.", "§ 22–3020.53. Defense to non-reporting.", "§ 22–3020.54. Penalties.", "§ 22–3020.55. Immunity from liability.", "§ 22–3021. Reputation or opinion evidence of victim’s past sexual behavior inadmissible.", "§ 22–3022. Admissibility of other evidence of victim’s past sexual behavior.", "§ 22–3023. Prompt reporting.", "§ 22–3024. Privilege inapplicable for spouses or domestic partners."], "text": [" A person shall be imprisoned for any term of years or for life, and in addition, may be fined not more than the amount set forth in ", " The court may impose a prison sentence in excess of 30 years only in accordance with ", ". For purposes of imprisonment following revocation of release authorized by ", "A person shall be imprisoned for not more than 20 years and may be fined not more than the amount set forth in ", "A person shall be imprisoned for not more than 10 years and may be fined not more than the amount set forth in ", "A person shall be imprisoned for not more than 5 years and, in addition, may be fined not more than the amount set forth in ", "Whoever engages in a sexual act or sexual contact with another person and who should have knowledge or reason to know that the act was committed without that other person’s permission, shall be imprisoned for not more than 180 days and, in addition, may be fined in an amount not more than the amount set forth in ", "Whoever, being at least 4 years older than a child, engages in a sexual act with that child or causes that child to engage in a sexual act shall be imprisoned for any term of years or for life and, in addition, may be fined not more than the amount set forth in ", ". However, the court may impose a prison sentence in excess of 30 years only in accordance with ", ". For purposes of imprisonment following revocation of release authorized by ", "Whoever, being at least 4 years older than a child, engages in sexual contact with that child or causes that child to engage in sexual contact shall be imprisoned for not more than 10 years and, in addition, may be fined in an amount not more than the amount set forth in ", "Whoever, being 18 years of age or older, is in a significant relationship with a minor, and engages in a sexual act with that minor or causes that minor to engage in a sexual act shall be imprisoned for not more than 15 years and may be fined not more than the amount set forth in ", "Whoever, being 18 years of age or older, is in a significant relationship with a minor and engages in a sexual contact with that minor or causes that minor to engage in a sexual contact shall be imprisoned for not more than 7 1/2 years and may be fined not more than the amount set forth in ", "Any teacher, counselor, principal, coach, or other person of authority in a secondary level school who engages in a sexual act with a student under the age of 20 years enrolled in that school or school system, or causes that student to engage in a sexual act, shall be imprisoned for not more than 10 years, fined not more than the amount set forth in ", "Any teacher, counselor, principal, coach, or other person of authority in a secondary level school who engages in sexual conduct with a student under the age of 20 years enrolled in that school or school system, or causes that student to engage in sexual conduct, shall be imprisoned for not more than 5 years, fined not more than the amount set forth in ", ", or (2) seduces, entices, allures, convinces, or persuades or attempts to seduce, entice, allure, convince, or persuade a child or minor to engage in a sexual act or contact shall be imprisoned for not more than 5 years or may be fined not more than the amount set forth in ", " Whoever, being at least 4 years older than the purported age of a person who represents himself or herself to be a child, attempts (1) to seduce, entice, allure, convince, or persuade any person who represents himself or herself to be a child to engage in a sexual act or contact, or (2) to entice, allure, convince, or persuade any person who represents himself or herself to be a child to go to any place for the purpose of engaging in a sexual act or contact shall be imprisoned for not more than 5 years or may be fined not more than the amount set forth in ", " shall be imprisoned for not more than 5 years and, in addition, may be fined in an amount not to exceed $50,000.”", " Whoever, being 18 years of age or older and more than 4 years older than a child, or being 18 years of age or older and being in a significant relationship with a minor, engages in sexually suggestive conduct with that child or minor shall be imprisoned for not more than 180 days, or fined not more than the amount set forth in ", " A person who violates subsection (a) of this section shall be imprisoned for not more than 5 years, fined not more than the amount set forth in ", "Any staff member, employee, contract employee, consultant, or volunteer at a hospital, treatment facility, detention or correctional facility, group home, or other institution; anyone who is an ambulance driver or attendant, a bus driver or attendant, or person who participates in the transportation of a ward, patient, client, or prisoner to and from such institutions; or any official custodian of a ward, patient, client, or prisoner, who engages in a sexual act with a ward, patient, client, or prisoner, or causes a ward, patient, client, or prisoner to engage in or submit to a sexual act shall be imprisoned for not more than 10 years or fined not more than the amount set forth in ", "Any staff member, employee, contract employee, consultant, or volunteer at a hospital, treatment facility, detention or correctional facility, group home, or other institution; anyone who is an ambulance driver or attendant, a bus driver or attendant, or person who participates in the transportation of a ward, patient, client, or prisoner to and from such institutions; or any official custodian of a ward, patient, client, or prisoner, who engages in a sexual contact with a ward, patient, client, or prisoner, or causes a ward, patient, client, or prisoner, to engage in or submit to a sexual contact shall be imprisoned for not more than 5 years or fined not more than the amount set forth in ", " Any person found guilty pursuant to subsection (a) of this section shall be imprisoned for not more than 10 years and, in addition, may be fined not more than the amount set forth in ", " Any person found guilty pursuant to subsection (a) of this section shall be imprisoned for not more than 5 years and, in addition, may be fined not more than the amount set forth in ", "Any person who attempts to commit an offense under this subchapter shall be imprisoned for a term of years not to exceed 15 years where the maximum prison term authorized for the offense is life or for not more than 1/2 of the maximum prison sentence authorized for the offense and, in addition, may be fined an amount not to exceed 1/2 of the maximum fine authorized for the offense.", " Any person who is found guilty of an offense under this subchapter may receive a penalty up to 1 1/2 times the maximum penalty prescribed for the particular offense, and may receive a sentence of more than 30 years up to, and including life imprisonment without possibility of release for first degree sexual abuse or first degree child sexual abuse, if any of the following aggravating circumstances exists:", " substituted “a sentence of more than 30 years up to, and including life imprisonment without possibility of release for first degree sexual abuse or first degree child sexual abuse,” for “a life sentence without parole, if life imprisonment is the maximum penalty prescribed for the offense,”."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/30/"},
{"chapter": "Chapter 28. Robbery.", "title": ["§ 22–2801. Robbery.", "§ 22–2802. Attempt to commit robbery.", "§ 22–2803. Carjacking."], "text": ["Whoever by force or violence, whether against resistance or by sudden or stealthy seizure or snatching, or by putting in fear, shall take from the person or immediate actual possession of another anything of value, is guilty of robbery, and any person convicted thereof shall suffer imprisonment for not less than 2 years nor more than 15 years. In addition to any other penalty provided under this section, a person may be fined an amount not more than the amount set forth in ", ", by an overt act, shall be imprisoned for not more than 3 years or be fined not more than the amount set forth in ", " and be imprisoned for a mandatory-minimum term of not less than 7 years and a maximum term of not more than 21 years, or both.", " and be imprisoned for a mandatory-minimum term of not less than 15 years and a maximum term of not more than 40 years, or both. However, the court may impose a prison sentence in excess of 30 years only in accordance with ", ". For purposes of imprisonment following revocation of release authorized by ", " Notwithstanding any other provision of law, a person convicted of carjacking shall not be released from prison prior to the expiration of 7 years from the date of the commencement of the sentence, and a person convicted of armed carjacking shall not be released from prison prior to the expiration of 15 years from the date of the commencement of the sentence."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/28/"},
{"chapter": "Chapter 27A. Protest Targeting a Residence.", "title": ["§ 22–2751. Definitions.", "§ 22–2752. Engaging in an unlawful protest targeting a residence."], "text": [" or imprisoned for not more than 90 days."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/27A/"},
{"chapter": "Chapter 27. Prostitution; Pandering.", "titles": ["§ 22–2701. Engaging in prostitution or soliciting for prostitution.", "§ 22–2701.01. Definitions.", "§ 22–2703. Suspension of sentence; conditions; enforcement.", "§ 22–2704. Abducting or enticing child from his or her home for purposes of prostitution; harboring such child.", "§ 22–2705. Pandering; inducing or compelling an individual to engage in prostitution.", "§ 22–2706. Compelling an individual to live life of prostitution against his or her will.", "§ 22–2707. Procuring; receiving money or other valuable thing for arranging assignation.", "§ 22–2708. Causing spouse or domestic partner to live in prostitution.", "§ 22–2709. Detaining an individual in disorderly house for debt there contracted.", "§ 22–2710. Procuring for house of prostitution.", "§ 22–2711. Procuring for third persons.", "§ 22–2712. Operating house of prostitution.", "§ 22–2713. Premises occupied for lewdness, assignation, or prostitution declared nuisance.", "§ 22–2714. Abatement of nuisance under § 22-2713 by injunction — Temporary injunction.", "§ 22–2715. Abatement of nuisance under § 22-2713 by injunction — Trial; dismissal of complaint; prosecution; costs.", "§ 22–2716. Violation of injunction granted under § 22-2714.", "§ 22–2717. Order of abatement; sale of property; entry of closed premises punishable as contempt.", "§ 22–2718. Disposition of proceeds of sale.", "§ 22–2719. Bond for abatement; order for delivery of premises; effect of release.", "§ 22–2720. Tax for maintaining such nuisance.", "§ 22–2722. Keeping bawdy or disorderly houses.", "§ 22–2723. Property subject to seizure and forfeiture.", "§ 22–2724. Impoundment.", "§ 22–2725. Anti-Prostitution Vehicle Impoundment Proceeds Fund."], "text": [", imprisoned for not more than 90 days, or both, for the first offense; and", ", imprisoned not more than 180 days, or both, for the second offense.", ", imprisoned for not more than 2 years, or both.", " rewrote the section, which had read as follows: “It is unlawful for any person to engage in prostitution or to solicit for prostitution. The penalties for violation of this section shall be a fine of $500 or not more than 90 days imprisonment, or both, for the first offense, a fine of $750 or not more than 135 days imprisonment, or both, for the second offense, and a fine of $1,000 or not more than 180 days imprisonment, or both, for the third and each subsequent offense.”", " A person who violates subsection (a) of this section shall be guilty of a felony and, upon conviction, shall be punished by imprisonment for not more than 20 years, or by a fine of not more than the amount set forth in ", "“Any person who, for purposes of prostitution, persuades, entices, or forcibly abducts a child under 16 years of age from his or her home or usual abode, or from the custody and control of the child’s parents or guardian, shall be punished by imprisonment for not less than 2 years and not more than 20 years; and whoever knowingly secretes or harbors any child so persuaded, enticed, or abducted shall be punished by imprisonment for not more than 8 years.”", " Except as provided in paragraph (2) of this subsection, a person who violates subsection (a) or (b) of this section shall be guilty of a felony and, upon conviction, shall be punished by imprisonment for not more than 5 years, or by a fine of not more than the amount set forth in ", " A person who violates subsection (a) or (b) of this section when the individual so placed, caused, compelled, induced, enticed, procured, taken, detained, or used or attempted to be so placed, caused, compelled, induced, enticed, procured, taken, detained, or used is under the age of 18 years shall be guilty of a felony and, upon conviction, shall be punished by imprisonment for not more than 20 years or by a fine of not more than the amount set forth in ", " rewrote the section, which had previously read as follows: “Any person who, within the District of Columbia shall place or cause, induce, procure, or compel the placing of any individual in the charge or custody of any other person, or in a house of prostitution, with intent that such individual shall engage in prostitution, or who shall compel, induce, entice, or procure or attempt to compel, induce, entice, or procure any individual to reside with any other person for immoral purposes or for the purpose of prostitution, or who shall compel, induce, entice, or procure or attempt to compel, induce, entice, or procure any such individual to reside or continue to reside in a house of prostitution, or compel, induce, entice, or procure or attempt to compel, induce, entice, or procure such individual to engage in prostitution, or who takes or detains an individual against the individual’s will, with intent to compel such individual by force, threats, menace, or duress to marry the abductor or to marry any other person; or any parent, guardian, or other person having legal custody of the person of an individual, who consents to the individual’s taking or detention by any person, for the purpose of prostitution or sexual intercourse, shall be guilty of a felony and, upon conviction, shall be punished by imprisonment for not more than 5 years and by a fine of not more than $1,000.”", " Except as provided in paragraph (2) of this subsection, a person who violates subsection (a) of this section shall be guilty of a felony and, upon conviction, shall be punished by imprisonment for not more than 15 years or by a fine of not more than the amount set forth in ", " A person who violates subsection (a) of the section when the individual so detained or compelled is under the age of 18 years shall be guilty of a felony and, upon conviction, shall be punished by imprisonment for not more than 20 years or by a fine of not more than the amount set forth in ", " rewrote the section, which had previously read as follows: “Any person who, within the District of Columbia, by threats or duress, detains any individual against such individual’s will, for the purpose of prostitution or sexual intercourse, or any person who shall compel any individual against such individual’s will, to reside with him or her or with any other person for the purposes of prostitution or sexual intercourse, shall be guilty of a felony and, upon conviction, shall be punished by imprisonment for not more than 5 years and a fine of not more than $1,000.”", " Except as provided in paragraph (2) of this subsection, a person who violates subsection (a) of this section shall be guilty of a felony and, upon conviction, shall be punished by imprisonment for not more than 5 years or by a fine of not more than the amount set forth in ", " A person who violates subsection (a) of this section when the individual so arranged for or caused to engage in prostitution or a sexual act or contact is under the age of 18 years shall be guilty of a felony and, upon conviction, shall be punished by imprisonment for not more than 20 years or by a fine of not more than the amount set forth in ", " rewrote the section, which had previously read as follows: “Any person who, within the District of Columbia, shall receive any money or other valuable thing for or on account of arranging for or causing any individual to have sexual intercourse with any other person or to engage in prostitution, debauchery, or any other immoral act, shall be guilty of a felony and, upon conviction, shall be punished by imprisonment for not more than 5 years and a fine of not more than $1,000.”", "Any person who by force, fraud, intimidation, or threats, places or leaves, or procures any other person or persons to place or leave, a spouse or domestic partner in a house of prostitution, or to lead a life of prostitution, shall be guilty of a felony, and upon conviction thereof shall be imprisoned not less than one year nor more than 10 years. In addition to any other penalty provided under this section, a person may be fined an amount not more than the amount set forth in ", "Any person or persons who attempt to detain any individual in a disorderly house or house of prostitution because of any debt or debts such individual has contracted, or is said to have contracted, while living in said house of prostitution or disorderly house shall be guilty of a felony, and on conviction thereof be imprisoned for a term not less than one year nor more than 5 years. In addition to any other penalty provided under this section, a person may be fined an amount not more than the amount set forth in ", "Any person who, within the District of Columbia, shall pay or receive any money or other valuable thing for or on account of the procuring for, or placing in, a house of prostitution, for purposes of sexual intercourse, prostitution, debauchery, or other immoral act, any individual, shall be guilty of a felony and, upon conviction, shall be punished by imprisonment for not more than 5 years and by a fine of not more than the amount set forth in ", "Any person who, within the District of Columbia, shall receive any money or other valuable thing for or on account of procuring and placing in the charge or custody of another person for sexual intercourse, prostitution, debauchery, or other immoral purposes any individual shall be guilty of a felony and, upon conviction, shall be punished by imprisonment for not more than 5 years and by a fine of not more than the amount set forth in ", "Any person who, within the District of Columbia, knowingly, shall accept, receive, levy, or appropriate any money or other valuable thing, without consideration other than the furnishing of a place for prostitution or the servicing of a place for prostitution, from the proceeds or earnings of any individual engaged in prostitution shall be guilty of a felony and, upon conviction, shall be punished by imprisonment for not more than 5 years and by a fine of not more than the amount set forth in ", " or by imprisonment in the District Jail not less than three nor more than 6 months or by both fine and imprisonment.", " or imprisoned not more than 5 years, or both.", " substituted “$5,000 or imprisoned not more than 5 years, or both” for “$1,000 or imprisoned not more than 180 days, or both”."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/27/"},
{"chapter": "Chapter 26. Prison Misconduct.", "titles": ["§ 22–2601. Escape from institution or officer.", "§ 22–2603.01. Definitions.", "§ 22–2603.02. Unlawful possession of contraband.", "§ 22–2603.03. Penalties.", "§ 22–2603.04. Detainment power."], "text": [" or imprisoned not more than 5 years, or both, said sentence to begin, if the person is an escaped prisoner, upon the expiration of the original sentence or disposition for the offense for which he or she was confined, committed, or in custody at the time of his or her escape.", " “Penal institution” means any penitentiary, prison, jail, or secure facility owned, operated, or under the control of the Department of Corrections, whether located within the District of Columbia or elsewhere.", " rewrote the section, which had read as follows: “Any person, not authorized by law, or by the Mayor of the District of Columbia, or by the Director of the Department of Corrections of the District of Columbia, who introduces or attempts to introduce into or upon the grounds of any penal institution of the District of Columbia, whether located within the District of Columbia or elsewhere, any narcotic drug, weapon, or any other contraband article or thing, or any contraband letter or message intended to be received by an inmate thereof, shall be guilty of a felony, and, upon conviction thereof in the Superior Court of the District of Columbia or in any court of the United States, shall be punished by imprisonment for not more than 10 years.”", " A person convicted of violating this subchapter with regard to Class A contraband shall be imprisoned for not more than 10 years, fined not more than the amount set forth in ", " A person convicted of violating this subchapter with regard to Class B contraband shall be imprisoned for not more than 2 years, fined not more than the amount set forth in ", " shall be imprisoned for not more than 1 year, fined not more than the amount set forth in ", " Any term of imprisonment imposed on an inmate or prisoner pursuant to this section shall be:", " Consecutive to the term of imprisonment being served at the time this offense was committed; or", " If the inmate was confined pending trial or sentencing, consecutive to any term of imprisonment imposed in the case in which the inmate was being detained at the time this offense was committed."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/26/"},
{"chapter": "Chapter 25A. Presence in a Motor Vehicle Containing a Firearm.", "title": [], "text": [], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/25A/"},
{"chapter": "Chapter 25. Possession of Implements of Crime.", "title": ["§ 22–2501. Possession of implements of crime; penalty."], "text": ["No person shall have in his or her possession in the District any instrument, tool, or implement for picking locks or pockets, with the intent to use such instrument, tool, or implement to commit a crime. Whoever violates this section shall be imprisoned for not more than 180 days  and may be fined not more than  and, in addition, may be fined not more than the amount set forth in ", ", unless the violation occurs after he or she has been convicted in the District of a violation of this section or of a felony, either in the District or another jurisdiction, in which case he or she shall be imprisoned for not less than one year nor more than 5 years and, in addition, may be fined not more than the amount set forth in "], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/25/"},
{"chapter": "Chapter 24. Perjury; Related Offenses.", "title": ["§ 22–2402. Perjury.", "§ 22–2403. Subornation of perjury.", "§ 22–2404. False swearing.", "§ 22–2405. False statements."], "text": [" or imprisoned for not more than 10 years, or both.", " or imprisoned for not more than 10 years, or both.", " or imprisoned for not more than 3 years, or both.", " or imprisoned for not more than 180 days, or both. A violation of this section shall be prosecuted by the Attorney General for the District of Columbia or one of the Attorney General’s assistants."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/24/"},
{"chapter": "Chapter 23. Panhandling.", "title": ["§ 22–2301. Definitions.", "§ 22–2302. Prohibited acts.", "§ 22–2303. Permitted activity.", "§ 22–2304. Penalties.", "§ 22–2305. Conduct of prosecutions.", "§ 22–2306. Disclosure."], "text": [" or be imprisoned not more than 90 days or both."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/23/"},
{"chapter": "Chapter 22. Obscenity.", "title": ["§ 22–2201. Certain obscene activities and conduct declared unlawful; definitions; penalties; affirmative defenses; exception."], "text": [" or imprisoned not more than 180 days, or both. A person convicted of a 2nd or subsequent offense under subsection (a) or (b) of this section shall be fined not less than $1,000 and not more than the amount set forth in ", " or imprisoned not less than 6 months or more than 3 years, or both."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/22/"},
{"chapter": "Chapter 21. Murder; Manslaughter.", "title": ["§ 22–2101. Murder in the first degree — Purposeful killing; killing while perpetrating certain crimes.", "§ 22–2102. Murder in the first degree — Placing obstructions upon or displacement of railroads.", "§ 22–2103. Murder in the second degree.", "§ 22–2104. Penalty for murder in first and second degrees.", "§ 22–2104.01. Sentencing procedure for murder in the first degree.", "§ 22–2105. Penalty for manslaughter.", "§ 22–2106. Murder of law enforcement officer.", "§ 22–2107. Penalty for solicitation of murder or other crime of violence."], "text": ["Whoever, being of sound memory and discretion, kills another purposely, either of deliberate and premeditated malice or by means of poison, or in perpetrating or attempting to perpetrate an offense punishable by imprisonment in the penitentiary, or without purpose to do so kills another in perpetrating or in attempting to perpetrate any arson, as defined in ", ", first degree sexual abuse, first degree child sexual abuse, first degree cruelty to children, mayhem, robbery, or kidnaping, or in perpetrating or attempting to perpetrate any housebreaking while armed with or using a dangerous weapon, or in perpetrating or attempting to perpetrate a felony involving a controlled substance, is guilty of murder in the first degree. For purposes of imprisonment following revocation of release authorized by ", "Whoever maliciously places an obstruction upon a railroad or street railroad, or displaces or injures anything appertaining thereto, or does any other act with intent to endanger the passage of any locomotive or car, and thereby occasions the death of another, is guilty of murder in the first degree. For purposes of imprisonment following revocation of release authorized by ", ", kills another, is guilty of murder in the second degree. For purposes of imprisonment following revocation of release authorized by ", " The punishment for murder in the first degree shall be not less than 30 years nor more than life imprisonment without release, except that the court may impose a prison sentence in excess of 60 years only in accordance with ", ". The prosecution shall notify the defendant in writing at least 30 days prior to trial that it intends to seek a sentence of life imprisonment without release as provided in ", "; provided that, no person who was less than 18 years of age at the time the murder was committed shall be sentenced to life imprisonment without release.", " Notwithstanding any other provision of law, a person convicted of murder in the first degree shall not be released from prison prior to the expiration of 30 years from the date of the commencement of the sentence.", " Whoever is guilty of murder in the second degree shall be sentenced to a period of incarceration of not more than life, except that the court may impose a prison sentence in excess of 40 years only in accordance with ", " For purposes of imprisonment following revocation of release authorized by ", "“(a) The punishment for murder in the first degree shall be life imprisonment, except that the court may impose a punishment of life imprisonment without parole in accordance with § 22-2104.1. The prosecution shall notify the defendant in writing at least 30 days prior to trial that it intends to seek a sentence of life imprisonment without parole as provided in § 22-2104.1; provided that, no person who was less than 18 years of age at the time the murder was committed shall be sentenced to life imprisonment without parole.", "“(b) Notwithstanding any other provision of law, a person convicted of murder in the first degree and upon whom a sentence of life imprisonment is imposed shall be eligible for parole only after the expiration of 30 years from the date of the commencement of the sentence.", "“(c) Whoever is guilty of murder in the second degree shall be sentenced to a maximum period of incarceration of not less than 20 years and not more than life. Notwithstanding any other provision of law, where the maximum sentence imposed is life imprisonment, a minimum sentence shall be imposed which shall not exceed 20 years imprisonment.”", "Minimum sentence upon imposition of life imprisonment, see ", ", a separate sentencing procedure shall be conducted as soon as practicable after the trial has been completed to determine whether to impose a sentence of more than 60 years up to, and including, life imprisonment without possibility of release.", " The finding shall state in writing whether, beyond a reasonable doubt, 1 or more of the aggravating circumstances exist. If 1 or more aggravating circumstances exist, a sentence of more than 60 years up to, and including, life imprisonment without release may be imposed.", " substituted “release” for “parole” throughout the section; in subsec. (a), substituted “more than 60 years up to, and including,” for “life imprisonment or”; in subsec. (b), substituted “a finding shall be made” for “the court shall consider”; and, in subsec. (c), substituted “finding shall” for “court shall”, deleted “the court finds that” following “If”, and inserted “more than 60 years up to, and including”.", "Whoever is guilty of manslaughter shall be sentenced to a period of imprisonment not exceeding 30 years. In addition to any other penalty provided under this section, a person may be fined an amount not more than the amount set forth in ", " Whoever is guilty of soliciting a murder, whether or not such murder occurs, shall be sentenced to a period of imprisonment not exceeding 20 years, a fine not more than the amount set forth in ", ", whether or not such crime occurs, shall be sentenced to a period of imprisonment not exceeding 10 years, a fine of not more than the amount set forth in "], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/21/"},
{"chapter": "Chapter 20. Kidnapping.", "title": ["§ 22–2001. Definition and penalty; conspiracy."], "text": ["Whoever shall be guilty of, or of aiding or abetting in, seizing, confining, inveigling, enticing, decoying, kidnapping, abducting, concealing, or carrying away any individual by any means whatsoever, and holding or detaining, or with the intent to hold or detain, such individual for ransom or reward or otherwise, except, in the case of a minor, by a parent thereof, shall, upon conviction thereof, be punished by imprisonment for not more than 30 years. For purposes of imprisonment following revocation of release authorized by "], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/20/"},
{"chapter": "Chapter 19A. Interfering with Reports of Crime.", "title": ["§ 22–1931. Obstructing, preventing, or interfering with reports to or requests for assistance from law enforcement agencies, medical providers, or child welfare agencies."], "text": [" or imprisoned not more than 180 days, or both."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/19A/"},
{"chapter": "Chapter 19. Incest.", "title": ["§ 22–1901. Definition and penalty."], "text": ["If any person in the District related to another person within and not including the fourth degree of consanguinity, computed according to the rules of the Roman or civil law, shall marry or cohabit with or have sexual intercourse with such other so-related person, knowing him or her to be within said degree of relationship, the person so offending shall be deemed guilty of incest, and, on conviction thereof, shall be punished by imprisonment for not more than 12 years. In addition to any other penalty provided under this section, a person may be fined an amount not more than the amount set forth in "], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/19/"},
{"chapter": "Chapter 18A. Human Trafficking.", "title": ["§ 22–1831. Definitions.", "§ 22–1832. Forced labor.", "§ 22–1833. Trafficking in labor or commercial sex acts.", "§ 22–1834. Sex trafficking of children.", "§ 22–1835. Unlawful conduct with respect to documents in furtherance of human trafficking.", "§ 22–1836. Benefitting financially from human trafficking.", "§ 22–1837. Penalties.", "§ 22–1838. Forfeiture.", "§ 22–1839. Reputation or opinion evidence.", "§ 22–1840. Civil action.", "§ 22–1841. Data collection and dissemination.", "§ 22–1842. Training program.", "§ 22–1843. Public posting of human trafficking hotline.", "§ 22–1844. Motion to vacate conviction or expunge criminal records for victims of trafficking.", "§ 22–1845. Review by Court.", "§ 22–1846. Grants and denials of motion.", "§ 22–1847. Appeals."], "text": [" First degree sexual abuse of a ward, patient, client, or prisoner under ", ", imprisoned for not more than 20 years, or both.", " when the victim is held or provides services for more than 180 days shall be fined not more than 1 1/2 times the maximum fine authorized for the designated act, imprisoned for not more than 1 1/2 times the maximum term authorized for the designated act, or both.", ", imprisoned for not more than 5 years, or both.", " shall be fined or imprisoned up to the maximum fine or term of imprisonment for a violation of each referenced section.", " shall be fined not more than 1/2 the maximum fine otherwise authorized for the offense, imprisoned for not more than 1/2 the maximum term otherwise authorized for the offense, or both.", " If a person entitled to sue is imprisoned, insane, or similarly incapacitated at the time the cause of action accrues, so that it is impossible or impracticable for him or her to bring an action, then the time of the incapacity is not part of the time limited for the commencement of the action."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/18A/"},
{"chapter": "Chapter 18. General Offenses.", "title": ["§ 22–1801. “Writing” and “paper” defined.", "§ 22–1802. “Anything of value” defined.", "§ 22–1803. Attempts to commit crime.", "§ 22–1804. Second conviction.", "§ 22–1804a. Penalty for felony after at least 2 prior felony convictions.", "§ 22–1805. Persons advising, inciting, or conniving at criminal offense to be charged as principals.", "§ 22–1805a. Conspiracy to commit crime.", "§ 22–1806. Accessories after the fact.", "§ 22–1807. Punishment for offenses not covered by provisions of Code.", "§ 22–1808. Offenses committed beyond District.", "§ 22–1809. Prosecutions.", "§ 22–1810. Threatening to kidnap or injure a person or damage his property."], "text": [" or by imprisonment for not more than 180 days, or both. Except, whoever shall attempt to commit a crime of violence as defined in ", " or by imprisonment for not more than 5 years, or both.", " If any person: (1) is convicted of a criminal offense (other than a non-moving traffic offense) under a law applicable exclusively to the District of Columbia; and (2) was previously convicted of a criminal offense under any law of the United States or of a state or territory of the United States which offense, at the time of the conviction referred to in clause (1) of this subsection, is the same as, constitutes, or necessarily includes, the offense referred to in that clause, such person may be sentenced to pay a fine in an amount not more than one and one-half times the maximum fine prescribed for the conviction referred to in clause (1) of this subsection and sentenced to imprisonment for a term not more than one and one-half times the maximum term of imprisonment prescribed for that conviction. If such person was previously convicted more than once of an offense described in clause (2) of this subsection, such person may be sentenced to pay a fine in an amount not more than 3 times the maximum fine prescribed for the conviction referred to in clause (1) of this subsection and sentenced to imprisonment for a term not more than 3 times the maximum term of imprisonment prescribed for that conviction. No conviction with respect to which a person has been pardoned on the ground of innocence shall be taken into account in applying this section.", " If a person is convicted in the District of Columbia of a felony, having previously been convicted of 2 prior felonies not committed on the same occasion, the court may, in lieu of any sentence authorized, impose such greater term of imprisonment as it deems necessary, up to, and including, 30 years.", ", having previously been convicted of 2 prior crimes of violence not committed on the same occasion, the court, in lieu of the term of imprisonment authorized, shall impose a term of imprisonment of not less than 15 years and may impose such greater term of imprisonment as it deems necessary up to, and including, life without possibility of release.", " For purposes of imprisonment following revocation of release authorized by ", ", in subsec. (a), in par. (1), substituted “30 years” for “life”; in par. (2), substituted “such greater term of imprisonment as it deems necessary up to, and including, life without possibility of release” for “a term of imprisonment of life without possibility of parole”; and added par. (3).", ", in subsec. (a)(2), substituted “the court, in lieu of the term of imprisonment authorized, shall impose a term of imprisonment of not less than 15 years and may impose” for “the court may in lieu of any sentence authorized, impose”.", " or imprisoned not more than 5 years, or both, except that if the object of the conspiracy is a criminal offense punishable by less than 5 years, the maximum penalty for the conspiracy shall not exceed the maximum penalty provided for that offense.", " nor the maximum fine prescribed for the offense, the commission of which was the object of the conspiracy, whichever is less, or imprisoned not more than 15 years nor the maximum imprisonment prescribed for the offense, the commission of which was the object of the conspiracy, whichever is less, or both.", "Whoever shall be convicted of being an accessory after the fact to any crime punishable by death shall be punished by imprisonment for not more than 20 years. Whoever shall be convicted of being accessory after the fact to any crime punishable by imprisonment shall be punished by a fine or imprisonment, or both, as the case may be, not more than 1/2 the maximum fine or imprisonment, or both, to which the principal offender may be subjected.", " or by imprisonment for not more than 5 years, or both.", " or imprisoned not more than 20 years, or both."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/18/"},
{"chapter": "Chapter 17. Gambling.", "titles": ["§ 22–1701. Lotteries; promotion; sale or possession of tickets.", "§ 22–1702. Possession of lottery or policy tickets.", "§ 22–1703. Permitting sale of lottery tickets on premises.", "§ 22–1704. Gaming; setting up gaming table; inducing play.", "§ 22–1705. Gambling premises; definition; prohibition against maintaining; forfeiture; liens; deposit of moneys in Treasury; penalty; subsequent offenses.", "§ 22–1706. Three-card monte and confidence games.", "§ 22–1707. “Gaming table” defined.", "§ 22–1708. Gambling pools and bookmaking; athletic contest defined.", "§ 22–1713. Corrupt influence in connection with athletic contests.", "§ 22–1714. Immunity of witnesses; record.", "§ 22–1716. Statement of purpose.", "§ 22–1717. Permissible gambling activities.", "§ 22–1718. Advertising and promotion; sale and possession of lottery and numbers tickets and slips."], "text": [" or be imprisoned not more than 3 years, or both. The possession of any copy or record of any such chance, right, or interest, or of any such ticket, certificate, bill, token, or other device shall be prima facie evidence that the possessor of such copy or record did, at the time and place of such possession, keep, set up, or promote, or was at such time and place concerned as owner, agent, or clerk, or otherwise in managing, carrying on, promoting, or advertising a policy lottery, policy shop, or lottery.", " or be imprisoned for not more than 180 days, or both. For the purpose of this section, possession of any record, notation, receipt, ticket, certificate, bill, slip, token, paper, or writing shall be presumed to be knowing possession thereof.", ", or be imprisoned not more than 180 days, or both.", "Whoever shall in the District set up or keep any gaming table, or any house, vessel, or place, on land or water, for the purpose of gaming, or gambling device commonly called A B C, faro bank, E O, roulette, equality, keno, thimbles, or little joker, or any kind of gaming table or gambling device adapted, devised, and designed for the purpose of playing any game of chance for money or property, or shall induce, entice, and permit any person to bet or play at or upon any such gaming table or gambling device, or on the side of or against the keeper thereof, shall be punished by imprisonment for a term of not more than 5 years and, in addition, may be fined not more than the amount set forth in ", " Whoever violates this section shall be imprisoned not more than 180 days or fined not more than the amount set forth in ", ", or both, unless the violation occurs after the person has been convicted of a violation of this section, in which case the person may be imprisoned for not more than 5 years, or fined not more than the amount set forth in ", " and by imprisonment for not more than 180 days.", " or imprisoned not more than 180 days, or both.", " Whoever violates any provision of subsection (a) of this section shall be guilty of a felony, and, upon conviction thereof, shall be punished by imprisonment for not less than 1 year nor more than 5 years and by a fine of not more than the amount set forth in ", " Whoever violates any provision of subsection (b) of this section shall, upon conviction thereof, be punished by imprisonment for not more than 1 year and by a fine of not more than the amount set forth in "], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/17/"},
{"chapter": "Chapter 15. Forgery; Frauds.", "title": ["§ 22–1502. Forging or imitating brands or packaging of goods.", "§ 22–1510. Making, drawing, or uttering check, draft, or order with intent to defraud; proof of intent; “credit” defined.", "§ 22–1511. Fraudulent advertising.", "§ 22–1512. Prosecution under § 22-1511.", "§ 22–1513. Penalty under § 22-1511.", "§ 22–1514. Fraudulent interference or collusion in jury selection."], "text": [" or imprisoned not more than 180 days, or both.", " or imprisoned for not less than 1 year nor more than 3 years, or both; or if the amount of such check, draft, order, or other instrument has some value, be guilty of a misdemeanor and fined not more than the amount set forth in ", " or imprisoned not more than 180 days, or both. As against the maker or drawer thereof the making, drawing, uttering, or delivering by such maker or drawer of a check, draft, order, or other instrument, payment of which is refused by the drawee because of insufficient funds of the maker or drawer in its possession or control, shall be prima facie evidence of the intent to defraud and of knowledge of insufficient funds in or credit with such bank or other depository, provided such maker or drawer shall not have paid the holder thereof the amount due thereon, together with the amount of protest fees, if any, within 5 days after receiving notice in person, or writing, that such check, draft, order, or other instrument has not been paid. The word “credit,” as used herein, shall be construed to mean arrangement or understanding, express or implied, with the bank or other depository for the payment of such check, draft, order, or other instrument.", " or by imprisonment of not more than 60 days, or by both fine and imprisonment, in the discretion of the court. A corporation convicted of an offense under the provisions of ", ", and its president or such other officials as may be responsible for the conduct and management thereof shall be imprisoned not more than 60 days, in the discretion of the court.", " or imprisonment for not more than 180 days, or both."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/15/"},
{"chapter": "Chapter 14. False Pretenses; False Personation.", "title": ["§ 22–1402. Recordation of deed, contract, or conveyance with intent to extort money.", "§ 22–1403. False personation before court, officers, notaries.", "§ 22–1404. Falsely impersonating public officer or minister.", "§ 22–1405. False personation of inspector of departments of District.", "§ 22–1406. False personation of police officer.", "§ 22–1409. Use of official insignia; penalty for unauthorized use."], "text": [" or imprisoned not more than 180 days, or both.", " Whoever falsely personates another person before any court of record or judge thereof, or clerk of court, or any officer in the District authorized to administer oaths or take the acknowledgment of deeds or other instruments or to grant marriage licenses or accepts domestic partnership registrations, with intent to defraud, shall be imprisoned for not less than 1 year nor more than 5 years.", " rewrote the section, which had read as follows: “Whoever falsely personates another person before any court of record or judge thereof, or clerk of court, or any officer in the District authorized to administer oaths or take the acknowledgment of deeds or other instruments or to grant marriage licenses, with intent to defraud, shall be imprisoned for not less than 1 year nor more than 5 years.”", "Whoever falsely represents himself or herself to be a judge of the Superior Court of the District of Columbia, notary public, police officer, or other public officer, or a minister qualified to celebrate marriage, and attempts to perform the duty or exercise the authority pertaining to any such office or character, or having been duly appointed to any of such offices shall knowingly attempt to act as any such officers after his or her appointment or commission has expired or he or she has been dismissed from such office, shall suffer imprisonment in the penitentiary for not less than 1 year nor more than 3 years. In addition to any other penalty provided under this section, a person may be fined an amount not more than the amount set forth in ", ", or imprisonment in the Jail of the District not exceeding 6 months, or both, in the discretion of the court.", "It shall be a misdemeanor, punishable by imprisonment in the District jail or penitentiary not exceeding 180 days, or by a fine not more than the amount set forth in ", ", imprisoned for not more than one year, or both."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/14/"},
{"chapter": "Chapter 3. Arson.", "title": ["§ 22–301. Definition and penalty.", "§ 22–302. Burning one’s own property with intent to defraud or injure another.", "§ 22–303. Malicious burning, destruction, or injury of another’s property."], "text": ["Whoever shall maliciously burn or attempt to burn any dwelling, or house, barn, or stable adjoining thereto, or any store, barn, or outhouse, or any shop, office, stable, store, warehouse, or any other building, or any steamboat, vessel, canal boat, or other watercraft, or any railroad car, the property, in whole or in part, of another person, or any church, meetinghouse, schoolhouse, or any of the public buildings in the District, belonging to the United States or to the District of Columbia, shall suffer imprisonment for not less than 1 year nor more than 10 years. In addition to any other penalty provided under this section, a person may be fined an amount not more than the amount set forth in ", "Whoever maliciously burns or sets fire to any dwelling, shop, barn, stable, store, or warehouse or other building, or any steamboat, vessel, canal boat, or other watercraft, or any goods, wares, or merchandise, the same being his own property, in whole or in part, with intent to defraud or injure any other person, shall be imprisoned for not more than 15 years. In addition to any other penalty provided under this section, a person may be fined an amount not more than the amount set forth in ", " or shall be imprisoned for not more than 10 years, or both, and if the property has some value shall be fined not more than the amount set forth in ", " or imprisoned for not more than 180 days, or both."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/3/"}
]