[
{"chapter": "Title 22. Criminal Offenses and Penalties.", "title": [], "text": [], "address": "https://code.dccouncil.us/dc/council/code/titles/22/"},
{"chapter": "Chapter 13A. Entry into a Motor Vehicle, Unlawful.", "title": ["§ 22–1341. Unlawful entry of a motor vehicle."], "text": [" It is unlawful to enter or be inside of the motor vehicle of another person without the permission of the owner or person lawfully in charge of the motor vehicle. A person who violates this subsection shall, upon conviction, be fined not more than the amount set forth in ", ", imprisoned for not more than 90 days, or both.", " Subsection (a) of this section shall not apply to:", " For the purposes of this section, the term “enter the motor vehicle” means to insert any part of one’s body into any part of the motor vehicle, including the passenger compartment, the trunk or cargo area, or the engine compartment.", " A violation of ", " shall not constitute a violation of this section."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/13A/"},
{"chapter": "Chapter 8C. Protection of Police Animals.", "title": ["§ 22–861. Harassing, interfering with, injuring, or obstructing a police animal."], "text": [" For the purposes of this section, the term:", " Any person who intentionally and without justifiable and excusable cause, harasses, interferes with, injures, or obstructs a police animal when he or she has reason to believe the animal is a police animal shall be guilty of a misdemeanor and, upon conviction, shall be imprisoned not more than 180 days or fined not more than the amount set forth in ", ", or both."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/8C/"},
{"chapter": "Chapter 8B. Crimes Against Public Officials.", "title": ["§ 22–851. Protection of District public officials."], "text": [" For the purposes of this section, the term:", " A person who corruptly or, by threat or force, or by any threatening letter or communication, intimidates, impedes, interferes with, or retaliates against, or attempts to intimidate, impede, interfere with, or retaliate against any official or employee, while the official or employee is engaged in the performance of his or her duties or on account of the performance of those duties, shall be fined not more than the amount set forth in ", " or imprisoned not more than 5 years, or both.", " A person who stalks, threatens, assaults, kidnaps, or injures any official or employee or vandalizes, damages, destroys, or takes the property of an official or employee, while the official or employee is engaged in the performance of his or her duties or on account of the performance of those duties, shall be fined not more than the amount set forth in ", " or imprisoned not more than 3 years, or both, in addition to any other penalties authorized by law.", " A person who stalks, threatens, assaults, kidnaps, or injures a family member or vandalizes, damages, destroys, or takes the property of a family member on account of the performance of the official or employee’s duties, shall be fined not more than the amount set forth in ", " or imprisoned not more than 3 years, or both, in addition to any other penalties authorized by law."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/8B/"},
{"chapter": "Chapter 11. Cruelty to Children.", "title": ["§ 22–1101. Definition and penalty.", "§ 22–1102. Refusal or neglect of guardian to provide for child under 14 years of age.", "§ 22–1103. Wilful neglect or refusal to support wife or minor child; punishment; order of allowance; recognizance; trial under original charge [Repealed]", "§ 22–1104. Evidence of marriage; competency of witnesses; proof of wilful desertion [Repealed]", "§ 22–1105. Weekly payments by Superintendent of Workhouse for each day’s confinement [Repealed]", "§ 22–1106. Collections by Clerk of Court to be deposited with Collector of Taxes and covered into Treasury [Repealed]"], "text": [" A person commits the crime of cruelty to children in the first degree if that person intentionally, knowingly, or recklessly tortures, beats, or otherwise willfully maltreats a child under 18 years of age or engages in conduct which creates a grave risk of bodily injury to a child, and thereby causes bodily injury.", " A person commits the crime of cruelty to children in the second degree if that person intentionally, knowingly, or recklessly:", " Any person convicted of cruelty to children in the first degree shall be fined not more than $10,000 or be imprisoned not more than 15 years, or both."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/11/"},
{"chapter": "Chapter 12A. Detection Device Tampering.", "title": ["§ 22–1211. Tampering with a detection device."], "text": [" It is unlawful for a person who is required to wear a device while incarcerated or committed, while subject to a protection order, or while on pretrial release, presentence release, predisposition release, supervised release, probation, or parole to:", " Whoever violates this section shall be fined not more than the amount set forth in ", ", imprisoned for not more than 180 days, or both."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/12A/"},
{"chapter": "Chapter 10. Cruelty to Animals.", "title": ["§ 22–1001. Definitions and penalties.", "§ 22–1002. Other cruelties to animals.", "§ 22–1002.01. Reporting requirements.", "§ 22–1003. Rest, water and feeding for animals transported by railroad company.", "§ 22–1004. Arrests without warrant authorized; notice to owner.", "§ 22–1005. Issuance of search warrants.", "§ 22–1006. Prosecution of offenders; disposition of fines.", "§ 22–1006.01. Penalty for engaging in animal fighting.", "§ 22–1007. Impounded animals to be supplied with food and water.", "§ 22–1008. Relief of impounded animals.", "§ 22–1009. Keeping or using place for fighting or baiting of fowls or animals; arrest without warrant.", "§ 22–1010. Penalty for engaging in cockfighting or animal fighting. [Repealed]", "§ 22–1011. Neglect of sick or disabled animals.", "§ 22–1012. Abandonment of maimed or diseased animal; destruction of diseased animals; disposition of animal or vehicle on arrest of driver; scientific experiments.", "§ 22–1013. Definitions.", "§ 22–1014. Docking tails of horses. [Repealed]", "§ 22–1015. Penalty for engaging in animal fighting [Renumbered]"], "text": [" Whoever knowingly overdrives, overloads, drives when overloaded, overworks, tortures, torments, deprives of necessary sustenance, cruelly chains, cruelly beats or mutilates, any animal, or knowingly causes or procures any animal to be so overdriven, overloaded, driven when overloaded, overworked, tortured, tormented, deprived of necessary sustenance, cruelly chained, cruelly beaten, or mutilated, and whoever, having the charge or custody of any animal, either as owner or otherwise, knowingly inflicts unnecessary cruelty upon the same, or unnecessarily fails to provide the same with proper food, drink, air, light, space, veterinary care, shelter, or protection from the weather, shall for every such offense be punished by imprisonment in jail not exceeding 180 days, or by fine not exceeding $250, or by both.", " For the purposes of this section, “cruelly chains” means attaching an animal to a stationary object or a pulley by means of a chain, rope, tether, leash, cable, or similar restraint under circumstances that may endanger its health, safety, or well-being. Cruelly chains includes, but is not limited to, the use of a chain, rope, tether, leash, cable or similar restraint that:", " For the purposes of this section, “serious bodily injury” means bodily injury that involves a substantial risk of death, unconsciousness, extreme physical pain, protracted and obvious disfigurement, mutilation, or protracted loss or impairment of the function of a bodily member or organ. Serious bodily injury includes, but is not limited to, broken bones, burns, internal injuries, severe malnutrition, severe lacerations or abrasions, and injuries resulting from untreated medical conditions.", " Except where the animal is an undomesticated and dangerous animal such as rats, bats, and snakes, and there is a reasonable apprehension of an imminent attack by such animal on that person or another, whoever commits any of the acts or omissions set forth in subsection (a) of this section with the intent to commit serious bodily injury or death to an animal, or whoever, under circumstances manifesting extreme indifference to animal life, commits any of the acts or omissions set forth in subsection (a) of this section which results in serious bodily injury or death to the animal, shall be guilty of a felony and, upon conviction thereof, shall be punished by imprisonment not exceeding 5 years, or by a fine not exceeding $25,000, or both.", " Any law enforcement or child or protective services employee who knows of or has reasonable cause to suspect an animal has been the victim of cruelty, abandonment, or neglect, or observes an animal at the home of a person reasonably suspected of child, adult, or animal abuse, shall provide a report within 2 business days to the Mayor. If the health and welfare of the animal is in immediate danger, the report shall be made within 6 hours.", " When 2 or more law enforcement or child or protective services employees jointly suspect an animal has been the victim of cruelty, abandonment, or neglect, or jointly observe an animal at the home of a person reasonably suspected of child, adult, or animal abuse, a report may be made by one person by mutual agreement.", " No individual who in good faith reports a reasonable suspicion of abuse shall be liable in any civil or criminal action.", " Upon receipt of a report, any agency charged with the enforcement of animal cruelty laws shall make reasonable attempts to verify the welfare of the animal.", " For the purposes of this section, the terms “reasonable cause to suspect”, “suspect”, “reasonably suspected”, and “reasonable suspicion” mean a basis for reporting facts leading a person of ordinary care and prudence to believe and entertain a reasonable suspicion that criminal activity is occurring or has occurred.", " Any person found violating the laws in relation to cruelty to animals may be arrested and held without a warrant, in the manner provided by ", " and the person making an arrest, with or without a warrant, shall use reasonable diligence to give notice thereof to the owner of animals found in the charge or custody of the person arrested, and shall properly care and provide for such animals until the owner thereof shall take charge of the same; provided, the owner shall take charge of the same within 20 days from the date of said notice. The person making the arrest or the humane officer taking possession of an animal shall have a lien on said animals for the expense of such care and provisions.", " A humane officer of the Washington Humane Society may take possession of any animal to protect it from neglect or cruelty. The person taking possession of the animal or animals, shall use reasonable diligence to give notice thereof to the owner of animals found in the charge or custody of the person arrested, and shall properly care and provide for the animals until the owner shall take charge of the animals; provided that, the owner shall take charge of the animals within 20 days from the date of the notice.", " The Mayor shall establish by rulemaking a notice and hearing process for the owner of the animal to contest the seizure, detention, and terms of release and treatment of the animal, the allegation of cruelty, abandonment, or neglect, and the imposition of the lien and costs assessed for caring and providing for the animal.", " Any person who: (1) organizes, sponsors, conducts, stages, promotes, is employed at, collects an admission fee for, or bets or wagers any money or other valuable consideration on the outcome of an exhibition between two or more animals of fighting, baiting, or causing injury to each other; (2) any person who owns, trains, buys, sells, offers to buy or sell, steals, transports, or possesses any animal with the intent that it engage in any such exhibition; (3) any person who knowingly allows any animal used for such fighting or baiting to be kept, boarded, housed, or trained on, or transported in, any property owned or controlled by him; (4) any person who owns, manages, or operates any facility and knowingly allows that facility to be kept or used for the purpose of fighting or baiting any animal; (5) any person who knowingly or recklessly permits any act described in this subsection, to be done on any premises under his or her ownership or control, or who aids or abets that act; or (6) any person who is knowingly present as a spectator at any such exhibition, is guilty of a felony, punishable by a fine of not more than the amount set forth in ", ", imprisonment not to exceed 5 years, or both. The court may also impose any penalties listed in ", ".", " Repealed.", " For the purposes of this section, the term:", " A person being the owner or possessor or having charge or custody of a maimed, diseased, disabled, or infirm animal who abandons such animal, or leaves it to lie in the street or road, or public place, more than 3 hours after he or she receives notice that it is left disabled, is guilty of a misdemeanor punishable by a fine of not less than $10 and not more than the amount set forth in ", ", or by imprisonment in jail not more than 180 days, or both. Any agent or officer of the Washington Humane Society may lawfully destroy, or cause to be destroyed, any animal found abandoned and not properly cared for, appearing, in the judgment of 2 reputable citizens called by such officer to view the same in such officer’s presence, to be glandered, injured, or diseased past recovery for any useful purpose. When any person arrested is, at the time of such arrest, in charge of any animal, or of any vehicle drawn by any animal, or containing any animal, any agent of said society may take charge of such animal and such vehicle and its contents and deposit the same in a place of safe custody or deliver the same into the possession of the police authorities, who shall assume the custody thereof; and all necessary expenses incurred in taking charge of such property shall be a lien thereon.", " Nothing contained in §§ ", " to ", ", inclusive, and §§ ", " and ", " shall be construed to prohibit or interfere with any properly conducted scientific experiments or investigations, which experiments shall be performed only under the authority of the faculty of some regularly incorporated medical college, university, or scientific society."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/10/"},
{"chapter": "Chapter 8. Burglary.", "title": ["§ 22–801. Definition and penalty."], "text": [" Whoever shall, either in the nighttime or in the daytime, break and enter, or enter without breaking, any dwelling, or room used as a sleeping apartment in any building, with intent to break and carry away any part thereof, or any fixture or other thing attached to or connected thereto or to commit any criminal offense, shall, if any person is in any part of such dwelling or sleeping apartment at the time of such breaking and entering, or entering without breaking, be guilty of burglary in the first degree. Burglary in the first degree shall be punished by imprisonment for not less than 5 years nor more than 30 years.", " Except as provided in subsection (a) of this section, whoever shall, either in the night or in the daytime, break and enter, or enter without breaking, any dwelling, bank, store, warehouse, shop, stable, or other building or any apartment or room, whether at the time occupied or not, or any steamboat, canalboat, vessel, or other watercraft, or railroad car, or any yard where any lumber, coal, or other goods or chattels are deposited and kept for the purpose of trade, with intent to break and carry away any part thereof or any fixture or other thing attached to or connected with the same, or to commit any criminal offense, shall be guilty of burglary in the second degree. Burglary in the second degree shall be punished by imprisonment for not less than 2 years nor more than 15 years.", " In addition to any other penalty provided under this section, a person may be fined an amount not more than the amount set forth in ", "."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/8/"},
{"chapter": "Chapter 13. Disturbances of the Public Peace.", "title": ["§ 22–1301. Affrays.", "§ 22–1302. Duelling challenges. [Repealed]", "§ 22–1303. Assault for refusal to accept challenge. [Repealed]", "§ 22–1304. Leaving District to give or receive challenge. [Repealed]", "§ 22–1305. Prize fights and animal fights prohibited. [Repealed]", "§ 22–1306. “Pugilistic encounter” defined. [Repealed]", "§ 22–1307. Crowding, obstructing, or incommoding.", "§ 22–1308. Playing games in streets.", "§ 22–1309. Throwing stones or other missiles.", "§ 22–1310. Urging dogs to fight or create disorder.", "§ 22–1311. Allowing dogs to go at large.", "§ 22–1312. Lewd, indecent, or obscene acts; sexual proposal to a minor.", "§ 22–1313. Kindling bonfires.", "§ 22–1314. Disturbing religious congregation. [Repealed]", "§ 22–1314.01. Definitions.", "§ 22–1314.02. Prohibited acts.", "§ 22–1315. Interference with foreign diplomatic and consular offices, officers, and property — Prohibited. [Repealed]", "§ 22–1316. Interference with foreign diplomatic and consular offices, officers, and property — Penalties; exception. [Repealed]", "§ 22–1317. Flying fire balloons or parachutes.", "§ 22–1318. Driving or riding on footways in public grounds.", "§ 22–1319. False alarms and false reports; hoax weapons.", "§ 22–1320. Sale of tobacco to minors under 18 years of age.", "§ 22–1321. Disorderly conduct.", "§ 22–1322. Rioting or inciting to riot.", "§ 22–1323. Obstructing bridges connecting D.C. and Virginia."], "text": [" It is unlawful for a person, alone or in concert with others:", " It is unlawful for a person, alone or in concert with others, to engage in a demonstration in an area where it is otherwise unlawful to demonstrate and to continue or resume engaging in a demonstration after being instructed by a law enforcement officer to cease engaging in a demonstration.", " A person who violates any provision of this section shall be guilty of a misdemeanor and, upon conviction, shall be fined not more than the amount set forth in ", ", imprisoned for not more than 90 days, or both.", " If any owner or possessor of a fierce or dangerous dog shall permit the same to go at large, knowing said dog to be fierce or dangerous, to the danger or annoyance of the inhabitants, he shall upon conviction thereof, be punished by a fine not exceeding $5,000; and if such animal shall attack or bite any person, the owner or possessor thereof shall, on conviction, be punished by a fine not exceeding $10,000, and in addition to such punishment the court shall adjudge and order that such animal be forthwith delivered to the poundmaster, and said poundmaster is hereby authorized and directed to kill such animal so delivered to him.", " If any owner or possessor of a female dog shall permit her to go at large in the District of Columbia while in heat, he shall, upon conviction thereof, be punished by a fine not exceeding $20.", " “Health professional” means a person licensed to practice a health occupation in the District pursuant to ", ".", " “Medical facility” includes a hospital, clinic, physician’s office, or other facility that provides health or surgical services.", " “Person” shall not include:", " It shall be unlawful for a person, except as otherwise authorized by District or federal law, alone or in concert with others, to willfully or recklessly interfere with access to or from a medical facility or to willfully or recklessly disrupt the normal functioning of such facility by:", " A person shall not act alone or in concert with others with the intent to prevent a health professional or his or her family from entering or leaving the health professional’s home.", " Subsections (a) and (b) of this section shall not be construed to prohibit any otherwise lawful picketing or assembly.", " Any person who violates subsections (a) or (b) of this section, upon conviction, shall be fined not more than the amount set forth in ", ", imprisoned for not more than 180 days, or both.", " It shall be unlawful for any person or persons to willfully or knowingly give a false alarm of fire within the District of Columbia, and any person or persons violating the provisions of this subsection shall, upon conviction, be deemed guilty of a misdemeanor and be punished by a fine not more than the amount set forth in ", " or by imprisonment for not more than 6 months, or by both such fine and imprisonment. Prosecutions for violation of the provisions of this subsection shall be on information filed in the Superior Court of the District of Columbia by the Office of the Attorney General for the District of Columbia.", " It shall be unlawful for any person or persons to willfully or knowingly use, or allow the use of, the 911 call system to make a false or fictitious report or complaint which initiates a response by District of Columbia emergency personnel or officials when, at the time of the call or transmission, the person knows the report or complaint is false. Any person or persons violating the provisions of this subsection shall, upon conviction, be deemed guilty of a misdemeanor and be punished by a fine not more than the amount set forth in ", " or by imprisonment for not more than 6 months. Prosecutions for violation of the provisions of this subsection shall be on information filed in the Superior Court of the District of Columbia by the Office of the Attorney General for the District of Columbia.", " It shall be unlawful for any person to willfully or knowingly make, or cause to be made, a false or fictitious report to any individual which initiates a response by District of Columbia emergency personnel or officials, wherein such report involves, is alleged to involve, or may reasonably be deemed to involve, the delivery, presence, or use of a weapon of mass destruction, as defined by ", ", within the District of Columbia.", " It shall be unlawful for anyone to willfully or knowingly, with the intent of intimidating or frightening people, causing panic or civil unrest, extorting profit, or causing economic damage, make, or cause to be made, a false or fictitious report to any individual, which initiates a response by District of Columbia emergency personnel or officials, wherein such report involves, is alleged to involve, or may reasonably be deemed to involve, the delivery, presence, or use of a weapon of mass destruction, as defined by ", ", within the District of Columbia.", " It shall be unlawful for any person to willfully or knowingly, during a state of emergency, as declared by the Mayor pursuant to ", ", with the intent of intimidating or frightening people, causing panic or civil unrest, extorting profit, or causing economic damage, make, or cause to be made, a false or fictitious report to any individual, which initiates a response by District of Columbia emergency personnel or officials, wherein such report involves, is alleged to involve, or may reasonably be deemed to involve, the delivery, presence, or use of a weapon of mass destruction, as defined by ", ", within the District of Columbia.", " For the purposes of subsections (b), (c), and (d) of this section, the manner in which the false or fictitious report is communicated may include, but is not limited to:", " There is jurisdiction to prosecute any person who participates in the commission of any offense described in this section if any act in furtherance of the offense occurs in the District of Columbia or where the effect of any act in furtherance of the offense occurs in the District of Columbia.", " In any place open to the general public, and in the communal areas of multi-unit housing, it is unlawful for a person to:", " It is unlawful for a person to engage in loud, threatening, or abusive language, or disruptive conduct, with the intent and effect of impeding or disrupting the orderly conduct of a lawful public gathering, or of a congregation of people engaged in any religious service or in worship, a funeral, or similar proceeding.", " It is unlawful for a person to engage in loud, threatening, or abusive language, or disruptive conduct with the intent and effect of impeding or disrupting the lawful use of a public conveyance by one or more other persons.", " It is unlawful for a person to engage in loud, threatening, or abusive language, or disruptive conduct in a public building with the intent and effect of impeding or disrupting the orderly conduct of business in that public building.", " It is unlawful for a person to make an unreasonably loud noise between 10:00 p.m. and 7:00 a.m. that is likely to annoy or disturb one or more other persons in their residences.", " It is unlawful for a person to urinate or defecate in public, other than in a urinal or toilet.", " It is unlawful for a person to stealthily look into a window or other opening of a dwelling, as defined in ", ", under circumstances in which an occupant would have a reasonable expectation of privacy. It is not necessary that the dwelling be occupied at the time the person looks into the window or other opening.", " It is unlawful, under circumstances whereby a breach of the peace may be occasioned, to interfere with any person in any public place by jostling against the person, unnecessarily crowding the person, or placing a hand in the proximity of the person’s handbag, pocketbook, or wallet.", " A person who violates any provision of this section shall be guilty of a misdemeanor and, upon conviction, shall be fined not more than the amount set forth in ", ", imprisoned not more than 90 days, or both.", " A riot in the District of Columbia is a public disturbance involving an assemblage of 5 or more persons which by tumultuous and violent conduct or the threat thereof creates grave danger of damage or injury to property or persons.", " Whoever willfully engages in a riot in the District of Columbia shall be punished by imprisonment for not more than 180 days or a fine of not more than the amount set forth in ", ", or both.", " Whoever willfully incites or urges other persons to engage in a riot shall be punished by imprisonment for not more than 180 days or a fine of not more than the amount set forth in ", ", or both.", " If in the course and as a result of a riot a person suffers serious bodily harm or there is property damage in excess of $5,000, every person who willfully incited or urged others to engage in the riot shall be punished by imprisonment for not more than 10 years or a fine of not more than the amount set forth in ", ", or both.", " Shall be fined not less than $1,000 and not more than $5,000, and in addition may be imprisoned not more than 30 days; or", " If applicable, shall be subject to prosecution by the District of Columbia under the provisions of District law and regulation amended by the Safe Streets Anti-Prostitution Amendment Act of 1996.", " The fine set forth in this section shall not be limited by ", "."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/13/"},
{"chapter": "Chapter 9. Commercial Counterfeiting.", "title": ["§ 22–901. Definitions.", "§ 22–902. Trademark counterfeiting."], "text": [" “Counterfeit mark” means:", " “Intellectual property” means any trademark, service mark, trade name, label, term, picture, seal, word, or advertisement or any combination of these adopted or used by a person to identify such person’s goods or services and which is lawfully filed for record in the Office of the Secretary of State of any state or which the exclusive right to reproduce is guaranteed under the laws of the United States or the District of Columbia.", " “Retail value” means the counterfeiter’s regular selling price for the item or service bearing or identified by the counterfeit mark. In the case of items bearing a counterfeit mark which are components of a finished product, the retail value shall be the counterfeiter’s regular selling price of the finished product on or in which the component would be utilized.", " A person commits the offense of counterfeiting if such person willfully manufactures, advertises, distributes, offers for sale, sells, or possesses with intent to sell or distribute any items, or services bearing or identified by a counterfeit mark. There shall be a rebuttable presumption that a person having possession, custody, or control of more than 15 items bearing a counterfeit mark possesses said items with the intent to sell or distribute.", " A person convicted of counterfeiting shall be subject to the following penalties:", " For the purposes of this chapter, the quantity or retail value of items or services shall include the aggregate quantity or retail value of all items bearing, or services identified by, every counterfeit mark the defendant manufactures, advertises, distributes, offers for sale, sells, or possesses.", " The fines provided in subsection (b) of this section shall be no less than twice the retail value of the items bearing, or services identified by, a counterfeit mark, unless extenuating circumstances are shown by the defendant.", " Any items bearing a counterfeit mark and all personal property, including, but not limited to, any items, objects, tools, machines, equipment, instrumentalities, or vehicles of any kind, employed or used in connection with a violation of this chapter shall be seized by any law enforcement officer, including any designated civilian employee of the Metropolitan Police Department, in accordance with the procedures established by ", ".", " Any state or federal certificate of registration of any intellectual property shall be prima facie evidence of the facts stated therein.", " The remedies provided for herein shall be cumulative to the other civil and criminal remedies provided by law."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/9/"},
{"chapter": "Chapter 8A. Crimes Committed Against Minors.", "title": ["§ 22–811. Contributing to the delinquency of a minor."], "text": [" It is unlawful for an adult, being 4 or more years older than a minor, to invite, solicit, recruit, assist, support, cause, encourage, enable, induce, advise, incite, facilitate, permit, or allow the minor to:", " Except as provided in paragraphs (2), (4) and (5) of this subsection, a person convicted of violating subsection (a)(1)-(6) of this section shall be fined not more than the amount set forth in ", ", or imprisoned for not more than 6 months, or both.", " The penalties under this section are in addition to any other penalties permitted by law.", " It is not a defense to a prosecution under this section that the minor does not engage in, is not charged with, is not adjudicated delinquent for, or is not convicted as an adult, for any conduct set forth in subsection (a)(1)-(7) of this section.", " The Attorney General for the District of Columbia, or his or her assistants, shall prosecute a violation of subsection (a) of this section for which the penalty is set forth in subsection (c)(1) of this section.", " For the purposes of this section, the term:"], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/8A/"},
{"chapter": "Chapter 9B. Criminal Street Gangs.", "title": ["§ 22–951. Criminal street gangs."], "text": [" It is unlawful for a person to solicit, invite, recruit, encourage, or otherwise cause, or attempt to cause, another individual to become a member of, remain in, or actively participate in what the person knows to be a criminal street gang.", " It is unlawful for any person who is a member of or actively participates in a criminal street gang to knowingly and willfully participate in any felony or violent misdemeanor committed for the benefit of, at the direction of, or in association with any other member or participant of that criminal street gang.", " It is unlawful for a person to use or threaten to use force, coercion, or intimidation against any person or property, in order to:", " The penalties under this section are in addition to any other penalties permitted by law.", " For the purposes of this section, the term:"], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/9B/"},
{"chapter": "Chapter 9A. Criminal Abuse and Neglect of Vulnerable Adults.", "title": ["§ 22–931. Short title.", "§ 22–932. Definitions.", "§ 22–933. Criminal abuse of a vulnerable adult or elderly person.", "§ 22–933.01. Financial exploitation of a vulnerabl adult or elderly person.", "§ 22–934. Criminal negligence.", "§ 22–935. Exception.", "§ 22–936. Penalties.", "§ 22–936.01. Criminal penalties for financial exploitation of a vulnerable adult or elderly person.", "§ 22–937. Civil penalties for financial exploitation of a vulnerable adult or elderly person.", "§ 22–938. Injunctive relief and protections."], "text": [" \"Attorney General\" means the Attorney General for the District of Columbia.", " \"Court\" means the Superior Court of the District of Columbia.", " \"Elderly person\" means a person who is 65 years of age or older.", " \"United States Attorney\" means the United States Attorney for the District of Columbia.", " \"Vulnerable adult\" means a person who is 18 years of age or older and has one or more physical or mental limitations that substantially impair the person's ability to independently provide for his or her daily needs or safeguard his or her person, property, or legal interests.", " Inflicts or threatens to inflict physical pain or injury by hitting, slapping, kicking, pinching, biting, pulling hair or other corporal means;", " Uses repeated or malicious oral or written statements that would be considered by a reasonable person to be harassing or threatening; or", " Imposes unreasonable confinement or involuntary seclusion, including but not limited to, the forced separation from other persons against his or her will or the directions of any legal representative.", " A person is guilty of financial exploitation of a vulnerable adult or elderly person if the person intentionally and knowingly:", " It is an affirmative defense that the accused knew or reasonably believed the victim was not a vulnerable adult or elderly person at the time of the offense, or could not have known or determined that the victim was a vulnerable adult or elderly person because of the manner in which the offense was committed. This defense shall be established by a preponderance of the evidence.", " For the purposes of this section, the term \"undue influence\" means mental, emotional, or physical coercion that overcomes the free will or judgment of a vulnerable adult or elderly person and causes the vulnerable adult or elderly person to act in a manner that is inconsistent with his or her financial, emotional, mental, or physical well-being.", " A person who commits the offense of criminal abuse or criminal neglect of a vulnerable adult or elderly person shall be subject to a fine of not more than the amount set forth in ", ", imprisoned for not more than 180 days, or both.", " A person who commits the offense of criminal abuse or criminal neglect of a vulnerable adult or elderly person which causes serious bodily injury or severe mental distress shall be subject to a fine of not more than the amount set forth in ", ", imprisoned up to 10 years, or both.", " A person who commits the offense of criminal abuse or criminal neglect of a vulnerable adult or elderly person which causes permanent bodily harm or death shall be subject to a fine of not more than the amount set forth in ", ", imprisoned up to 20 years, or both.", " Any person who commits the offense of financial exploitation of a vulnerable adult or elderly person in violation of ", " shall be subject to the following criminal penalties:", " A person convicted of a violation of ", " who has 2 or more prior convictions for violating ", ", not committed on the same occasion, shall be fined not more than the amount set forth in ", ", or imprisoned for not more than 15 years, or both.", " In addition to other penalties provided by law, a person who violates ", " shall be subject to the following civil penalties:", " Restitution under ", " shall be paid before the payment of any fines or civil penalties under this section.", " Whenever the Attorney General or the United States Attorney has reason to believe that a person has engaged in financial exploitation of a vulnerable adult or elderly person in violation of ", ", the Attorney General or the United States Attorney may petition the court, which may be by ex-parte motion and without notice to the person, for one or more of the following:", " The court may grant an ex-parte motion authorized by subsection (a) of this section without notice to the person against whom the injunction or order is sought if the court finds that facts offered in support of the motion establish that:", " An order temporarily freezing assets without notice to the person pursuant to subsections (a)(3) and (b) of this section shall expire on a date set by the court, not later than 14 days after the court issues the order unless, before that time, the court extends the order for good cause shown.", " The court may issue an order temporarily freezing the assets of the vulnerable adult or elderly person to prevent dissipation of assets; provided, that the court also appoints a receiver or conservator for those assets. The order shall allow for the use of assets to continue care for the vulnerable adult or elderly person, and can only be issued upon a showing that a temporary injunction or temporary restraining order authorized by this section would be insufficient to safeguard the assets, or with the consent of the vulnerable adult or elderly person or his or her legal representative."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/9A/"},
{"chapter": "Chapter 6. Breaking into Devices Designed to Receive Currency.", "title": ["§ 22–601. Breaking and entering vending machines and similar devices."], "text": [], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/6/"},
{"chapter": "Chapter 7. Bribery; Obstructing Justice; Corrupt Influence.", "titles": ["§ 22–701. Definition and penalty [Repealed]", "§ 22–702. Offering or receiving money, property, or valuable consideration to procure office or promotion from Council [Repealed]", "§ 22–703. Obstructing justice [Repealed]", "§ 22–704. Corrupt influence; officials.", "§ 22–711. Definitions.", "§ 22–712. Prohibited acts; penalty.", "§ 22–713. Bribery of witness; penalty.", "§ 22–721. Definitions.", "§ 22–722. Prohibited acts; penalty.", "§ 22–723. Tampering with physical evidence; penalty."], "text": [" Whosoever corruptly, directly or indirectly, gives any money, or other bribe, present, reward, promise, contract, obligation, or security for the payment of any money, present, reward, or thing of value to any ministerial, administrative, executive, or judicial officer of the District of Columbia, or any employee, or other person acting in any capacity for the District of Columbia, or any agency thereof, either before or after the officer, employee, or other person acting in any capacity for the District of Columbia is qualified, with intent to influence such official’s action on any matter which is then pending, or may by law come or be brought before such official in such official’s official capacity, or to cause such official to execute any of the powers in such official vested, or to perform any duties of such official required, with partiality or favor, or otherwise than is required by law, or in consideration that such official being authorized in the line of such official’s duty to contract for any advertising or for the furnishing of any labor or material, shall directly or indirectly arrange to receive or shall receive, or shall withhold from the parties so contracted with, any portion of the contract price, whether that price be fixed by law or by agreement, or in consideration that such official has nominated or appointed any person to any office or exercised any power in such official vested, or performed any duty of such official required, with partiality or favor, or otherwise contrary to law; and whosoever, being such an official, shall receive any such money, bribe, present, or reward, promise, contract, obligation, or security, with intent or for the purpose or consideration aforesaid shall be deemed guilty of bribery and upon conviction thereof shall be punished by imprisonment for a term not less than 6 months nor more than 5 years. In addition to any other penalty provided under this section, a person may be fined an amount not more than the amount set forth in ", ".", " Whosoever corrupts or attempts, directly or indirectly, to corrupt any special master, auditor, juror, arbitrator, umpire, or referee, by giving, offering, or promising any gift or gratuity whatever, with intent to bias the opinion, or influence the decision of such official, in relation to any matter pending in the court, or before an inquest, or for the decision of which such arbitrator, umpire, or referee has been chosen or appointed, and every official who receives, or offers or agrees to receive, a bribe in any of the cases above mentioned shall be guilty of bribery and upon conviction thereof shall be punished as hereinbefore provided.", " “Court of the District of Columbia” means the Superior Court of the District of Columbia or the District of Columbia Court of Appeals.", " “Juror” means any grand, petit, or other juror, or any person selected or summoned as a prospective juror of the District of Columbia.", " “Official action” means any decision, opinion, recommendation, judgment, vote, or other conduct that involves an exercise of discretion on the part of the public servant.", " “Official duty” means any required conduct that does not involve an exercise of discretion on the part of the public servant.", " “Official proceeding” means any trial, hearing, investigation, or other proceeding in a court of the District of Columbia or conducted by the Council of the District of Columbia or an agency or department of the District of Columbia government, or a grand jury proceeding.", " “Public servant” means any officer, employee, or other person authorized to act for or on behalf of the District of Columbia government. The term “public servant” includes any person who has been elected, nominated, or appointed to be a public servant or a juror. The term “public servant” does not include an independent contractor.", " A person commits the offense of bribery if that person:", " Nothing in this section shall be construed as prohibiting concurrence in official action in the course of legitimate compromise between public servants.", " Any person convicted of bribery shall be fined not more than the amount set forth in ", " or twice the monetary equivalent of the thing of value, whichever is greater, or imprisoned for not more than 10 years, or both.", " A person commits the offense of bribery of a witness if that person:", " Nothing in subsection (a) of this section shall be construed to prohibit the payment or receipt of witness fees provided by law, or the payment by the party upon whose behalf a witness is called and receipt by a witness of a reasonable cost of travel and subsistence incurred and the reasonable value of time lost in attendance at any such proceeding, or, in case of expert witnesses, a reasonable fee for time spent in the preparation of a technical or professional opinion and appearing and testifying.", " Any person convicted of bribery of a witness shall be fined not more than the amount set forth in ", " or imprisoned for not more than 5 years, or both.", " “Court of the District of Columbia” means the Superior Court of the District of Columbia or the District of Columbia Court of Appeals.", " “Criminal investigator” means an individual authorized by the Mayor or the Mayor’s designated agent to conduct or engage in a criminal investigation, or a prosecuting attorney conducting or engaged in a criminal investigation.", " “Criminal investigation” means an investigation of a violation of any criminal statute in effect in the District of Columbia.", " “Official proceeding” means any trial, hearing, investigation, or other proceeding in a court of the District of Columbia or conducted by the Council of the District of Columbia or an agency or department of the District of Columbia government, or a grand jury proceeding.", " A person commits the offense of obstruction of justice if that person:", " Any person convicted of obstruction of justice shall be sentenced to a maximum period of incarceration of not less than 3 years and not more than 30 years, or shall be fined not more than the amount set forth in ", ", or both. For purposes of imprisonment following revocation of release authorized by ", ", obstruction of justice is a Class A felony.", " A person commits the offense of tampering with physical evidence if, knowing or having reason to believe an official proceeding has begun or knowing that an official proceeding is likely to be instituted, that person alters, destroys, mutilates, conceals, or removes a record, document, or other object, with intent to impair its integrity or its availability for use in the official proceeding.", " Any person convicted of tampering with physical evidence shall be fined not more than the amount set forth in ", ", imprisoned for not more than 3 years, or both."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/7/"},
{"chapter": "Chapter 5. Bigamy.", "title": ["§ 22–501. Bigamy."], "text": [" Whoever, having a spouse or domestic partner living, marries or enters a domestic partnership with another shall be deemed guilty of bigamy, and on conviction thereof shall suffer imprisonment for not less than 2 nor more than 7 years; provided, that this section shall not apply to any person whose:", " In addition to any other penalty provided under this section, a person may be fined an amount not more than the amount set forth in ", ".", " For the purposes of this section, the term:"], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/5/"},
{"chapter": "Chapter 4. Assault; Mayhem; Threats.", "title": ["§ 22–401. Assault with intent to kill, rob, or poison, or to commit first degree sexual abuse, second degree sexual abuse or child sexual abuse.", "§ 22–402. Assault with intent to commit mayhem or with dangerous weapon.", "§ 22–403. Assault with intent to commit any other offense.", "§ 22–404. Assault or threatened assault in a menacing manner; stalking.", "§ 22–404.01. Aggravated assault.", "§ 22–404.02. Assault on a public vehicle inspection officer.", "§ 22–404.03. Aggravated assault on a public vehicle inspection officer.", "§ 22–405. Assault on member of police force, campus or university special police, or fire department.", "§ 22–405.01. Resisting arrest.", "§ 22–406. Mayhem or maliciously disfiguring.", "§ 22–407. Threats to do bodily harm.", "§ 22–408. Penalty for assaulting, beating, or fighting on account of money won by gaming. [Repealed]"], "text": [" Whoever unlawfully assaults, or threatens another in a menacing manner, shall be fined not more than the amount set forth in ", " or be imprisoned not more than 180 days, or both.", " Repealed.", " Repealed.", " Repealed.", " Repealed.", " A person commits the offense of aggravated assault if:", " Any person convicted of aggravated assault shall be fined not more than the amount set forth in ", " or be imprisoned for not more than 10 years, or both.", " Any person convicted of attempted aggravated assault shall be fined not more than the amount set forth in ", " or be imprisoned for not more than 5 years, or both.", " A person commits the offense of assault on a public vehicle inspection officer if that person assaults, impedes, intimidates, or interferes with a public vehicle inspection officer while that officer is engaged in or on account of the performance of his or her official duties.", " A person who violates this subsection shall be guilty of a misdemeanor and, upon conviction, shall:", " It is neither justifiable nor excusable for a person to use force to resist the civil enforcement authority exercised by an individual believed to be a public vehicle inspection officer, whether or not such enforcement action is lawful.", " For the purposes of this section, the term:", " A person commits the offense of aggravated assault on a public vehicle inspection officer if that person assaults, impedes, intimidates, or interferes with a public vehicle inspection officer while that officer is engaged in or on account of the performance of his or her official duties, and:", " A person who violates this section shall be guilty of a felony and, upon conviction, shall:", " It is neither justifiable nor excusable for a person to use force to resist the civil enforcement authority exercised by an individual believed to be a public vehicle inspection officer, whether or not such enforcement action is lawful.", " For the purposes of this section, the term:", " For the purposes of this section, the term “law enforcement officer” means any officer or member of any police force operating and authorized to act in the District of Columbia, including any reserve officer or designated civilian employee of the Metropolitan Police Department, any licensed special police officer, any officer or member of any fire department operating in the District of Columbia, any officer or employee of any penal or correctional institution of the District of Columbia, any officer or employee of the government of the District of Columbia charged with the supervision of juveniles being confined pursuant to law in any facility of the District of Columbia regardless of whether such institution or facility is located within the District, any investigator or code inspector employed by the government of the District of Columbia, or any officer or employee of the Department of Youth Rehabilitation Services, Court Services and Offender Supervision Agency, the Social Services Division of the Superior Court, or Pretrial Services Agency charged with intake, assessment, or community supervision.", " Whoever without justifiable and excusable cause assaults a law enforcement officer on account of, or while that law enforcement officer is engaged in the performance of his or her official duties shall be guilty of a misdemeanor and, upon conviction, shall be  imprisoned not more than 6 months or fined not more than the amount set forth in ", ", or both.", " A person who violates subsection (b) of this section and causes significant bodily injury to the law enforcement officer, or commits a violent act that creates a grave risk of causing significant bodily injury to the officer, shall be guilty of a felony and, upon conviction, shall be imprisoned not more than 10 years or fined not more than the amount set forth in ", ", or both.", " It is neither justifiable nor excusable cause for a person to use force to resist an arrest when such an arrest is made by an individual he or she has reason to believe is a law enforcement officer, whether or not such arrest is lawful.", " For the purposes of this section, the term \"law enforcement officer\" shall have the same meaning as provided in ", ".", " Whoever without justifiable and excusable cause intentionally resists an arrest by an individual who he or she has reason to believe is a law enforcement officer or prevents that individual from making or attempting to make an arrest of or detain another person shall be guilty of a misdemeanor and, upon conviction, shall be imprisoned not more than 6 months or fined not more than the amount set forth in ", ", or both.", " It is neither justifiable nor excusable cause for a person to use force to resist an arrest when such an arrest is made by an individual he or she has reason to believe is a law enforcement officer, whether or not such arrest is lawful."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/4/"},
{"chapter": "Chapter 33. Trespass; Injuries to Property.", "title": ["§ 22–3301. Forcible entry and detainer.", "§ 22–3302. Unlawful entry on property.", "§ 22–3303. Grave robbery; buying or selling dead bodies.", "§ 22–3304. Depredation of fixtures in houses. [Repealed]", "§ 22–3305. Placing explosives with intent to destroy or injure property.", "§ 22–3306. Defacing books, manuscripts, publications, or works of art.", "§ 22–3307. Destroying or defacing public records.", "§ 22–3308. Cutting down or destroying things growing on or attached to the land of another. [Repealed]", "§ 22–3309. Destroying boundary markers.", "§ 22–3310. Destroying vines, bushes, shrubs, trees or protections thereof; penalty.", "§ 22–3311. Disorderly conduct in public buildings or grounds; injury to or destruction of United States property.", "§ 22–3312. Destroying or defacing buildings, statues, or monuments. [Repealed]", "§ 22–3312.01. Defacing public or private property.", "§ 22–3312.02. Defacing or burning cross or religious symbol; display of certain emblems.", "§ 22–3312.03. Wearing hoods or masks.", "§ 22–3312.03a. Abatement of graffiti. [Repealed]", "§ 22–3312.03b. Collection against owner. [Repealed]", "§ 22–3312.04. Penalties.", "§ 22–3312.05. Definitions.", "§ 22–3313. Destroying or defacing building material for streets.", "§ 22–3314. Destroying cemetery railing or tomb.", "§ 22–3315. Offenses against property of electric lighting, heating, or power companies [Repealed]", "§ 22–3316. Tapping gas pipes [Repealed]", "§ 22–3317. Tapping or injuring water pipes; tampering with water meters [Repealed]", "§ 22–3318. Malicious pollution of water.", "§ 22–3319. Placing obstructions on or displacement of railway tracks.", "§ 22–3320. Obstructing public road; removing milestones.", "§ 22–3321. Obstructing public highway.", "§ 22–3322. Fines under § 22-3321 to be collected in name of United States."], "text": [" Any person who, without lawful authority, shall enter, or attempt to enter, any private dwelling, building, or other property, or part of such dwelling, building, or other property, against the will of the lawful occupant or of the person lawfully in charge thereof, or being therein or thereon, without lawful authority to remain therein or thereon shall refuse to quit the same on the demand of the lawful occupant, or of the person lawfully in charge thereof, shall be deemed guilty of a misdemeanor, and on conviction thereof shall be punished by a fine of not more than the amount set forth in ", ", imprisonment for not more than 180 days, or both. The presence of a person in any private dwelling, building, or other property that is otherwise vacant and boarded-up or otherwise secured in a manner that conveys that it is vacant and not to be entered, or displays a no trespassing sign, shall be prima facie evidence that any person found in such property has entered against the will of the person in legal possession of the property.", " Any person who, without lawful authority, shall enter, or attempt to enter, any public building, or other property, or part of such building, or other property, against the will of the lawful occupant or of the person lawfully in charge thereof or his or her agent, or being therein or thereon, without lawful authority to remain therein or thereon shall refuse to quit the same on the demand of the lawful occupant, or of the person lawfully in charge thereof or his or her agent, shall be deemed guilty of a misdemeanor, and on conviction thereof shall be punished by a fine of not more than the amount set forth in ", ", imprisonment for not more than 6 months, or both.", " In the case of any tree 55 inches or greater in circumference when measured at a height of four and one half feet, a fine of not more than the amount set forth in ", " or imprisonment for not more than 90 days, or both; or", " For vines, bushes, shrubs, and smaller trees, a fine of not more than the amount set forth in ", " or imprisonment for not more than 30 days, or both.", " Any property, public or private, building, statue, monument, office, public passenger vehicle, mass transit equipment or facility, dwelling or structure of any kind including those in the course of erection; or", " The doors, windows, steps, railing, fencing, balconies, balustrades, stairs, porches, halls, walls, sides of any enclosure thereof, or any movable property.", " It shall be unlawful for any person to burn, desecrate, mar, deface, or damage a religious or secular symbol on any private premises or property in the District of Columbia primarily used for religious, educational, residential, memorial, charitable, or cemetery purposes, or for assembly by persons of a particular race, color, creed, religion, or any other category listed in ", ", or on any public property in the District of Columbia; or to place or to display in any of these locations a sign, mark, symbol, emblem, or other physical impression including, but not limited to, a Nazi swastika, a noose, or any manner of exhibit which includes a burning cross, real or simulated, where it is probable that a reasonable person would perceive that the intent is:", " Repealed.", " Nothing in this section shall be deemed to amend or repeal any provision of the District of Columbia Fire Prevention Code (7 DCRR).", " No person or persons over 16 years of age, while wearing any mask, hood, or device whereby any portion of the face is hidden, concealed, or covered as to conceal the identity of the wearer, shall:", " The provisions of subsection (a) of this section apply only if the person was wearing the hood, mask, or other device:", " Any person who violates any provision of ", " shall be fined not less than $250 and not more than the amount set forth in ", ", or imprisoned for a period not to exceed 180 days, or both. Civil fines, penalties, and fees may be imposed as alternative sanctions for any infraction of the provisions of ", ", pursuant to ", ".", " Any person who violates any provision of ", " or ", " shall be guilty of a misdemeanor punishable by a fine not more than the amount set forth in ", ", or imprisonment not to exceed 180 days, or both.", " In addition to the penalties provided in subsection (a) of this section, a person convicted of violating any provision of ", " may be required to perform community service as provided in ", ".", " Any person who willfully places graffiti on property without the consent of the owner shall be subject to the sanctions in subsection (a) of this section.", " Any person who willfully possesses graffiti material with the intent to place graffiti on property without the consent of the owner shall be fined not less than $100 or more than $1,000.", " In addition to any fine or sentence imposed under this section, the court shall order the person convicted to make restitution to the owner of the property, or to the party responsible for the property upon which the graffiti has been placed, for the damage or loss caused, directly or indirectly, by the graffiti, in a reasonable amount and manner as determined by the court.", " The District of Columbia courts shall find parents or guardians civilly liable for all fines imposed or payments for abatement required if the minor cannot pay within a reasonable period of time established by the court.", " “Abate” means to effectively remove.", " Repealed.", " Repealed.", " “Graffiti” means an inscription, writing, drawing, marking, or design that is painted, sprayed, etched, scratched, or otherwise placed on structures, buildings, dwellings, statues, monuments, fences, vehicles, or other similar materials that are on public or private property without the  consent of the owner, manager, or agent in charge of the property, and the graffiti is visible from a public right-of-way.", " “Graffiti material” means any aerosol can, bottle, spray device or other mechanism designed to dispense paint or a similar substance under pressure, indelible marker, paint stick, adhesive label, and engraving device capable of leaving a visible mark on a natural or man-made surface.", " “Minor” means a person less than 18 years of age.", " Repealed.", " Repealed.", " “Public or private property” shall include any building, bridge, fence or other structure, any street, alley, sidewalk, or other vehicular or pedestrian right-of-way, any article of street furniture, lamppost, bus shelter, newspaper box, or trash receptacle, any tree, rock, or other natural fixture, any utility or public service equipment, or any other personal property located outdoors, whether publicly or privately owned.", " “Sign” means a name, identification, description, display, or illustration which is affixed to, or represented directly or indirectly upon a building, structure, or piece of land and which directs attention to an object, product, place, activity, person, institution, organization, or business."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/33/"},
{"chapter": "Chapter 34. Use of “District of Columbia” by Certain Persons.", "title": ["§ 22–3401. Use of “District of Columbia” or similar designation by private detective or collection agency — Prohibited.", "§ 22–3402. Use of “District of Columbia” or similar designation by private detective or collection agency — Penalty.", "§ 22–3403. Use of “District of Columbia” or similar designation by private detective or collection agency — Prosecutions for violations."], "text": [], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/34/"},
{"chapter": "Chapter 32. Theft; Fraud; Stolen Property; Forgery; and Extortion.", "titles": ["§ 22–3201. Definitions.", "§ 22–3202. Aggregation of amounts received to determine grade of offense.", "§ 22–3203. Consecutive sentences.", "§ 22–3204. Case referral.", "§ 22–3211. Theft.", "§ 22–3212. Penalties for theft.", "§ 22–3213. Shoplifting.", "§ 22–3214. Commercial piracy.", "§ 22–3214.01. Deceptive labeling.", "§ 22–3214.02. Unlawful operation of a recording device in a motion picture theater.", "§ 22–3215. Unauthorized use of motor vehicles.", "§ 22–3216. Taking property without right.", "§ 22–3218.01. Definitions.", "§ 22–3218.02. Unlawful acts.", "§ 22–3218.03. Presumptions and rebuttal evidence.", "§ 22–3218.04. Penalties for violation.", "§ 22–3221. Fraud.", "§ 22–3222. Penalties for fraud.", "§ 22–3223. Credit card fraud.", "§ 22–3224. Fraudulent registration.", "§ 22–3224.01. Jurisdiction.", "§ 22–3225.01. Definitions.", "§ 22–3225.02. Insurance fraud in the first degree.", "§ 22–3225.03. Insurance fraud in the second degree.", "§ 22–3225.03a. Misdemeanor insurance fraud.", "§ 22–3225.04. Penalties.", "§ 22–3225.05. Restitution.", "§ 22–3225.06. Indemnity.", "§ 22–3225.07. Practitioners.", "§ 22–3225.08. Investigation and report of insurance fraud.", "§ 22–3225.09. Insurance fraud prevention and detection.", "§ 22–3225.10. Regulations.", "§ 22–3225.11. Limited law enforcement authority.", "§ 22–3225.12. Annual anti-fraud activity reporting requirement.", "§ 22–3225.13. Immunity.", "§ 22–3225.14. Prohibition of solicitation.", "§ 22–3225.15. Jurisdiction.", "§ 22–3226.01. Definitions.", "§ 22–3226.02. Application for a certificate of registration of telephone solicitor.", "§ 22–3226.03. Surety bond requirements for telephone solicitors.", "§ 22–3226.04. Security alternative to surety bonds.", "§ 22–3226.05. Exemptions.", "§ 22–3226.06. Unlawful acts and practices.", "§ 22–3226.07. Deceptive acts and practices prohibited.", "§ 22–3226.08. Abusive telemarketing acts or practices.", "§ 22–3226.09. Civil penalties.", "§ 22–3226.10. Criminal penalties.", "§ 22–3226.11. Private right of action.", "§ 22–3226.12. Statute of limitations period.", "§ 22–3226.13. Task force to combat fraud.", "§ 22–3226.14. Fraud Prevention Fund. [Repealed]", "§ 22–3226.15. General disclosures.", "§ 22–3227.01. Definitions.", "§ 22–3227.02. Identity theft.", "§ 22–3227.03. Penalties for identity theft.", "§ 22–3227.04. Restitution.", "§ 22–3227.05. Correction of public records.", "§ 22–3227.06. Jurisdiction.", "§ 22–3227.07. Limitations.", "§ 22–3227.08. Police reports.", "§ 22–3231. Trafficking in stolen property.", "§ 22–3232. Receiving stolen property.", "§ 22–3233. Altering or removing motor vehicle identification numbers.", "§ 22–3234. Altering or removing bicycle identification numbers.", "§ 22–3241. Forgery.", "§ 22–3242. Penalties for forgery.", "§ 22–3251. Extortion.", "§ 22–3252. Blackmail."], "text": [" “Appropriate” means to take or make use of without authority or right.", " “Deprive” means:", " “Person” means an individual (whether living or dead), trust, estate, fiduciary, partnership, company, corporation, association, organization, union, government department, agency, or instrumentality, or any other legal entity.", " “Property” means anything of value. The term “property” includes, but is not limited to:", " “Property of another” means any property in which a government or a person other than the accused has an interest which the accused is not privileged to interfere with or infringe upon without consent, regardless of whether the accused also has an interest in that property. The term “property of another” includes the property of a corporation or other legal entity established pursuant to an interstate compact. The term “property of another” does not include any property in the possession of the accused as to which any other person has only a security interest.", " “Services” includes, but is not limited to:", " “Stolen property” includes any property that has been obtained by conduct previously known as embezzlement.", " “Value” with respect to a credit card, check, or other written instrument means the amount of money, credit, debt, or other tangible or intangible property or services that has been or can be obtained through its use, or the amount promised or paid by the credit card, check, or other written instrument.", " A person may be convicted of any combination of theft, identity theft, fraud, credit card fraud, unauthorized use of a vehicle, commercial piracy, and receiving stolen property for the same act or course of conduct; provided, that no person shall be consecutively sentenced for any such combination or combinations that arise from the same act or course of conduct.", " Convictions arising out of the same act or course of conduct shall be considered as one conviction for purposes of any application of repeat offender sentencing provisions.", " For the purpose of this section, the term “wrongfully obtains or uses” means: (1) taking or exercising control over property; (2) making an unauthorized use, disposition, or transfer of an interest in or possession of property; or (3) obtaining property by trick, false pretense, false token, tampering, or deception. The term “wrongfully obtains or uses” includes conduct previously known as larceny, larceny by trick, larceny by trust, embezzlement, and false pretenses.", " A person commits the offense of theft if that person wrongfully obtains or uses the property of another with intent:", " In cases in which the theft of property is in the form of services, proof that a person obtained services that he or she knew or had reason to believe were available to him or her only for compensation and that he or she departed from the place where the services were obtained knowing or having reason to believe that no payment had been made for the services rendered in circumstances where payment is ordinarily made immediately upon the rendering of the services or prior to departure from the place where the services are obtained, shall be prima facie evidence that the person had committed the offense of theft.", " A violation of ", " shall not constitute a violation of this section.", " ", " Any person convicted of theft in the first degree shall be fined not more than the amount set forth in ", " or imprisoned for not more than 10 years, or both, if the value of the property obtained or used is $1,000 or more.", " ", " Any person convicted of theft in the second degree shall be fined not more than the amount set forth in ", " or imprisoned for not more than 180 days, or both, if the property obtained or used has some value.", " A person convicted of theft in the first or second degree who has 2 or more prior convictions for theft, not committed on the same occasion, shall be fined not more than the amount set forth in ", " or imprisoned for not more than 15 years and for a mandatory-minimum term of not less than one year, or both. A person sentenced under this subsection shall not be released from prison, granted probation, or granted suspension of sentence, prior to serving the mandatory-minimum.", " For the purposes of this section, a person shall be considered as having 2 or more prior convictions for theft if he or she has been convicted on at least 2 occasions of violations of:", " A person commits the offense of shoplifting if, with intent to appropriate without complete payment any personal property of another that is offered for sale or with intent to defraud the owner of the value of the property, that person:", " Any person convicted of shoplifting shall be fined not more than the amount set forth in ", " or imprisoned for not more than 90 days, or both.", " It is not an offense to attempt to commit the offense described in this section.", " A person who offers tangible personal property for sale to the public, or an employee or agent of such a person, who detains or causes the arrest of a person in a place where the property is offered for sale shall not be held liable for detention, false imprisonment, malicious prosecution, defamation, or false arrest, in any proceeding arising out of such detention or arrest, if:", " For the purpose of this section, the term:", " A person commits the offense of commercial piracy if, with the intent to sell, to derive commercial gain or advantage, or to allow another person to derive commercial gain or advantage, that person reproduces or otherwise copies, possesses, buys, or otherwise obtains phonorecords of a sound recording, live performance, or copies of proprietary information, knowing or having reason to believe that the phonorecord or copies were made without the consent of the owner. A presumption of the requisite intent arises if the accused possesses 5 or more unauthorized phonorecords either of the same sound recording or recording of a live performance.", " Nothing in this section shall be construed to prohibit:", " Any person convicted of commercial piracy shall be fined not more than the amount set forth in ", " or imprisoned for not more than 180 days, or both.", " This section does not apply to any sound recording initially fixed on or after February 15, 1972.", " For the purposes of this section, the term:", " A person commits the offense of deceptive labeling if, for commercial advantage or private financial gain, that person knowingly advertises, offers for sale, resale, or rental, or sells, resells, rents, distributes, or transports, or possesses for such purposes, a sound recording or audiovisual work, the label, cover, or jacket of which does not clearly and conspicuously disclose the true name and address of the manufacturer thereof.", " Nothing in this section shall be construed to prohibit:", " Any person convicted of deceptive labeling involving less than 1,000 sound recordings or less than 100 audiovisual works during any 180-day period shall be fined not more than the amount set forth in ", " or imprisoned for not more than 1 year, or both.", " Upon conviction under this section, the court shall, in addition to the penalties provided by this section, order the forfeiture and destruction or other disposition of all sound recordings, audiovisual works, and equipment used, or attempted to be used, in violation of this section.", " For the purposes of this section, the term:", " A person commits the offense of unlawfully operating a recording device in a motion picture theater if, without authority or permission from the owner of a motion picture theater, or his or her agent, that person operates a recording device within the premises of a motion picture theater.", " Any person convicted of unlawfully operating a recording device in a motion picture theater shall be fined not more than the amount set forth in ", " or imprisoned for not more than 90 days, or both.", " A theater owner, or an employee or agent of a theater owner, who detains or causes the arrest of a person in, or immediately adjacent to, a motion picture theater shall not be held liable for detention, false imprisonment, malicious prosecution, defamation, or false arrest in any proceeding arising out of such detention or arrest, if:", " For the purposes of this section, the term “motor vehicle” means any automobile, self-propelled mobile home, motorcycle, truck, truck tractor, truck tractor with semitrailer or trailer, or bus.", " A person commits the offense of unauthorized use of a motor vehicle under this subsection if, without the consent of the owner, the person takes, uses, or operates a motor vehicle, or causes a motor vehicle to be taken, used, or operated, for his or her own profit, use, or purpose.", " A person commits the offense of unauthorized use of a motor vehicle under this subsection if, after renting, leasing, or using a motor vehicle under a written agreement which provides for the return of the motor vehicle to a particular place at a specified time, that person knowingly fails to return the motor vehicle to that place (or to any authorized agent of the party from whom the motor vehicle was obtained under the agreement) within 18 days after written demand is made for its return, if the conditions set forth in paragraph (2) of this subsection are met.", " Except as provided in paragraphs (2) and (3) of this subsection, a person convicted of unauthorized use of a motor vehicle under subsection (b) of this section shall be fined not more than the amount set forth in ", ", imprisoned for not more than 5 years, or both.", " “Company” means a person or enterprise engaged in the generation or distribution of natural gas or electricity.", " “Person” means any individual, corporation, company, association, firm, partnership, joint stock company, or other entity.", " The presence of a connection, wire, conductor, meter alteration, or any device which effects the diversion of electric current or gas without the current or gas being measured or registered by or on a meter installed by a company engaged in the generation or distribution of electricity or natural gas, whether on a single property or within a multiple-unit building or complex, shall constitute prima facie evidence of intent to violate ", ".", " If a check or test meter installed or employed by a company engaged in the generation or distribution of electricity or natural gas shows that a person is using a larger amount of electricity than is registered on the meter installed by the company on the person’s premises for the purpose of registering the natural gas or electricity used by the person, and the company has verified that the meter is not malfunctioning, it shall constitute prima facie evidence that the unregistered current or gas has been wrongfully diverted by such person and shall constitute prima facie evidence of intent to violate ", ".", " The presumptions created by this section may be rebutted by a preponderance of the evidence to the contrary that the person alleged to have violated § 22-3218a did not do so. If the person in actual possession of the property or unit has not received the direct benefit of the reduction of the cost in electric or gas services, the presumptions created by this section shall apply to the owner of the property or unit; provided, that the owner has received the direct benefit of unregistered services for at least one full billing cycle.", " A person who violates ", " shall be guilty of a misdemeanor, and, upon a conviction, shall be imprisoned for not more than 60 days, or fined, not more than the amount set forth in ", ", or both. In the case of a second or subsequent conviction, a person who violates ", " shall be imprisoned for not more than 180 days, or fined, not more than the amount set forth in ", ", or both.", " In addition to the criminal penalties in subsection (a) of this section, a person who is found to have violated ", " in a civil proceeding shall be liable to the company using or engaged in the generation or distribution of electricity or gas for restitution of the amount of any losses or damage sustained.", " ", " A person commits the offense of fraud in the first degree if that person engages in a scheme or systematic course of conduct with intent to defraud or to obtain property of another by means of a false or fraudulent pretense, representation, or promise and thereby obtains property of another or causes another to lose property.", " ", " A person commits the offense of fraud in the second degree if that person engages in a scheme or systematic course of conduct with intent to defraud or to obtain property of another by means of a false or fraudulent pretense, representation, or promise.", " ", " Fraud may be committed by means of false promise as to future performance which the accused does not intend to perform or knows will not be performed. An intent or knowledge shall not be established by the fact alone that one such promise was not performed.", " ", " ", " For the purposes of this section, the term “credit card” means an instrument or device, whether known as a credit card, debit card, or by any other name, issued for use of the cardholder in obtaining or paying for property or services.", " A person commits the offense of credit card fraud if, with intent to defraud, that person obtains or pays for property or services by:", " A credit card is deemed cancelled or revoked when notice in writing thereof has been received by the named holder as shown on the credit card or by the records of the issuer.", " Except as provided in paragraph (2) of this subsection, any person convicted of credit card fraud shall be fined not more than the amount set forth in ", ", imprisoned for not more than 180 days, or both.", " A person commits the offense of fraudulent registration if, with intent to defraud the proprietor or manager of a hotel, motel, or other establishment which provides lodging to transient guests, that person falsely registers under a name or address other than his or her actual name or address.", " Any person convicted of fraudulent registration shall be fined not more than the amount set forth in ", " or imprisoned for not more than 90 days, or both.", " The person to whom a credit card was issued or in whose name the credit card was issued is a resident of, or located in, the District of Columbia;", " The person who was defrauded is a resident of, or located in, the District of Columbia at the time of the fraud;", " The loss occurred in the District of Columbia; or", " Any part of the offense takes place in the District of Columbia.", " “Business of insurance” means the writing of insurance or reinsuring the risks by an insurer, including acts necessary or incidental to writing insurance or reinsuring risks and the activities of persons who act as or are officers, directors, agents, or employees of insurers, or who are other persons authorized to act on their behalf.", " “Commissioner” means the Commissioner of the Department of Insurance, Securities, and Banking, the Commissioner’s designee, or the Department of Insurance, Securities, and Banking.", " “District” means the District of Columbia.", " “Insurance” means a contract or arrangement in which one undertakes to:", " “Insurance professional” means insurance sales agents or managing general agents, insurance brokers, insurance producers, insurance adjusters, and insurance third party administrators.", " “Insurer” includes any company defined by ", " and ", ", authorized to do the business of insurance in the District, a hospital and medical services corporation, a fraternal benefit society, or a health maintenance organization. The term “insurer” shall not apply to a Medicaid health maintenance organization.", " “Malice” means an intentional or deliberate infliction of injury, by furnishing or disclosing information with knowledge that the information is false, or furnishing or disclosing information with reckless disregard for a strong likelihood that the information is false and that injury will occur as a result.", " “Person” means a natural person, company, corporation, joint stock company, unincorporated association, partnership, professional corporation, trust, or any other entity or combination of the foregoing.", " “Practitioner” means a person, licensed to practice a profession or trade in the District, whose services are compensated either in whole or in part, directly or indirectly, by insurance proceeds.", " “Premium” means the money paid or payable as the consideration for coverage under an insurance policy.", " Presenting false information or knowingly conceals information regarding a material fact in any of the following transactions:", " Soliciting or accepting insurance or renewal of insurance by or for an insurer which the person knows is insolvent or has a strong likelihood of insolvency;", " Removal or tampering with the records of transaction, documentation, and other material assets of an insurer from the insurer or from the Department of Insurance and Securities Regulation;", " Diversion, misappropriation, conversion, or embezzlement of funds of an insurer, an insured, claimant or applicant regarding any of the following:", " Transaction of the business of insurance in violation of laws requiring a license, certificate of authority, or other legal authority for the transaction of the business of insurance; or", " Employing or using any other person or acting as the agent of any other person to procure a client, patient, or customer for the purpose of falsely or fraudulently obtaining benefits under a contract of insurance or asserting a false or fraudulent claim against an insured or insurer.", " Any person convicted of insurance fraud in the first degree shall be fined not more than the amount set forth in ", " or imprisoned for not more than 15 years, or both.", " Except as provided in paragraph (2) of this subsection, any person convicted of insurance fraud in the second degree shall be fined not more than the amount set forth in ", " or imprisoned for not more than 5 years, or both.", " Any person convicted of misdemeanor insurance fraud shall be fined not more than the amount set forth in ", " or imprisoned for not more than 180 days, or both.", " A person convicted of a felony violation of this subchapter shall be disqualified from engaging in the business of insurance, subject to 18 U.S.C. § 1033(e)(2).", " In addition to the penalties provided under ", ", a person convicted under this subchapter shall make monetary restitution for any loss caused by the offense. The court shall determine the form and method of payment which, if by installment, shall not exceed 5 years.", " Any person, including the District, injured as the result of an insurance fraud in the first degree may bring suit in the appropriate court to recover ordinary damages including attorney’s fees and other costs and punitive damages which shall not be less than $500 nor more than $50,000. Except where punitive damages are sought, the court shall award treble damages where the offense is proven by clear and convincing evidence to be in accordance with an established pattern or practice.", " Notwithstanding any action that may be brought by the United States Attorney’s office to recoup its costs in prosecuting these cases, the Corporation Counsel may bring a civil suit against any person convicted under this subchapter in order to recover investigation and prosecution-related costs incurred by the District.", " A suit under subsection (b) of this section must be filed within 3 years of the act constituting the offense or within 3 years of the time the plaintiff discovered or with reasonable diligence could have discovered the act, whichever is later. This 3 year statute of limitations shall not apply to the District.", " Remedies provided in this section shall be exclusive and may not be claimed in conjunction with any other remedies available under the law.", " Damages or restitution provided by this subchapter, either jointly, severably, or as a third party, for insurance fraud offense committed by an insured; or", " The defense of an insured or other person who is charged with insurance fraud.", " Notwithstanding any other provisions of law, the offenses of insurance fraud in the first degree or the second degree shall be deemed a crime of moral turpitude for the purposes of professional or trade license.", " The Commissioner, court, or prosecutor shall notify the appropriate licensing authority, and the person who is injured by the offense may notify the appropriate licensing authority of any conviction.", " Based upon a reasonable belief, an insurer, insurance professional, and any other pertinent person, shall report to the Metropolitan Police Department or the Department of Insurance, Securities, and Banking, actions that may constitute the commission of insurance fraud, and assist in the investigation of insurance fraud by reasonably providing information when required by an investigating authority.", " The Commissioner may investigate suspected fraudulent insurance acts and persons engaged in the business of insurance. Nothing in this subchapter shall preempt the authority or relieve the duty of other law enforcement or regulatory agencies to investigate, examine, and prosecute suspected violations of law.", " An insurer, insurance professional, or any other pertinent person who fails to reasonably assist the investigation of an insurance fraud or fails to report an insurance fraud, and who is injured by that insurance fraud, shall be estopped from receiving restitution as provided in ", ".", " Any information, documentation, or other evidence provided under this section by an insurer, its employees, producers, or agents, or by any other person, to the Department of Insurance, Securities, and Banking, the Metropolitan Police Department, or any other law enforcement agency in connection with any investigation of suspected fraud is not subject to public inspection as long as the Commissioner or law enforcement agency deems the withholding to be necessary to complete an investigation of the suspected fraud or to protect the person or entity investigated from unwarranted injury.", " Repealed.", " Within 6 months of April 27, 1999, every insurer licensed in the District shall submit to the Department of Insurance and Securities Regulation, an insurance fraud prevention and detection plan (“plan”). The plan shall indicate specific procedures for the accomplishment of the following:", " The Commissioner may review the plan for compliance with this section and may order reasonable modification or request a summary of the plan. The Commissioner may establish by regulation a fine for an insurer failing to comply with the plan. The plan shall not be deemed a public record for the purposes of any public records or ", ".", " Notwithstanding any other provisions of law, an insurer who fails to submit an insurance prevention and detection plan, or the warning provision required by subsection (d) of this section shall be subject to a fine of $500 per day, not to exceed $25,000.", " No later than 6 months after April 27, 1999, all insurance application forms and all claim forms shall contain a conspicuous warning in language the same or substantially similar to the following:", " None of the requirements of this section shall be deemed to apply to reinsurers, reinsurance contracts, reinsurance agreements, or reinsurance claims transactions.", " The Commissioner shall have the power to issue and serve subpoenas, to compel witnesses to appear and testify, and to produce all books, records, papers, or documents in any insurance investigation or examination.", " Any willful false testimony by a witness before the Commissioner as to any material fact shall constitute perjury and shall be punished in the manner prescribed by law for such offense.", " If any witness having been personally summoned shall neglect or refuse to obey the subpoena issued pursuant to subsection (a) of this section, the Commissioner may, through the Corporation Counsel, report that fact to the Superior Court of the District of Columbia or one of the judges thereof and the Court, or any judge thereof, may compel obedience to the subpoena to the same extent as witnesses may be compelled to obey the subpoenas of the Court.", " The Commissioner may administer oaths to witnesses summoned in any investigation or examination as set forth in subsection (a) of this section.", " The report was made to:", " The person or entity reporting the suspected fraud acted without malice when making the report.", " Except as provided in paragraph (2) of this subsection, it is unlawful for a practitioner, whether directly or through a paid intermediary, to solicit for financial gain a client, patient, or customer within 21 days of a motor vehicle accident with the intent to seek benefits under a contract of insurance or to assert a claim against an insured, a governmental entity, or an insurer on behalf of any person arising out of the accident.", " Except as provided in subsection (a)(2) of this section, it is unlawful for a person to solicit for financial gain a client, patient, or customer within 21 days of a motor vehicle accident for the purpose of directing the client, patient, or customer to a practitioner.", " A person or practitioner found by clear and convincing evidence to have violated the provisions of this section shall be subject to a civil penalty of $1,000. The Mayor may increase this penalty by rulemaking.", " If a person involved in an automobile accident, or his parent or guardian, executes, within 21 days of a motor vehicle accident, a release of liability, without the assistance or guidance of legal counsel, pursuant to the settlement of a claim for personal injury, that person or his parent or guardian may void the release; provided, that the insurance carrier or other settling party receives written notice of the intent to void the release within 14 days of the date that the release was executed, and the written notice is accompanied by any check or settlement proceeds related to the claim for personal injury that had been delivered to the claimant.", " The provisions of this section are not severable.", " The insured, insurer, claimant, or applicant is a resident of, or located in, the District of Columbia;", " A District of Columbia address is used on an application, policy, or claim for payment or benefit;", " The services for which a claim is made were provided or alleged to have been provided in the District of Columbia;", " Payment of a claim or benefit was made or was to be made to an address in the District of Columbia;", " The loss occurred or is alleged to have occurred in the District of Columbia; or", " Any part of the offense takes place in the District of Columbia.", " “Applicant” means any individual, sole proprietorship, partnership, association, cooperative, corporation, nonprofit organization, and any other organization required to register with the District to conduct telemarketing in the District of Columbia.", " “Certificate of registration” means a document issued by the District government showing that a named individual or business has registered as a telephone solicitor with the Mayor of the District of Columbia.", " “Consumer” means a person who is or may be required to pay for goods or services offered by a telephone solicitor through telemarketing.", " “Goods” or “services” means any real property or any tangible or intangible personal property or services of any kind provided or offered to a consumer.", " “Licensed securities, commodities or investment broker” means a licensed or registered securities, commodities or investment broker.", " “Seller” means any person, who, in connection with a telemarketing transaction, provides, offers to provide, or arranges for others to provide goods or services to the customer in exchange for consideration.", " “Telemarketing” means a plan, program or campaign which is conducted to induce the purchase of goods or services by use of one or more telephones. Telemarketing does not include a one-time or infrequent transaction unrelated to a pattern of repeated transactions. Telemarketing does not include a telephone call to a consumer:", " “Telephone solicitor” means a person (acting himself or itself, or through an agent) who initiates a telephone call to a consumer in the District of Columbia as a part of a plan, program, or campaign which is conducted to induce the purchase of goods or services by the use of one or more telephones. A telephone solicitor does not include a person who initiates a telephone call to a consumer:", " No person shall transact any business as a telephone solicitor without first having obtained a certificate of registration from the Mayor.", " The application for certificate of registration shall be made at least 60 business days prior to offering for sale consumer goods or services by telephone.", " The Mayor shall provide an application form for the annual certificate of registration.", " The application for a certificate of registration as a telephone solicitor shall include, but not be limited to, the following information:", " The Mayor shall serve as the registered agent if no registered agent is appointed or if the individual or organization named ceases to serve as the registered agent and no successor is appointed.", " The Mayor shall investigate the veracity of an application.", " The Mayor shall deny a certificate of registration when the Mayor determines that an application contains false information.", " The Mayor shall provide written notification to an applicant when an application has been denied.", " The Mayor shall notify the applicant in writing of the information that the Mayor finds to be false.", " No person may conduct telemarketing in the District of Columbia without having first obtained a certificate of registration.", " The Mayor shall either deny or grant an application within 30 days of the filing of an application.", " The Mayor may establish reasonable fees for filing of applications. The Mayor shall make available printed license application forms as well as electronic forms, which may be downloaded by computer.", " Certificates of registration issued in accordance with this subchapter shall be valid for one year. Prior to expiration of a certificate of registration, an applicant may obtain a new certificate by the filing of a new application.", " If any person has obtained a certificate of registration under false pretenses, including providing false information in an application, the certificate of registration shall be revoked and may be reinstated only upon proof of correction.", " The application for registration or renewal shall be accompanied by a surety bond in the amount of $50,000. The bond shall provide for the indemnification of any person suffering a loss as the result a violation of this subchapter.", " The surety may terminate the bond upon giving a 60-day written notice to the principal and to the Mayor.", " Unless the bond is replaced by that of another surety before the expiration of the 60-day notice of cancellation, the registration of the principal shall be treated as lapsed.", " An applicant required under this subchapter to file a bond with a registration application may file with the Mayor, in lieu thereof, a certificate of deposit or government bond in the amount of $50,000.", " The Mayor shall hold the certificate of deposit or government bond for 3 years starting from the date the telemarketing business ceases to operate or the registration lapses in order to pay claims made against the telemarketing business during its period of operation after which time the Mayor shall return any remaining balance.", " The registration of the telemarketing business shall be treated as lapsed if, at any time, the amount of bond, cash, certificate of deposit or government bonds falls below the amount required by this section.", " The surety bond shall remain in effect for 3 years from the period the telemarketing business ceases to operate in the District.", " The aggregate liability of the surety company to all persons injured by a telephone solicitor’s violations of this subchapter shall not exceed the amount of the bond.", " A telephone solicitor shall be exempt from the registration and bonding requirements of this subchapter if the telephone solicitor is engaged in any of the following activities:", " A telephone solicitor commits the offense of telephone solicitation fraud when engaged in any one of the following:", " A person who violates any provision of this section shall be subject to the penalties provided in §§ ", " and ", ".", " It is a deceptive telemarketing act or practice for any seller or telephone solicitor to misrepresent any of the following material information:", " It is a deceptive telemarketing act or practice for any seller or telephone solicitor to misrepresent any material fact regarding the goods or services purchased that has a tendency to mislead.", " No person shall commit a deceptive telemarketing act or practice.", " Cause a telephone to ring more than 15 times in an intended telephone solicitation call;", " Initiate a telephone solicitation call to a consumer after the same consumer has expressly stated that he or she does not wish to receive solicitation calls from that seller; or", " Engage in telephone solicitation to a consumer’s residence at any time before 8:00 a.m. and after 9:00 p.m., local time at the place of the consumer called.", " The following penalties may be imposed in addition to those otherwise available at law:", " Fines shall be payable to the Fraud Prevention Fund established in ", ".", " If the amount of the transaction is valued at $20,000 or more, the seller or telephone solicitor shall upon conviction be guilty of a felony, and shall be subject to a fine of not more than the amount set forth in ", " or imprisonment for not more than 4 years, or both.", " If the amount of the transaction is valued at less than $20,000 but more than $5,000, the seller or telephone solicitor shall upon conviction be guilty of a felony, and shall be subject to a fine of not more than the amount set forth in ", " or imprisonment for not more than 3 years, or both.", " If the amount of the transaction is valued at less than $5,000 or less, the seller or telephone solicitor shall upon conviction be guilty of a misdemeanor and shall be subject to a fine of not more than the amount set forth in ", " or imprisonment for not more than 6 months, or both.", " Any consumer injured as a result of a violation of ", ", ", ", or ", " may bring an action in the Superior Court of the District of Columbia to recover or obtain any of the following:", " Nothing in this subchapter shall prevent any consumer who is injured by any other trade practice from exercising any right or seeking any remedy to which the consumer might be entitled.", " The Mayor shall form a task force for the following purposes:", " The task force may include representatives from the following agencies:", " Within the first 30 seconds of a telephone call, the telephone solicitor shall identify himself or herself by stating his or her true name, the company on whose behalf the solicitation is being made, and the goods or services to be sold.", " Any person who violates this section shall be subject to civil penalties pursuant to ", ".", " “Financial injury” means all monetary costs, debts, or obligations incurred by a person as a result of another person obtaining, creating, possessing, or using that person’s personal identifying information in violation of this subchapter, including, but not limited to:", " Repealed.", " “Personal identifying information” includes, but is not limited to, the following:", " “Property” shall have the same meaning as provided in ", " and shall include credit.", " Uses personal identifying information belonging to or pertaining to another person to obtain, or attempt to obtain, property fraudulently and without that person’s consent;", " Obtains, creates, or possesses personal identifying information belonging to or pertaining to another person with the intent to:", " Uses personal identifying information belonging to or pertaining to another person, without that person’s consent, to:", " ", " Any person convicted of identity theft shall be fined not more than (1) the amount set forth in ", ", (2) twice the value of the property obtained or (3) twice the amount of the financial injury, whichever is greatest, or imprisoned for not more than 10 years, or both, if the property obtained, or attempted to be obtained, or the amount of the financial injury is $1,000 or more.", " ", " Any person convicted of identity theft shall be fined not more than the amount set forth in ", " or imprisoned for not more than 180 days, or both, if the property obtained, or attempted to be obtained, or the amount of the financial injury, has some value, or if another person is falsely accused of, or arrested for, committing a crime because of the use, without permission, of that person’s personal identifying information.", " ", " Repealed.", " When a person is convicted, adjudicated delinquent, or found not guilty by reason of insanity of identity theft, the court may issue such orders as are necessary to correct any District of Columbia public record that contains false information as a result of a violation of this subchapter.", " In all other cases, a person who alleges that he or she is a victim of identity theft may petition the court for an expedited judicial determination that a District of Columbia public record contains false information as a result of a violation of this subchapter. Upon a finding of clear and convincing evidence that the person was a victim of identity theft, the court may issue such orders as are necessary to correct any District of Columbia public record that contains false information as a result of a violation of this subchapter.", " Notwithstanding any other provision of law, District of Columbia agencies shall comply with orders issued under subsection (a) of this section within 30 days of issuance of the order.", " For the purposes of this section, the term “District of Columbia public record” means any document, book, photographic image, electronic data recording, paper, sound recording, or other material, regardless of physical form or characteristic, made or received pursuant to law or in connection with the transaction of public business by any officer or employee of the District of Columbia.", " The person whose personal identifying information is improperly obtained, created, possessed, or used is a resident of, or located in, the District of Columbia; or", " Any part of the offense takes place in the District of Columbia.", " For the purposes of this section, the term “traffics” means:", " A person commits the offense of trafficking in stolen property if, on 2 or more separate occasions, that person traffics in stolen property, knowing or having reason to believe that the property has been stolen.", " It shall not be a defense to a prosecution under this section,  alone or in conjunction with ", ", that the property was not in fact stolen, if the accused engages in conduct which would constitute the crime if the attendant circumstances were as the accused believed them to be.", " Any person convicted of trafficking in stolen property shall be fined not more than the amount set forth in ", " or imprisoned for not more than 10 years, or both.", " A person commits the offense of receiving stolen property if that person buys, receives, possesses, or obtains control of stolen property, knowing or having reason to believe that the property was stolen.", " It shall not be a defense to a prosecution under this section, alone or in conjunction with ", ", that the property was not in fact stolen, if the accused engages in conduct which would constitute the crime if the attendant circumstances were as the accused believed them to be.", " Any person convicted of receiving stolen property shall be fined not more than the amount set forth in ", " or imprisoned not more than 7 years, or both, if the value of the stolen property is $1,000 or more.", " For the purposes of this section, the term “stolen property” includes property that is not in fact stolen if the person who buys, receives, possesses, or obtains control of the property had reason to believe that the property was stolen.", " It is unlawful for a person to knowingly remove, obliterate, tamper with, or alter any identification number on a motor vehicle or a motor vehicle part.", " Any person who violates subsection (a) of this section shall be guilty of a misdemeanor and, upon conviction, shall be imprisoned for not more than 180 days, or fined not more than the amount set forth in ", ", or both.", " For the purposes of this section, the term:", " It is unlawful for a person to knowingly remove, obliterate, tamper with, or alter any identification number on a bicycle or bicycle part.", " Any person who violates subsection (a) of this section shall be guilty of a misdemeanor and, upon conviction, shall be imprisoned for not more than 180 days, or fined not more than the amount set forth in ", ", or both.", " For the purposes of this section, the term:", " For the purposes of this subchapter, the term:", " A person commits the offense of forgery if that person makes, draws, or utters a forged written instrument with intent to defraud or injure another.", " Any person convicted of forgery shall be fined not more than the amount set forth in ", " or imprisoned for not more than 10 years, or both, if the written instrument purports to be:", " Any person convicted of forgery shall be fined not more than the amount set forth in ", " or imprisoned for not more than 5 years, or both, if the written instrument is or purports to be:", " Any person convicted of forgery shall be fined not more than the amount set forth in ", " or imprisoned for not more than 3 years, or both, in any other case.", " A person commits the offense of extortion if:", " Any person convicted of extortion shall be fined not more than the amount set forth in ", " or imprisoned for not more than 10 years, or both.", " A person commits the offense of blackmail when that person, with intent to obtain property of another or to cause another to do or refrain from doing any act, threatens to:", " Any person convicted of blackmail shall be fined not more than the amount set forth in ", " or imprisoned for not more than 5 years, or both."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/32/"},
{"chapter": "Chapter 31B. Terrorism.", "title": ["§ 22–3151. Short title.", "§ 22–3152. Definitions.", "§ 22–3153. Acts of terrorism; penalties.", "§ 22–3154. Manufacture or possession of a weapon of mass destruction.", "§ 22–3155. Use, dissemination, or detonation of a weapon of mass destruction.", "§ 22–3156. Jurisdiction."], "text": [" “Act of terrorism” means an act or acts that constitute a specified offense as defined in paragraph (8) of this section and that are intended to:", " “Biological agent” means any microorganism, virus, infectious substance, or biological product that may be engineered as a result of biotechnology, or any naturally occurring or bioengineered component of any such microorganism, virus, infectious substance, or biological product, capable of causing:", " “Hoax weapon of mass destruction” means any device or object that by its design, construction, content, or characteristics, appears to be or to contain, or is represented to be or to contain a weapon of mass destruction, even if it is, in fact, an inoperative facsimile or imitation of a weapon of mass destruction, or contains no weapon of mass destruction.", " “Material support or resources” means:", " “Nuclear material” means material containing any:", " “Provision of material support or resources for an act of terrorism” means the act of providing material support or resources to a person or an organization with the purpose or knowledge that the material support or resources will be used, in whole or in part, to plan, prepare, or carry out an act of terrorism, or to flee after committing an act of terrorism.", " “Solicitation of material support or resources to commit an act of terrorism” means the act of raising, soliciting, or collecting material support or resources with the purpose or knowledge that such material support or resources will be used, in whole or in part, to plan, prepare, or carry out an act of terrorism, or to flee after committing an act of terrorism.", " “Specified offense” means:", " “Toxic or poisonous chemical” means any chemical which, through its chemical action on life processes, can cause death, permanent incapacitation, or permanent harm to humans.", " “Toxin” means the toxic material of plants, animals, microorganisms, viruses, fungi, or infectious substances, or a recombinant molecule, whatever its origin or method of production, including:", " “Unit of government” means:", " “Weapon of mass destruction” means:", " A person who commits first degree murder that constitutes an act of terrorism shall, upon conviction, be punished by imprisonment for life without the possibility of release.", " A person who commits murder of a law enforcement officer or public safety employee that constitutes an act of terrorism shall, upon conviction, be punished by imprisonment for life without the possibility of release.", " A person who commits murder in the second degree that constitutes an act of terrorism may, upon conviction, be punished by imprisonment for life.", " A person who commits manslaughter that constitutes an act of terrorism may, upon conviction, be punished by imprisonment for life.", " A person who commits kidnapping that constitutes an act of terrorism may, upon conviction, be punished by imprisonment for life.", " A person who commits any assault with intent to kill that constitutes an act of terrorism may, upon conviction, be punished by imprisonment for not more than 30 years.", " A person who commits mayhem or maliciously disfiguring another that constitutes an act of terrorism may, upon conviction, be punished by imprisonment for not more than 20 years.", " A person who commits arson that constitutes an act of terrorism may, upon conviction, be punished by imprisonment for not more than 20 years.", " A person who commits malicious burning, destruction, or injury of another’s property, if such property is valued at $500,000 or more, that constitutes an act of terrorism may, upon conviction, be punished by imprisonment for not more than 20 years.", " A person who attempts or conspires to commit first degree murder, murder of a law enforcement officer or public safety employee, murder in the second degree, manslaughter, or kidnapping that constitutes an act of terrorism may be punished by imprisonment for not more than 30 years.", " A person who attempts or conspires to commit any assault with intent to kill that constitutes an act of terrorism may, upon conviction, be punished by imprisonment for not more than 20 years.", " A person who attempts or conspires to commit mayhem or maliciously disfiguring another, arson, or malicious burning, destruction, or injury of another’s property, if such property is valued at $500,000 or more, that constitutes an act of terrorism may, upon conviction, be punished by imprisonment of not more than 15 years.", " A person who provides material support or resources for an act of terrorism may, upon conviction, be punished by imprisonment for not more than 20 years.", " A person who solicits material support or resources to commit an act of terrorism may, upon conviction, be punished by imprisonment for not more than 20 years.", " A person who manufactures or possesses a weapon of mass destruction capable of causing multiple deaths, serious bodily injuries to multiple persons, or massive destruction of property may, upon conviction, be punished by imprisonment for life.", " A person who attempts or conspires to manufacture or possess a weapon of mass destruction capable of causing multiple deaths, serious bodily injuries to multiple persons, or massive destruction of property may, upon conviction, be punished by imprisonment for not more than 30 years.", " In addition to any other penalty provided under this section, a person may be fined an amount not more than the amount set forth in ", ".", " A person who uses, disseminates, or detonates a weapon of mass destruction capable of causing multiple deaths, serious bodily injuries to multiple persons, or massive destruction of property may, upon conviction, be punished by imprisonment for life.", " A person who attempts or conspires to use, disseminate, or detonate a weapon of mass destruction capable of causing multiple deaths, serious bodily injuries to multiple persons, or massive destruction of property may, upon conviction, be punished by imprisonment for not more than 30 years.", " In addition to any other penalty provided under this section, a person may be fined an amount not more than the amount set forth in ", "."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/31B/"},
{"chapter": "Chapter 31A. Stalking.", "title": ["§ 22–3131. Legislative intent.", "§ 22–3132. Definitions.", "§ 22–3133. Stalking.", "§ 22–3134. Penalties.", "§ 22–3135. Jurisdiction."], "text": [" The Council finds that stalking is a serious problem in this city and nationwide. Stalking involves severe intrusions on the victim’s personal privacy and autonomy. It is a crime that can have a long-lasting impact on the victim’s quality of life, and creates risks to the security and safety of the victim and others, even in the absence of express threats of physical harm. Stalking conduct often becomes increasingly violent over time. The Council recognizes the dangerous nature of stalking as well as the strong connections between stalking and domestic violence and between stalking and sexual assault. Therefore, the Council enacts this law to encourage effective intervention by the criminal justice system before stalking escalates into behavior that has even more serious or lethal consequences.", " The Council enacts this stalking statute to permit the criminal justice system to hold stalkers accountable for a wide range of acts, communications, and conduct. The Council recognizes that stalking includes a pattern of following or monitoring the victim, or committing violent or intimidating acts against the victim, regardless of the means.", " “Any device” means electronic, mechanical, digital or any other equipment, including: a camera, spycam, computer, spyware, microphone, audio or video recorder, global positioning system, electronic monitoring system, listening device, night-vision goggles, binoculars, telescope, or spyglass.", " “Any means” includes the use of a telephone, mail, delivery service, e-mail, website, or other method of communication or any device.", " “Communicating” means using oral or written language, photographs, pictures, signs, symbols, gestures, or other acts or objects that are intended to convey a message.", " “Emotional distress” means significant mental suffering or distress that may, but does not necessarily, require medical or other professional treatment or counseling;", " “Financial injury” means the monetary costs, debts, or obligations incurred as a result of the stalking by the specific individual, member of the specific individual’s household, a person whose safety is threatened by the stalking, or a person who is financially responsible for the specific individual and includes:", " “Personal identifying information” shall have the same meaning as provided in ", ".", " “Specific individual” or “individual” means the victim or alleged victim of stalking.", " “To engage in a course of conduct” means directly or indirectly, or through one or more third persons, in person or by any means, on 2 or more occasions, to:", " It is unlawful for a person to purposefully engage in a course of conduct directed at a specific individual:", " This section does not apply to constitutionally protected activity.", " Where a single act is of a continuing nature, each 24-hour period constitutes a separate occasion.", " The conduct on each of the occasions need not be the same as it is on the others.", " Except as provided in subsections (b) and (c) of this section, a person who violates ", " shall be fined not more than the amount set forth in ", ", imprisoned for not more than 12 months, or both.", " A person who violates ", " shall be fined not more than the amount set forth in ", ", imprisoned for not more than 5 years, or both, if the person:", " A person who violates ", " shall be fined not more than the amount set forth in ", ", imprisoned for not more than 10 years, or both, if the person has 2 or more prior convictions in any jurisdiction for stalking any person, at least one of which was for a jury demandable offense.", " A person shall not be sentenced consecutively for stalking and identify theft based on the same act or course of conduct.", " An offense shall be deemed to be committed in the District of Columbia if the conduct on at least one occasion was initiated in the District of Columbia or had an effect on the specific individual in the District of Columbia.", " A communication shall be deemed to be committed in the District of Columbia if it is made or received in the District of Columbia or, if the specific individual lives in the District of Columbia, it can be electronically accessed in the District of Columbia."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/31A/"},
{"chapter": "Chapter 31. Sexual Performance Using Minors.", "title": ["§ 22–3101. Definitions.", "§ 22–3102. Prohibited acts.", "§ 22–3103. Penalties.", "§ 22–3104. Affirmative defenses."], "text": [" “Knowingly” means having general knowledge of, or reason to know or a belief or ground for belief which warrants further inspection or inquiry, or both.", " “Minor” means any person under 18 years of age.", " “Performance” means any play, motion picture, photograph, electronic representation, dance, or any other visual presentation or exhibition.", " “Promote” means to procure, manufacture, issue, sell, give, provide, lend, mail, deliver, transfer, transmute, publish or distribute, circulate, disseminate, present, exhibit, or advertise, or to offer or agree to do the same.", " “Sexual conduct” means:", " “Sexual performance” means any performance or part thereof which includes sexual conduct by a person under 18 years of age.", " It shall be unlawful in the District of Columbia for a person knowingly to use a minor in a sexual performance or to promote a sexual performance by a minor.", " It shall be unlawful in the District of Columbia for a person, knowing the character and content thereof, to attend, transmit, or possess a sexual performance by a minor.", " If the sexual performance consists solely of a still or motion picture, then this section:", " For the purposes of subsections (b) and (c) of this section, the term:", " A fine of not more than the amount set forth in ", " or imprisonment for not more than 10 years, or both for the first offense; or", " A fine of not more than the amount set forth in ", " or imprisonment for not more than 20 years, or both for the 2nd and each subsequent offense.", " Under this chapter it shall be an affirmative defense that the defendant in good faith reasonably believed the person appearing in the performance was 18 years of age or over.", " Except as provided in paragraph (2) of this subsection, in any prosecution for an offense pursuant to § 22-3102(2) it shall be an affirmative defense that the person so charged was:", " It shall be an affirmative defense to a charge under ", " that the defendant:"], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/31/"},
{"chapter": "Chapter 30A. Non-Consensual Pornography.", "title": ["§ 22–3051. Definitions.", "§ 22–3052. Unlawful disclosure.", "§ 22–3053. First-degree unlawful publication.", "§ 22–3054. Second degree unlawful publication.", "§ 22–3055. Exclusions.", "§ 22–3056. Affirmative defenses.", "§ 22–3057. Jurisdiction."], "text": [" “Disclose” means to transfer or exhibit to 5 or fewer persons.", " “Harm” means any injury, whether physical or nonphysical, including psychological, financial, or reputational injury.", " “Internet” means an electronically available platform by which sexual images can be disseminated to a wide audience, including social media, websites, and smartphone applications; provided, that the term “Internet” does not include a text message.", " “Private area” means the genitals, anus, or pubic area of a person, or the nipple of a developed female breast, including the breast of a transgender female.", " “Publish” means to transfer or exhibit to 6 or more persons, or to make available for viewing by uploading to the Internet.", " “Sexual conduct” shall have the same meaning as provided in ", ".", " “Sexual image” means a photograph, video, or other visual recording of an unclothed private area or of sexual conduct.", " It shall be unlawful in the District of Columbia for a person to knowingly disclose one or more sexual images of another identified or identifiable person when:", " A person who violates this section shall be guilty of a misdemeanor and, upon conviction, shall be fined not more than the amount set forth in ", ", imprisoned for not more than 180 days, or both.", " It shall be unlawful in the District of Columbia for a person to knowingly publish one or more sexual images of another identified or identifiable person when:", " A person who violates this section shall be guilty of a felony and, upon conviction, shall be fined not more than the amount set forth in ", ", imprisoned for not more than 3 years, or both.", " It shall be unlawful in the District of Columbia for a person to knowingly publish one or more sexual images of another identified or identifiable person obtained from a third party or other source when:", " A person who violates this section shall be guilty of a misdemeanor and, upon conviction, shall be fined not more than the amount set forth in ", ", imprisoned for not more than 180 days, or both.", " This chapter shall not apply to:", " Nothing in this chapter shall be construed to impose liability on an interactive computer service, as defined in section 230(e)(2) of the Communications Act of 1934, approved February 8, 1996 (110 Stat. 139; 47 U.S.C. § 230(f)(2)), for content provided by another person."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/30A/"},
{"chapter": "Chapter 30. Sexual Abuse.", "titles": ["§ 22–3001. Definitions.", "§ 22–3002. First degree sexual abuse.", "§ 22–3003. Second degree sexual abuse.", "§ 22–3004. Third degree sexual abuse.", "§ 22–3005. Fourth degree sexual abuse.", "§ 22–3006. Misdemeanor sexual abuse.", "§ 22–3007. Defense to sexual abuse.", "§ 22–3008. First degree child sexual abuse.", "§ 22–3009. Second degree child sexual abuse.", "§ 22–3009.01. First degree sexual abuse of a minor.", "§ 22–3009.02. Second degree sexual abuse of a minor.", "§ 22–3009.03. First degree sexual abuse of a secondary education student.", "§ 22–3009.04. Second degree sexual abuse of a secondary education student.", "§ 22–3010. Enticing a child or minor.", "§ 22–3010.01. Misdemeanor sexual abuse of a child or minor.", "§ 22–3010.02. Arranging for a sexual contact with a real or fictitious child.", "§ 22–3011. Defenses to child sexual abuse and sexual abuse of a minor.", "§ 22–3012. State of mind proof requirement.", "§ 22–3013. First degree sexual abuse of a ward, patient, client, or prisoner.", "§ 22–3014. Second degree sexual abuse of a ward, patient, client, or prisoner.", "§ 22–3015. First degree sexual abuse of a patient or client.", "§ 22–3016. Second degree sexual abuse of a patient or client.", "§ 22–3017. Defenses to sexual abuse of a ward, patient, or client.", "§ 22–3018. Attempts to commit sexual offenses.", "§ 22–3019. No immunity from prosecution for spouses or domestic partners.", "§ 22–3020. Aggravating circumstances.", "§ 22–3020.51. Definitions.", "§ 22–3020.52. Reporting requirements and privileges.", "§ 22–3020.53. Defense to non-reporting.", "§ 22–3020.54. Penalties.", "§ 22–3020.55. Immunity from liability.", "§ 22–3021. Reputation or opinion evidence of victim’s past sexual behavior inadmissible.", "§ 22–3022. Admissibility of other evidence of victim’s past sexual behavior.", "§ 22–3023. Prompt reporting.", "§ 22–3024. Privilege inapplicable for spouses or domestic partners."], "text": [" “Actor” means a person accused of any offense proscribed under this chapter.", " “Bodily injury” means injury involving loss or impairment of the function of a bodily member, organ, or mental faculty, or physical disfigurement, disease, sickness, or injury involving significant pain.", " “Child” means a person who has not yet attained the age of 16 years.", " “Consent” means words or overt actions indicating a freely given agreement to the sexual act or contact in question. Lack of verbal or physical resistance or submission by the victim, resulting from the use of force, threats, or coercion by the defendant shall not constitute consent.", " “Domestic partner” shall have the same meaning as provided in ", ".", " “Domestic partnership” shall have the same meaning as provided in ", ".", " “Force” means the use or threatened use of a weapon; the use of such physical strength or violence as is sufficient to overcome, restrain, or injure a person; or the use of a threat of harm sufficient to coerce or compel submission by the victim.", " “Minor” means a person who has not yet attained the age of 18 years.", " “Official custody” means:", " “Serious bodily injury” means bodily injury that involves a substantial risk of death, unconsciousness, extreme physical pain, protracted and obvious disfigurement, or protracted loss or impairment of the function of a bodily member, organ, or mental faculty.", " “Sexual act” means:", " “Sexual contact” means the touching with any clothed or unclothed body part or any object, either directly or through the clothing, of the genitalia, anus, groin, breast, inner thigh, or buttocks of any person with an intent to abuse, humiliate, harass, degrade, or arouse or gratify the sexual desire of any person.", " “Significant relationship” includes:", " “Victim” means a person who is alleged to have been subject to any offense set forth in ", ".", " A person shall be imprisoned for any term of years or for life, and in addition, may be fined not more than the amount set forth in ", ", if that person engages in or causes another person to engage in or submit to a sexual act in the following manner:", " The court may impose a prison sentence in excess of 30 years only in accordance with ", " or ", ". For purposes of imprisonment following revocation of release authorized by ", ", the offense defined by this section is a Class A felony.", " By threatening or placing that other person in reasonable fear (other than by threatening or placing that other person in reasonable fear that any person will be subjected to death, bodily injury, or kidnapping); or", " Where the person knows or has reason to know that the other person is:", " By using force against that other person;", " By threatening or placing that other person in reasonable fear that any person will be subjected to death, bodily injury, or kidnapping;", " After rendering that person unconscious; or", " After administering to that person by force or threat of force, or without the knowledge or permission of that other person, a drug, intoxicant, or similar substance that substantially impairs the ability of that other person to appraise or control his or her conduct.", " By threatening or placing that other person in reasonable fear (other than by threatening or placing that other person in reasonable fear that any person will be subjected to death, bodily injury, or kidnapping); or", " Where the person knows or has reason to know that the other person is:", " Whoever, being at least 4 years older than a child or being in a significant relationship with a minor, (1) takes that child or minor to any place for the purpose of committing any offense set forth in §§ ", " to ", " and §§ ", " to ", ", or (2) seduces, entices, allures, convinces, or persuades or attempts to seduce, entice, allure, convince, or persuade a child or minor to engage in a sexual act or contact shall be imprisoned for not more than 5 years or may be fined not more than the amount set forth in ", ", or both.", " Whoever, being at least 4 years older than the purported age of a person who represents himself or herself to be a child, attempts (1) to seduce, entice, allure, convince, or persuade any person who represents himself or herself to be a child to engage in a sexual act or contact, or (2) to entice, allure, convince, or persuade any person who represents himself or herself to be a child to go to any place for the purpose of engaging in a sexual act or contact shall be imprisoned for not more than 5 years or may be fined not more than the amount set forth in ", ", or both.", " No person shall be consecutively sentenced for enticing a child or minor to engage in a sexual act or sexual contact under subsection (a)(2) of this section and engaging in that sexual act or sexual contact with that child or minor, provided, that the enticement occurred closely associated in time with the sexual act or sexual contact.", " Whoever, being 18 years of age or older and more than 4 years older than a child, or being 18 years of age or older and being in a significant relationship with a minor, engages in sexually suggestive conduct with that child or minor shall be imprisoned for not more than 180 days, or fined not more than the amount set forth in ", ", or both.", " For the purposes of this section, the term “sexually suggestive conduct” means engaging in any of the following acts in a way which is intended to cause or reasonably causes the sexual arousal or sexual gratification of any person:", " It is unlawful for a person to arrange to engage in a sexual act or sexual contact with an individual (whether real or fictitious) who is or who is represented to be a child at least 4 years younger than the person, or to arrange for another person to engage in a sexual act or sexual contact with an individual (whether real or fictitious) who is or who is represented to be a child of at least 4 years younger than the person. For the purposes of this section, arranging to engage in a sexual act or sexual contact with an individual who is fictitious shall be unlawful only if the arrangement is done by or with a law enforcement officer.", " A person who violates subsection (a) of this section shall be imprisoned for not more than 5 years, fined not more than the amount set forth in ", ", or both.", " Neither mistake of age nor consent is a defense to a prosecution under §§ ", " to ", ", prosecuted alone or in conjunction with charges under ", " or ", ".", " Marriage or domestic partnership between the defendant and the child or minor at the time of the offense is a defense, which the defendant must establish by a preponderance of the evidence, to a prosecution under §§ ", " to ", ", prosecuted alone or in conjunction with charges under ", " or ", ", involving only the defendant and the child or minor.", " A person is guilty of first degree sexual abuse who purports to provide, in any manner, professional services of a medical, therapeutic, or counseling (whether legal, spiritual, or otherwise) nature, and engages in a sexual act with another person who is a patient or client of the actor, or is otherwise in a professional relationship of trust with the actor; and", " Any person found guilty pursuant to subsection (a) of this section shall be imprisoned for not more than 10 years and, in addition, may be fined not more than the amount set forth in ", ".", " A person is guilty of second degree sexual abuse who purports to provide, in any manner, professional services of a medical, therapeutic, or counseling (whether legal, spiritual, or otherwise) nature, and engages in a sexual contact with another person who is a patient or client of the actor, or is otherwise in a professional relationship of trust with the actor; and", " Any person found guilty pursuant to subsection (a) of this section shall be imprisoned for not more than 5 years and, in addition, may be fined not more than the amount set forth in ", ".", " Consent is not a defense to a prosecution under §§ ", " to ", ", prosecuted alone or in conjunction with charges under ", ".", " That the defendant and victim were married or in a domestic partnership at the time of the offense is a defense, which the defendant must prove by a preponderance of the evidence, to a prosecution under §§ ", " to ", ", prosecuted alone or in conjunction with charges under ", ".", " Any person who is found guilty of an offense under this subchapter may receive a penalty up to 1 1/2 times the maximum penalty prescribed for the particular offense, and may receive a sentence of more than 30 years up to, and including life imprisonment without possibility of release for first degree sexual abuse or first degree child sexual abuse, if any of the following aggravating circumstances exists:", " It is not necessary that the accomplices have been convicted for an increased punishment (or enhanced penalty) to apply under subsection (a)(4) of this section.", " No person who stands convicted of an offense under this subchapter shall be sentenced to increased punishment (or enhanced penalty) by reason of the aggravating factors set forth in subsection (a) of this section, unless prior to trial or before entry of a plea of guilty, the United States Attorney or the Corporation Counsel, as the case may be, files an information with the clerk of the court, and serves a copy of such information on the person or counsel for the person, stating in writing the aggravating factors to be relied upon.", " “Child” means an individual who has not yet attained the age of 16 years.", " “Person” means an individual 18 years of age or older.", " “Police” means the Metropolitan Police Department.", " “Sexual abuse” means any act that is a violation of:", " Any person who knows, or has reasonable cause to believe, that a child is a victim of sexual abuse shall immediately report such knowledge or belief to the police. For the purposes of this subchapter, a call to 911, or a report to the Child and Family Services Agency, shall be deemed a report to the police.", " Any person who is or has been a victim of sexual abuse is not required to report pursuant to subsection (a) of this section if the identity of the alleged perpetrator matches the identity of the victim’s abuser.", " No legally recognized privilege, except for the following, shall apply to this subchapter:", " This section should not be construed as altering the special duty to report by persons specified in ", ".", " Any survivor of domestic violence may use such domestic violence as a defense to his or her failure to report under this subchapter.", " For the purposes of this section, the term “domestic violence” means intimate partner violence, as defined in ", ", and intrafamily violence, as defined in ", ".", " Any person required to make a report under this subchapter who willfully fails to make such a report shall be subject to a civil fine of $300.", " Adjudication of any infraction of this subchapter shall be handled by the Office of Administrative Hearings pursuant to ", ".", " Any person who in good faith makes a report pursuant to this subchapter shall have immunity from liability, civil or criminal, that might otherwise be incurred or imposed with respect to the making of the report or any participation in any judicial proceeding involving the report. In all civil or criminal proceedings concerning the child or resulting from the report, good faith shall be presumed unless rebutted.", " Any person who makes a good-faith report pursuant to this subchapter and, as a result thereof, is discharged from his or her employment or in any other manner discriminated against with respect to compensation, hire, tenure, or terms, conditions, or privileges of employment, may commence a civil action for appropriate relief. If the court finds that the person is an individual who was required to report, who in good faith made a report, and who was discharged or discriminated against as a result, the court may issue an order granting appropriate relief, including reinstatement with back pay. The District may intervene in any action commenced under this subsection.", " Notwithstanding any other provision of law, in a criminal case in which a person is accused of an offense under ", ", reputation or opinion evidence of the past sexual behavior of an alleged victim of such offense is not admissible.", " For the purposes of this subchapter, “past sexual behavior” means sexual behavior other than the sexual behavior with respect to which an offense under ", " is alleged.", " Notwithstanding any other provision of law, in a criminal case in which a person is accused of an offense under ", ", evidence of a victim’s past sexual behavior other than reputation or opinion evidence is also not admissible, unless such evidence other than reputation or opinion evidence is:", " If the person accused of committing an offense under ", " intends to offer under subsection (a) of this section, evidence of specific instances of the alleged victim’s past sexual behavior, the accused shall make a written motion to offer such evidence not later than 15 days before the date on which the trial in which such evidence is to be offered is scheduled to begin, except that the court may allow the motion to be made at a later date, including during trial, if the court determines either that the evidence is newly discovered and could not have been obtained earlier through the exercise of due diligence or that the issue to which such evidence relates has newly arisen in the case. Any motion made under this paragraph, and the accompanying offer of proof, shall be filed under seal and served on all other parties and on the alleged victim."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/30/"},
{"chapter": "Chapter 28. Robbery.", "title": ["§ 22–2801. Robbery.", "§ 22–2802. Attempt to commit robbery.", "§ 22–2803. Carjacking."], "text": [" A person commits the offense of carjacking if, by any means, that person knowingly or recklessly by force or violence, whether against resistance or by sudden or stealthy seizure or snatching, or by putting in fear, or attempts to do so, shall take from another person immediate actual possession of a person’s motor vehicle.", " A person commits the offense of armed carjacking if that person, while armed with or having readily available any pistol or other firearm (or imitation thereof ) or other dangerous or deadly weapon (including a sawed-off shotgun, shotgun, machine gun, rifle, dirk, bowie knife, butcher knife, switch-blade knife, razor, blackjack, billy, or metallic or other false knuckles), commits or attempts to commit the offense of carjacking.", " Notwithstanding any other provision of law, a person convicted of carjacking shall not be released from prison prior to the expiration of 7 years from the date of the commencement of the sentence, and a person convicted of armed carjacking shall not be released from prison prior to the expiration of 15 years from the date of the commencement of the sentence."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/28/"},
{"chapter": "Chapter 27A. Protest Targeting a Residence.", "title": ["§ 22–2751. Definitions.", "§ 22–2752. Engaging in an unlawful protest targeting a residence."], "text": [" “Demonstration” means marching, congregating, standing, parading, demonstrating, or patrolling by one or more persons, with or without signs, for the purpose of persuading one or more individuals, or the public, or to protest some action, attitude, or belief.", " “Mask” means a covering for the face or part of the face whereby the identity of the wearer is disguised. The term “Mask” shall not include clothing worn for the purpose of providing protection from the elements nor clothing worn as a religious covering.", " “Residence” means a building or structure, but not a hotel, used or designed to be used, in whole or in part, as a living or a sleeping place by one or more human beings.", " It is unlawful for a person, as part of a group of 3 or more persons, to target a residence for purposes of a demonstration:", " A person who violates this section shall be guilty of a misdemeanor and, upon conviction, fined not more than the amount set forth in ", " or imprisoned for not more than 90 days."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/27A/"},
{"chapter": "Chapter 27. Prostitution; Pandering.", "titles": ["§ 22–2701. Engaging in prostitution or soliciting for prostitution.", "§ 22–2701.01. Definitions.", "§ 22–2702. Inmate or frequenter of house of ill fame. [Repealed]", "§ 22–2703. Suspension of sentence; conditions; enforcement.", "§ 22–2704. Abducting or enticing child from his or her home for purposes of prostitution; harboring such child.", "§ 22–2705. Pandering; inducing or compelling an individual to engage in prostitution.", "§ 22–2706. Compelling an individual to live life of prostitution against his or her will.", "§ 22–2707. Procuring; receiving money or other valuable thing for arranging assignation.", "§ 22–2708. Causing spouse or domestic partner to live in prostitution.", "§ 22–2709. Detaining an individual in disorderly house for debt there contracted.", "§ 22–2710. Procuring for house of prostitution.", "§ 22–2711. Procuring for third persons.", "§ 22–2712. Operating house of prostitution.", "§ 22–2713. Premises occupied for lewdness, assignation, or prostitution declared nuisance.", "§ 22–2714. Abatement of nuisance under § 22-2713 by injunction — Temporary injunction.", "§ 22–2715. Abatement of nuisance under § 22-2713 by injunction — Trial; dismissal of complaint; prosecution; costs.", "§ 22–2716. Violation of injunction granted under § 22-2714.", "§ 22–2717. Order of abatement; sale of property; entry of closed premises punishable as contempt.", "§ 22–2718. Disposition of proceeds of sale.", "§ 22–2719. Bond for abatement; order for delivery of premises; effect of release.", "§ 22–2720. Tax for maintaining such nuisance.", "§ 22–2721. Granting immunity to witnesses. [Repealed]", "§ 22–2722. Keeping bawdy or disorderly houses.", "§ 22–2723. Property subject to seizure and forfeiture.", "§ 22–2724. Impoundment.", "§ 22–2725. Anti-Prostitution Vehicle Impoundment Proceeds Fund.", "§ 22–2731. Prostitution free zone; penalty. [Repealed]"], "text": [" Except as provided in subsection (d) of this section, it is unlawful for any person to engage in prostitution or to solicit for prostitution.", " Except as provided in paragraph (2) of this subsection, a person convicted of prostitution or soliciting for prostitution shall be:", " For the purposes of this section, a person shall be considered as having 2 or more prior convictions for prostitution or soliciting for prostitution if he or she has been convicted on at least 2 occasions of violations of:", " A child who engages in or offers to engage in a sexual act or sexual contact in return for receiving anything of value shall be immune from prosecution for a violation of subsection (a) of this section.", " “Arranging for prostitution” means any act to procure or attempt to procure or otherwise arrange for the purpose of prostitution, regardless of whether such procurement or arrangement occurred or anything of value was given or received.", " “Domestic partner” shall have the same meaning as provided in ", ".", " “Prostitution” means a sexual act or contact with another person in return for giving or receiving anything of value.", " “Prostitution-related offenses” means those crimes and offenses defined in this subchapter.", " “Sexual act” shall have the same meaning as provided in ", ".", " “Sexual contact” shall have the same meaning as provided in ", ".", " “Solicit for prostitution” means to invite, entice, offer, persuade, or agree to engage in prostitution or address for the purpose of inviting, enticing, offering, persuading, or agreeing to engage in prostitution.", " It is unlawful for any person, for purposes of prostitution, to:", " A person who violates subsection (a) of this section shall be guilty of a felony and, upon conviction, shall be punished by imprisonment for not more than 20 years, or by a fine of not more than the amount set forth in ", ", or both.", " It is unlawful for any person, within the District of Columbia to:", " It is unlawful for any parent, guardian, or other person having legal custody of the person of an individual, to consent to the individual’s being taken, detained, or used by any person, for the purpose of prostitution or a sexual act or sexual contact.", " Except as provided in paragraph (2) of this subsection, a person who violates subsection (a) or (b) of this section shall be guilty of a felony and, upon conviction, shall be punished by imprisonment for not more than 5 years, or by a fine of not more than the amount set forth in ", ", or both.", " It is unlawful for any person, within the District of Columbia, by threats or duress, to detain any individual against such individual’s will, for the purpose of prostitution or a sexual act or sexual contact, or to compel any individual against such individual’s will, to reside with him or her or with any other person for the purposes of prostitution or a sexual act or sexual contact.", " Except as provided in paragraph (2) of this subsection, a person who violates subsection (a) of this section shall be guilty of a felony and, upon conviction, shall be punished by imprisonment for not more than 15 years or by a fine of not more than the amount set forth in ", ", or both.", " It is unlawful for any person, within the District of Columbia, to receive any money or other valuable thing for or on account of arranging for or causing any individual to engage in prostitution or a sexual act or contact.", " Except as provided in paragraph (2) of this subsection, a person who violates subsection (a) of this section shall be guilty of a felony and, upon conviction, shall be punished by imprisonment for not more than 5 years or by a fine of not more than the amount set forth in ", ", or both.", " Whoever shall erect, establish, continue, maintain, use, own, occupy, or release any building, erection, or place used for the purpose of lewdness, assignation, or prostitution in the District of Columbia is guilty of a nuisance, and the building, erection, or place, or the ground itself in or upon which such lewdness, assignation, or prostitution is conducted, permitted, or carried on, continued, or exists, and the furniture, fixtures, musical instruments, and contents are also declared a nuisance, and shall be enjoined and abated as hereinafter provided.", " Whoever shall erect, establish, continue, maintain, use, own, occupy, or release any building, erection, or place which is resorted to by persons using controlled substances in violation of ", ", for the purpose of using any of these substances or for the purpose of keeping or selling any of these substances in violation of ", ", is guilty of a nuisance, and the building, erection, or place, or the ground itself in or upon which such activity is conducted, permitted, or carried on, continued, or exists, and the furniture, fixtures, and contents thereof, are also declared a nuisance and disorderly house, and shall be enjoined and abated as hereinafter provided.", " The following are subject to forfeiture:", " All seizures and forfeitures of property under this section shall be pursuant to the standards and procedures set forth in ", ".", " Any vehicle used in furtherance of a violation of a prostitution-related offense shall be subject to impoundment pursuant to this section.", " Whenever a police officer has probable cause to believe that a vehicle is being used in furtherance of a violation of a prostitution-related offense, and an arrest is made for that violation, the police officer, other member of the Metropolitan Police Department, or duly authorized agent thereof shall:", " The notices to be given pursuant to this section shall be provided by hand delivery at the time of the seizure and impoundment of the vehicle to the person in control of the vehicle or to the owner of record of the vehicle. If the owner of record of the vehicle is not available to receive such notice at the time of the seizure, the notice shall be mailed by first class mail, no later than 5 days after the vehicle is received at an impoundment or storage facility, to the last known address of the owner or owners of record of the vehicle, as that information is indicated in the records of the Department of Motor Vehicles or in the records of the appropriate agency of the jurisdiction where the vehicle is registered.", " An owner, or a person duly authorized by an owner, shall, upon proof of same, be permitted to repossess or secure the release of the immobilized or impounded vehicle at any time (subject to administrative availability) by paying to the District government, as directed by the Department of Public Works, an administrative civil penalty of $150, a booting fee, if applicable, all outstanding fines and penalties for infractions for which liability has been admitted, deemed admitted, or sustained after hearing, and all applicable towing and storage costs for impounded vehicles as provided by ", ". Payment of such fees shall not be admissible as evidence of guilt in any criminal proceeding.", " An owner, or person duly authorized by an owner, shall be entitled to refund of the administrative civil penalty, booting fee, and 2 days’ towing and storage costs by showing that the prosecutor dropped the underlying criminal charges (except for instances of nolle prosequi or because the defendant completed a diversion program), that the Superior Court of the District of Columbia dismissed the case after consideration of the merits, or that the case resulted in a finding of not guilty on all prostitution-related charges, or by providing a police report demonstrating that the vehicle was stolen at the time that it was subject to seizure and impoundment. If the vehicle had been stolen at the time of seizure and impoundment, a refund of all towing and storage costs shall be made.", " An owner, or person duly authorized by an owner, shall be entitled to a due process hearing regarding the seizure of the vehicle.", " Vehicles seized and impounded under this section shall not be subject to replevin, but shall be deemed to be in the custody of the Mayor.", " Vehicles that remain unclaimed for 30 days may be disposed of pursuant to §§ ", ", (d), (e), and (f), ", ", ", ", and ", "; provided, that if the owner wants to claim the vehicle before it is auctioned, the owner must pay the administrative civil penalty imposed by subsection (d) of this section in addition to the amounts required in ", ".", " The Attorney General for the District of Columbia, or his or her assistants, shall represent the District of Columbia in all proceedings under this section.", " The Mayor shall issue rules setting forth the process by which a refund shall be obtained timely pursuant to subsection (e) of this section. Until such rules are published in the District of Columbia Register, this section shall not be enforceable.", " There is established as a nonlapsing fund the Anti-Prostitution Vehicle Impoundment Proceeds Fund (“Fund”), which shall be used for the purpose set forth in subsection (b) of this section. All funds collected from the assessment of civil penalties, booting, towing, impoundment, and storage fees pursuant to ", ", and any and all interest earned on those funds, shall be deposited into the Fund, and shall not revert to the unrestricted fund balance of the General Fund of the District of Columbia at the end of a fiscal year, or at any other time, but shall be continually available for the uses and purposes set forth in subsection (b) of this section with regard to fiscal year limitation, subject to authorization by Congress.", " The Fund shall be used solely to fund expenses directly related to the booting, towing, and impoundment of vehicles used in furtherance of prostitution-related activities, in violation of a prostitution-related offense.", " The Mayor shall submit to the Council, as part of the annual budget, a requested appropriation for expenditures from the Fund."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/27/"},
{"chapter": "Chapter 26. Prison Misconduct.", "titles": ["§ 22–2601. Escape from institution or officer.", "§ 22–2602. Misprisions by officers or employees of jail. [Repealed]", "§ 22–2603.01. Definitions.", "§ 22–2603.02. Unlawful possession of contraband.", "§ 22–2603.03. Penalties.", "§ 22–2603.04. Detainment power."], "text": [" No person shall escape or attempt to escape from:", " Any person who violates subsection (a) of this section shall be fined not more than the amount set forth in ", " or imprisoned not more than 5 years, or both, said sentence to begin, if the person is an escaped prisoner, upon the expiration of the original sentence or disposition for the offense for which he or she was confined, committed, or in custody at the time of his or her escape.", " “Cellular telephone or other portable communication device and accessories thereto” means any device carried, worn, or stored that is designed, intended, or readily converted to create, receive or transmit oral or written messages or visual images, access or store data, or connect electronically to the Internet, or any other electronic device that enables communication in any form. The term “cellular telephone or other portable communication device and accessories thereto” includes portable 2-way pagers, hand-held radios, cellular telephones, Blackberry-type devices, personal digital assistants or PDAs, computers, cameras, and any components of these devices. The term “cellular telephone or other portable communication device and accessories thereto” also includes any new technology that is developed for communication purposes and includes accessories that enable or facilitate the use of the cellular telephone or other portable communication device.", " “Class A Contraband” means:", " “Class B Contraband” means:", " “Class C Contraband” means any article or thing which a person confined in a penal institution or secure juvenile residential facility is prohibited from obtaining or possessing by rule. The Mayor, pursuant to ", " [", " et seq.], shall promulgate by rulemaking the articles or things that are Class C contraband. The rules shall be posted in the facility to give notice of the prohibited articles or things.", " “Grounds” means the area of land occupied by the penal institution or secure juvenile residential facility and its yard and outbuildings, with a clearly identified perimeter.", " “Penal institution” means any penitentiary, prison, jail, or secure facility owned, operated, or under the control of the Department of Corrections, whether located within the District of Columbia or elsewhere.", " “Secure juvenile residential facility” means a locked residential facility providing custody, supervision, and care for one or more juveniles that is owned, operated, or under the control of the Department of Youth Rehabilitation Services, excluding residential treatment facilities and accredited hospitals.", " Except as authorized by law, the Mayor, the Director of the Department of Corrections, or the Director of the Department of Youth Rehabilitation Services, it is unlawful to:", " It is unlawful for an inmate, or securely detained juvenile, to possess Class A, Class B, or Class C contraband, regardless of the intent with which he or she possesses it.", " It is unlawful for an employee of the Department of Corrections or Department of Youth Rehabilitation Services who becomes aware of any violation of this section to fail to report such knowledge as required by department regulations, policies, or procedures.", " Any item listed as contraband is not deemed to be contraband when issued by a penal institution or secure juvenile residential facility to an employee and the item is being used in the performance of the employee’s duties within the penal institution or secure juvenile residential facility.", " It is not unlawful for an attorney, or representative or agent of an attorney, during the course of a visit for the purpose of legal representation of the inmate or securely detained juvenile, to:", " It is not unlawful for a person to possess or carry a controlled substance that is prescribed to that person and that is medically necessary for that person to carry.", " A person convicted of violating this subchapter with regard to Class A contraband shall be imprisoned for not more than 10 years, fined not more than the amount set forth in ", ", or both.", " A person convicted of violating this subchapter with regard to Class B contraband shall be imprisoned for not more than 2 years, fined not more than the amount set forth in ", ", or both.", " A person convicted of violating ", " shall be imprisoned for not more than 1 year, fined not more than the amount set forth in ", ", or both.", " Any term of imprisonment imposed on an inmate or prisoner pursuant to this section shall be:", " The violation of this subchapter with regard to Class C contraband shall be an administrative penalty prescribed by the Department of Corrections or the Department of Youth Rehabilitation Services."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/26/"},
{"chapter": "Chapter 25A. Presence in a Motor Vehicle Containing a Firearm.", "title": ["§ 22–2511. Presence in a motor vehicle containing a firearm. [Repealed]"], "text": [], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/25A/"},
{"chapter": "Chapter 25. Possession of Implements of Crime.", "title": ["§ 22–2501. Possession of implements of crime; penalty."], "text": [], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/25/"},
{"chapter": "Chapter 24. Perjury; Related Offenses.", "title": ["§ 22–2401. Perjury; subornation of perjury. [Repealed]", "§ 22–2402. Perjury.", "§ 22–2403. Subornation of perjury.", "§ 22–2404. False swearing.", "§ 22–2405. False statements."], "text": [" A person commits the offense of perjury if:", " Any person convicted of perjury shall be fined not more than the amount set forth in ", " or imprisoned for not more than 10 years, or both.", " A person commits the offense of false swearing if under oath or affirmation he or she wilfully makes a false statement, in writing, that is in fact material and the statement is one which is required by law to be sworn or affirmed before a notary public or other person authorized to administer oaths.", " Any person convicted of false swearing shall be fined not more than the amount set forth in ", " or imprisoned for not more than 3 years, or both.", " A person commits the offense of making false statements if that person wilfully makes a false statement that is in fact material, in writing, directly or indirectly, to any instrumentality of the District of Columbia government, under circumstances in which the statement could reasonably be expected to be relied upon as true; provided, that the writing indicates that the making of a false statement is punishable by criminal penalties or if that person makes an affirmation by signing an entity filing or other document under Title 29 of the District of Columbia Official Code, knowing that the facts stated in the filing are not true in any material respect or if that person makes an affirmation by signing a declaration under ", ", knowing that the facts stated in the filing are not true in any material respect;", " Any person convicted of making false statements shall be fined not more than the amount set forth in ", " or imprisoned for not more than 180 days, or both. A violation of this section shall be prosecuted by the Attorney General for the District of Columbia or one of the Attorney General’s assistants."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/24/"},
{"chapter": "Chapter 23. Panhandling.", "title": ["§ 22–2301. Definitions.", "§ 22–2302. Prohibited acts.", "§ 22–2303. Permitted activity.", "§ 22–2304. Penalties.", "§ 22–2305. Conduct of prosecutions.", "§ 22–2306. Disclosure."], "text": [" “Aggressive manner” means:", " “Ask, beg, or solicit alms” includes the spoken, written, or printed word or such other act conducted for the purpose of obtaining an immediate donation of money or thing of value.", " No person may ask, beg, or solicit alms, including money and other things of value, in an aggressive manner in any place open to the general public, including sidewalks, streets, alleys, driveways, parking lots, parks, plazas, buildings, doorways and entrances to buildings, and gasoline service stations, and the grounds enclosing buildings.", " No person may ask, beg, or solicit alms in any public transportation vehicle; or at any bus, train, or subway station or stop.", " No person may ask, beg, or solicit alms within 10 feet of any automatic teller machine (ATM).", " No person may ask, beg, or solicit alms from any operator or occupant of a motor vehicle that is in traffic on a public street.", " No person may ask, beg, or solicit alms from any operator or occupant of a motor vehicle on a public street in exchange for blocking, occupying, or reserving a public parking space, or directing the operator or occupant to a public parking space.", " No person may ask, beg, or solicit alms in exchange for cleaning motor vehicle windows while the vehicle is in traffic on a public street.", " No person may ask, beg, or solicit alms in exchange for protecting, watching, washing, cleaning, repairing, or painting a motor vehicle or bicycle while it is parked on a public street.", " No person may ask, beg, or solicit alms on private property or residential property, without permission from the owner or occupant.", " Any person convicted of violating any provision of ", " shall be fined not more than the amount set forth in ", " or be imprisoned not more than 90 days or both.", " In lieu of or in addition to the penalty provided in subsection (a) of this section, a person convicted of violating any provision of ", " may be required to perform community service as provided in ", "."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/23/"},
{"chapter": "Chapter 22. Obscenity.", "title": ["§ 22–2201. Certain obscene activities and conduct declared unlawful; definitions; penalties; affirmative defenses; exception."], "text": [" It shall be unlawful in the District of Columbia for a person knowingly:", " It shall be unlawful in the District of Columbia for any person knowingly:", " It shall be an affirmative defense to a charge of violating subsection (a) or (b) of this section that the dissemination was to institutions or individuals having scientific, educational, or other special justification for possession of such material.", " Nothing in this section shall apply to a licensee under the Communications Act of 1934 (47 U.S.C. § 151 et seq.) while engaged in activities regulated pursuant to such Act.", " A person convicted of violating subsection (a) or (b) of this section shall for the 1st offense be fined not more than the amount set forth in ", " or imprisoned not more than 180 days, or both. A person convicted of a 2nd or subsequent offense under subsection (a) or (b) of this section shall be fined not less than $1,000 and not more than the amount set forth in ", " or imprisoned not less than 6 months or more than 3 years, or both."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/22/"},
{"chapter": "Chapter 21. Murder; Manslaughter.", "title": ["§ 22–2101. Murder in the first degree — Purposeful killing; killing while perpetrating certain crimes.", "§ 22–2102. Murder in the first degree — Placing obstructions upon or displacement of railroads.", "§ 22–2103. Murder in the second degree.", "§ 22–2104. Penalty for murder in first and second degrees.", "§ 22–2104.01. Sentencing procedure for murder in the first degree.", "§ 22–2105. Penalty for manslaughter.", "§ 22–2106. Murder of law enforcement officer.", "§ 22–2107. Penalty for solicitation of murder or other crime of violence."], "text": [" The punishment for murder in the first degree shall be not less than 30 years nor more than life imprisonment without release, except that the court may impose a prison sentence in excess of 60 years only in accordance with ", " or ", ". The prosecution shall notify the defendant in writing at least 30 days prior to trial that it intends to seek a sentence of life imprisonment without release as provided in ", "; provided that, no person who was less than 18 years of age at the time the murder was committed shall be sentenced to life imprisonment without release.", " Notwithstanding any other provision of law, a person convicted of murder in the first degree shall not be released from prison prior to the expiration of 30 years from the date of the commencement of the sentence.", " Whoever is guilty of murder in the second degree shall be sentenced to a period of incarceration of not more than life, except that the court may impose a prison sentence in excess of 40 years only in accordance with ", ".", " For purposes of imprisonment following revocation of release authorized by ", ", murder in the first degree and murder in the second degree are Class A felonies.", " In addition to any other penalty provided under this section, a person may be fined an amount not more than the amount set forth in ", ".", " If a defendant is convicted of murder in the first degree, and if the prosecution has given the notice required under ", ", a separate sentencing procedure shall be conducted as soon as practicable after the trial has been completed to determine whether to impose a sentence of more than 60 years up to, and including, life imprisonment without possibility of release.", " In determining the sentence, a finding shall be made whether, beyond a reasonable doubt, any of the following aggravating circumstances exist:", " The finding shall state in writing whether, beyond a reasonable doubt, 1 or more of the aggravating circumstances exist. If 1 or more aggravating circumstances exist, a sentence of more than 60 years up to, and including, life imprisonment without release may be imposed.", " If the trial court is reversed on appeal because of error only in the separate sentencing procedure, any new proceeding before the trial court shall pertain only to the issue of sentencing.", " Whoever, with deliberate and premeditated malice, and with knowledge or reason to know that the victim is a law enforcement officer or public safety employee, kills any law enforcement officer or public safety employee engaged in, or on account of, the performance of such officer’s or employee’s official duties, is guilty of murder of a law enforcement officer or public safety employee, and shall be sentenced to life without the possibility of release. It shall not be a defense to this charge that the victim was acting unlawfully by seizing or attempting to seize the defendant or another person.", " For the purposes of subsection (a) of this section, the term:", " In addition to any other penalty provided under this section, a person may be fined an amount not more than the amount set forth in ", ".", " Whoever is guilty of soliciting a murder, whether or not such murder occurs, shall be sentenced to a period of imprisonment not exceeding 20 years, a fine not more than the amount set forth in ", ", or both.", " Whoever is guilty of soliciting a crime of violence as defined by ", ", whether or not such crime occurs, shall be sentenced to a period of imprisonment not exceeding 10 years, a fine of not more than the amount set forth in ", ", or both."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/21/"},
{"chapter": "Chapter 20. Kidnapping.", "title": ["§ 22–2001. Definition and penalty; conspiracy."], "text": [], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/20/"},
{"chapter": "Chapter 19A. Interfering with Reports of Crime.", "title": ["§ 22–1931. Obstructing, preventing, or interfering with reports to or requests for assistance from law enforcement agencies, medical providers, or child welfare agencies."], "text": [" It shall be unlawful for a person to knowingly disconnect, damage, disable, temporarily or permanently remove, or use physical force or intimidation to block access to any telephone, radio, computer, or other electronic communication device with a purpose to obstruct, prevent, or interfere with:", " A person who violates subsection (a) of this section shall be fined not more than the amount set forth in ", " or imprisoned not more than 180 days, or both."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/19A/"},
{"chapter": "Chapter 19. Incest.", "title": ["§ 22–1901. Definition and penalty."], "text": [], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/19/"},
{"chapter": "Chapter 18A. Human Trafficking.", "title": ["§ 22–1831. Definitions.", "§ 22–1832. Forced labor.", "§ 22–1833. Trafficking in labor or commercial sex acts.", "§ 22–1834. Sex trafficking of children.", "§ 22–1835. Unlawful conduct with respect to documents in furtherance of human trafficking.", "§ 22–1836. Benefitting financially from human trafficking.", "§ 22–1837. Penalties.", "§ 22–1838. Forfeiture.", "§ 22–1839. Reputation or opinion evidence.", "§ 22–1840. Civil action.", "§ 22–1841. Data collection and dissemination.", "§ 22–1842. Training program.", "§ 22–1843. Public posting of human trafficking hotline.", "§ 22–1844. Motion to vacate conviction or expunge criminal records for victims of trafficking.", "§ 22–1845. Review by Court.", "§ 22–1846. Grants and denials of motion.", "§ 22–1847. Appeals."], "text": [" “Abuse or threatened abuse of law or legal process” means the use or threatened use of law or legal process, whether administrative, civil, or criminal, in any manner or for any purpose for which the law was not designed, to exert pressure on another person to cause that person to take some action or refrain from taking some action.", " “Business” means any corporation, partnership, sole proprietorship, firm, enterprise, franchise, association, organization, holding company, joint stock, trust, and any legal entity through which business is conducted.", " “Coercion” means any one of, or a combination of, the following:", " “Commercial sex act” means any sexual act or sexual contact on account of which or for which anything of value is given to, promised to, or received by any person. The term “commercial sex act” includes a violation of ", ", ", ", §§ ", " to ", ", §§ ", " to ", ", and ", ".", " \"Court\" means the Superior Court of the District of Columbia.", " “Debt bondage” means the status or condition of a person who provides labor, services, or commercial sex acts, for a real or alleged debt, where:", " \"Eligible offense\" means any criminal offense under the District of Columbia Official Code, except an ineligible offense.", " \"Ineligible offense\" means:", " “Labor” means work that has economic or financial value.", " “Serious harm” means any harm, whether physical or nonphysical, including psychological, financial, or reputational harm, that is sufficiently serious, under all the surrounding circumstances, to compel a reasonable person of the same background and in the same circumstances to perform or to continue to perform labor, services, or commercial sex acts to avoid incurring that harm.", " “Services” means legal or illegal duties or work done for another, whether or not compensated.", " “Sexual act” shall have the same meaning as provided in ", ".", " “Sexual contact” shall have the same meaning as provided in ", ".", " “Venture” means any group of 2 or more individuals associated in fact, whether or not a legal entity.", " \"Victim of trafficking\" means:", " It is unlawful for an individual or a business knowingly to use coercion to cause a person to provide labor or services.", " It is unlawful for an individual or a business knowingly to place or keep any person in debt bondage.", " Coercion will be used or is being used to cause the person to provide labor or services or to engage in a commercial sex act; or", " The person is being placed or will be placed or kept in debt bondage.", " It is unlawful for an individual or a business knowingly to recruit, entice, harbor, transport, provide, obtain, or maintain by any means a person who will be caused as a result to engage in a commercial sex act knowing or in reckless disregard of the fact that the person has not attained the age of 18 years.", " In a prosecution under subsection (a) of this section in which the defendant had a reasonable opportunity to observe the person recruited, enticed, harbored, transported, provided, obtained, or maintained, the government need not prove that the defendant knew that the person had not attained the age of 18 years.", " Except as provided in paragraph (2) of this subsection, whoever violates ", ", ", ", or ", " shall be fined not more than the amount set forth in ", ", imprisoned for not more than 20 years, or both.", " Whoever violates ", " shall be fined not more than the amount set forth in ", ", imprisoned for not more than 5 years, or both.", " Whoever violates ", " shall be fined or imprisoned up to the maximum fine or term of imprisonment for a violation of each referenced section.", " Whoever attempts to violate ", ", ", ", ", ", ", " or ", " shall be fined not more than 1/2 the maximum fine otherwise authorized for the offense, imprisoned for not more than 1/2 the maximum term otherwise authorized for the offense, or both.", " No person shall be sentenced consecutively for violations of §§ ", " and ", " for an offense arising out of the same incident.", " In imposing sentence on any individual or business convicted of a violation of this chapter, the court shall order, in addition to any sentence imposed, that the individual or business shall forfeit to the District of Columbia:", " The following shall be subject to forfeiture to the District of Columbia and no property right shall exist in them:", " An individual who is a victim of an offense prohibited by ", ", ", ", ", ", ", " or ", " may bring a civil action in the Superior Court of the District of Columbia. The court may award actual damages, compensatory damages, punitive damages, injunctive relief, and any other appropriate relief. A prevailing plaintiff shall also be awarded attorney’s fees and costs. Treble damages shall be awarded on proof of actual damages where a defendant’s acts were willful and malicious.", " Any statute of limitation imposed for the filing of a civil suit under this section shall not begin to run until the plaintiff knew, or reasonably should have known, of any act constituting a violation of ", ", ", ", ", ", ", " or ", ", or until a minor plaintiff has reached the age of majority, whichever is later.", " If a person entitled to sue is imprisoned, insane, or similarly incapacitated at the time the cause of action accrues, so that it is impossible or impracticable for him or her to bring an action, then the time of the incapacity is not part of the time limited for the commencement of the action.", " A defendant is estopped to assert a defense of the statute of limitations when the expiration of the statute is due to conduct by the defendant inducing the plaintiff to delay the filing of the action.", " For the purposes of this section, the term:", " The District, in cooperation with appropriate criminal justice agencies, shall collect statistical data related to human trafficking. The data shall include:", " The Mayor shall elicit the cooperation and assistance of other government agencies, and non-government organizations as appropriate, to assist in the data collection required under subsection (b) of this section. The appropriate authorities in each agency shall make best efforts to collect information relevant to tracking progress on human trafficking.", " The District shall publish, periodically and not less than once every 36 months, a report of all current statistical data described in subsection (b) of this section.", " Repealed.", " The Metropolitan Police Department (“MPD”), the Child and Family Services Agency (“CFSA”), and the Department of Youth Rehabilitation Services (“DYRS”) shall provide training on human trafficking to:", " The training shall be a minimum of 4 hours and shall include:", " MPD, CFSA, and DYRS shall consult with community organizations that provide training, resources, advocacy, or services to victims of human trafficking for assistance in developing and presenting training on human trafficking.", " A person convicted of an eligible offense may apply by motion to the Superior Court for the District of Columbia to vacate the judgment of conviction and expunge all records identifying the movant as having been arrested, prosecuted, or convicted of the offense if the conduct of the person that resulted in the conviction was a direct result of the person having been a victim of trafficking.", " A person arrested but not prosecuted, or whose prosecution was terminated without conviction, for an eligible offense or an ineligible offense, may apply by motion to the Superior Court for the District of Columbia to expunge all records identifying the movant as having been arrested or prosecuted for the offense if the conduct of the person that resulted in the arrest or prosecution was a direct result of the person having been a victim of trafficking.", " A motion filed under this section shall:", " A movant may file a motion under this section regardless of whether any other person, such as the person who made the movant a victim of trafficking, has been arrested, prosecuted, or convicted for an offense.", " A person may file a motion under this section only after:", " At the request of a movant or prosecutor, the Court may place any record or part of a proceeding related to a motion filed under this section under seal while the motion is pending.", " A person may file a motion under this section for an arrest, prosecution, or conviction that occurred before, on, or after April 5, 2019.", " If it plainly appears from the face of the motion, any accompanying exhibits, affidavits, and documents, and the record of any prior proceedings, that the movant is not eligible for relief or is not entitled to relief, the Court may dismiss or deny the motion.", " If the motion is not dismissed or denied after initial review, the Court shall order the prosecutor to file a response to the motion. Within 90 days after the Court's order for a response, the prosecutor shall file a response indicating whether the prosecutor supports or opposes the motion.", " The Court may hold a hearing on any motion filed under ", "; provided, that if the prosecutor opposes a motion filed under ", ", the Court shall hold a hearing on the motion within 90 days after the filing of the opposition.", " The Court shall grant a motion filed under ", ", if the movant establishes, by clear and convincing evidence that:", " The Court shall grant a motion filed under ", ", if the movant establishes, by clear and convincing evidence that:", " There shall be a rebuttable presumption that a movant is a victim of trafficking if the movant includes in the motion a copy of an official record from a federal, state, tribal, or local proceeding finding that the movant was a victim of trafficking, including a Certification Letter or Eligibility Letter from the U.S. Department of Health and Human Services.", " The Court may grant a motion under this section based solely on an affidavit or sworn testimony of the movant.", " If the Court denies a motion filed under ", ", the Court shall state the reasons for denial in writing.", " If the Court grants a motion filed under ", ", the Court shall vacate the conviction, dismiss the relevant count with prejudice, and, except as provided in subsection (d) of this section, enter an order requiring the Court, the prosecutor, any relevant law enforcement agency, and any pretrial, corrections, or community supervision agency to expunge all records identifying the movant as having been arrested, prosecuted, or convicted of the offenses specified in the Court's order.", " If the Court grants a motion filed under ", ", the Court shall, except as provided in subsection (d) of this section, enter an order requiring the Court, the prosecutor, any relevant law enforcement agency, and any pretrial, corrections, or community supervision agency to expunge all records identifying the movant as having been arrested or prosecuted for the offenses specified in the Court's order.", " At any time before the Court grants a motion under subsection (b) or (c) of this section, a movant may file a request that, if the movant's motion is granted, the order granting the motion filed under ", ", in lieu of requiring the expungement of all records identifying the movant as having been arrested, prosecuted, or convicted of the offenses specified in the Court's order, require the Court, the prosecutor, any relevant law enforcement agency, and any pretrial, corrections, or community supervision agency to seal all records identifying the movant as having been arrested, prosecuted, or convicted of the offenses specified in the Court's order.", " Within one year after the Court's grant of a motion under subsection (b) or (c) of this section, or, if the movant filed a request pursuant to subsection (d)(1) of this section, within one year after the filing of a request pursuant to subsection (d)(2) of this section, the Clerk of the Court, the prosecutor, any relevant law enforcement agency, and any pretrial services, corrections, or community supervision agency shall certify to the Court that to the best of its knowledge and belief, all records identifying the movant as having been arrested, prosecuted, or convicted of the offenses specified in the Court's order have been expunged from its records.", " In a case involving co-defendants in which the Court orders the movant's records expunged or sealed, the Court may order that only those records, or portions thereof, relating solely to the movant be expunged or sealed.", " In a case where a movant was arrested, prosecuted, or convicted of an offense other than the offense for which a Court orders the movant's records expunged or sealed, the Court may order that only those records, or portions thereof, relating solely to the offense that is the subject of the Court's order be expunged or sealed.", " The Court shall not order the redaction of the movant's name from any published opinion of the trial or appellate courts that refer to the movant.", " The effect of relief pursuant to this section shall be to restore the movant, in the contemplation of the law, to the status he or she occupied before being arrested, prosecuted, or convicted. No person as to whom such relief has been granted shall be held thereafter under any provision of law to be guilty of perjury or otherwise giving a false statement by reason of failure to recite or acknowledge his or her arrest, charge, trial, or conviction in response to any inquiry made of him or her for any purpose.", " A copy of an order issued under this section and the certifications filed with the Court under subsection (e) of this section shall be provided to the movant or his or her counsel."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/18A/"},
{"chapter": "Chapter 18. General Offenses.", "title": ["§ 22–1801. “Writing” and “paper” defined.", "§ 22–1802. “Anything of value” defined.", "§ 22–1803. Attempts to commit crime.", "§ 22–1804. Second conviction.", "§ 22–1804a. Penalty for felony after at least 2 prior felony convictions.", "§ 22–1805. Persons advising, inciting, or conniving at criminal offense to be charged as principals.", "§ 22–1805a. Conspiracy to commit crime.", "§ 22–1806. Accessories after the fact.", "§ 22–1807. Punishment for offenses not covered by provisions of Code.", "§ 22–1808. Offenses committed beyond District.", "§ 22–1809. Prosecutions.", "§ 22–1810. Threatening to kidnap or injure a person or damage his property."], "text": [" If any person: (1) is convicted of a criminal offense (other than a non-moving traffic offense) under a law applicable exclusively to the District of Columbia; and (2) was previously convicted of a criminal offense under any law of the United States or of a state or territory of the United States which offense, at the time of the conviction referred to in clause (1) of this subsection, is the same as, constitutes, or necessarily includes, the offense referred to in that clause, such person may be sentenced to pay a fine in an amount not more than one and one-half times the maximum fine prescribed for the conviction referred to in clause (1) of this subsection and sentenced to imprisonment for a term not more than one and one-half times the maximum term of imprisonment prescribed for that conviction. If such person was previously convicted more than once of an offense described in clause (2) of this subsection, such person may be sentenced to pay a fine in an amount not more than 3 times the maximum fine prescribed for the conviction referred to in clause (1) of this subsection and sentenced to imprisonment for a term not more than 3 times the maximum term of imprisonment prescribed for that conviction. No conviction with respect to which a person has been pardoned on the ground of innocence shall be taken into account in applying this section.", " This section shall not apply in the event of conflict with any other provision of law which provides an increased penalty for a specific offense by reason of a prior conviction of the same or any other offense.", " If a person is convicted in the District of Columbia of a felony, having previously been convicted of 2 prior felonies not committed on the same occasion, the court may, in lieu of any sentence authorized, impose such greater term of imprisonment as it deems necessary, up to, and including, 30 years.", " For the purposes of this section:", " A person shall be considered as having been convicted of 2 felonies if the person has been convicted of a felony twice before on separate occasions by courts of the District of Columbia, any state, or the United States or its territories.", " No conviction or plea of guilty with respect to which a person has been pardoned shall be taken into account in applying this section.", " In addition to any other penalty provided under this section, a person may be fined an amount not more than the amount set forth in ", ".", " If 2 or more persons conspire either to commit a criminal offense or to defraud the District of Columbia or any court or agency thereof in any manner or for any purpose, each shall be fined not more than the amount set forth in ", " or imprisoned not more than 5 years, or both, except that if the object of the conspiracy is a criminal offense punishable by less than 5 years, the maximum penalty for the conspiracy shall not exceed the maximum penalty provided for that offense.", " No person may be convicted of conspiracy unless an overt act is alleged and proved to have been committed by 1 of the conspirators pursuant to the conspiracy and to effect its purpose.", " When the object of a conspiracy contrived within the District of Columbia is to engage in conduct in a jurisdiction outside the District of Columbia which would constitute a criminal offense under an act of Congress applicable exclusively to the District of Columbia if performed therein, the conspiracy is a violation of this section if:", " A conspiracy contrived in another jurisdiction to engage in conduct within the District of Columbia which would constitute a criminal offense under an act of Congress exclusively applicable to the District of Columbia if performed within the District of Columbia is a violation of this section when an overt act pursuant to the conspiracy is committed within the District of Columbia. Under such circumstances, it is immaterial and no defense to a prosecution for conspiracy that the conduct which is the object of the conspiracy would not constitute a crime under the laws of the other jurisdiction."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/18/"},
{"chapter": "Chapter 17. Gambling.", "titles": ["§ 22–1701. Lotteries; promotion; sale or possession of tickets.", "§ 22–1702. Possession of lottery or policy tickets.", "§ 22–1703. Permitting sale of lottery tickets on premises.", "§ 22–1704. Gaming; setting up gaming table; inducing play.", "§ 22–1705. Gambling premises; definition; prohibition against maintaining; forfeiture; liens; deposit of moneys in Treasury; penalty; subsequent offenses.", "§ 22–1706. Three-card monte and confidence games.", "§ 22–1707. “Gaming table” defined.", "§ 22–1708. Gambling pools and bookmaking; athletic contest defined.", "§ 22–1709. Bucketing, and bucket-shopping and bucket-shops; definitions. [Repealed]", "§ 22–1710. Penalty for bucketing or keeping bucket-shop. [Repealed]", "§ 22–1711. Penalty for communicating, receiving, exhibiting, or displaying quotations of prices. [Repealed]", "§ 22–1712. Bucketing; written statement to be furnished; contents. [Repealed]", "§ 22–1713. Corrupt influence in connection with athletic contests.", "§ 22–1714. Immunity of witnesses; record.", "§ 22–1715. Presence in illegal establishments. [Repealed]", "§ 22–1716. Statement of purpose.", "§ 22–1717. Permissible gambling activities.", "§ 22–1718. Advertising and promotion; sale and possession of lottery and numbers tickets and slips."], "text": [" Any house, building, vessel, shed, booth, shelter, vehicle, enclosure, room, lot, or other premises in the District of Columbia, used or to be used in violating the provisions of ", " or ", ", shall be deemed “gambling premises” for the purpose of this section.", " It shall be unlawful for any person in the District of Columbia knowingly, as owner, lessee, agent, employee, operator, occupant, or otherwise, to maintain, or aid, or permit the maintaining of any gambling premises.", " All moneys, vehicles, furnishings, fixtures, equipment, stock (including, without limitation, furnishings and fixtures adaptable to nongambling uses, and equipment and stock for printing, recording, computing, transporting, safekeeping, or communication), or other things of value used or to be used in:", " Whoever violates this section shall be imprisoned not more than 180 days or fined not more than the amount set forth in ", ", or both, unless the violation occurs after the person has been convicted of a violation of this section, in which case the person may be imprisoned for not more than 5 years, or fined not more than the amount set forth in ", ", or both.", " It shall be unlawful to pay or give, or to agree to pay or give, or to promise or offer, any valuable thing to any individual:", " It shall be unlawful for any individual to solicit or accept, or to agree to accept, any valuable thing or a promise or offer of any valuable thing:", " Whoever violates any provision of subsection (a) of this section shall be guilty of a felony, and, upon conviction thereof, shall be punished by imprisonment for not less than 1 year nor more than 5 years and by a fine of not more than the amount set forth in ", ".", " Whoever violates any provision of subsection (b) of this section shall, upon conviction thereof, be punished by imprisonment for not more than 1 year and by a fine of not more than the amount set forth in ", ".", " As used in this section, the term “athletic contest” means any of the following, wherever held or to be held: a football, baseball, softball, basketball, hockey, or polo game, or a tennis or wrestling match, or a prize fight or boxing match, or a horse race or any other athletic or sporting event or contest.", " Nothing in this section shall be construed to prohibit the giving or offering of any bonus or extra compensation to any manager, coach, or professional player, or to any league, association, or conference for the purpose of encouraging such manager, coach, or player to a higher degree of skill, ability, or diligence in the performance of his or her duties.", " Whenever, in the judgment of the United States Attorney for the District of Columbia, the testimony of any witness, or the production of books, papers, or other records or documents, by any witness, in any case or proceeding involving a violation of this subchapter before any grand jury or a court in the District of Columbia, is necessary in the public interest, such witness shall not be excused from testifying or from producing books, papers, and other records and documents on the grounds that the testimony or evidence, documentary or otherwise, required of such witness may tend to incriminate such witness, or subject such witness to penalty or forfeiture; but such witness shall not be prosecuted or subject to any penalty or forfeiture for or on account of any transaction, matter, or thing concerning which such witness is compelled, after having claimed his or her privilege against self-incrimination, to testify or produce evidence, documentary or otherwise; except that such witness so testifying shall not be exempt from prosecution and punishment for perjury or contempt committed in so testifying.", " The judgment of the United States Attorney for the District of Columbia that any testimony, or the production of any books, papers, or other records or documents, is necessary in the public interest shall be confirmed in a written communication over the signature of the United States Attorney for the District of Columbia, addressed to the grand jury or the court in the District of Columbia concerned, and shall be made a part of the record of the case or proceeding in which such testimony or evidence is given.", " Nothing in ", " shall be construed to prohibit the advertising and promotion of excepted permissible gambling activities pursuant to ", ", hereof, including, but not limited to, the sale, by agents authorized by the District of Columbia, and the possession of tickets, certificates, or slips for lottery and daily numbers games excepted and permissible pursuant to ", ", the sale, lease, purchase, or possession of tickets, slips, certificates, or cards for bingo, raffles, and Monte Carlo night parties, excepted and permissible pursuant to ", ", or the sale, lease, purchase, or possession of tickets, slips, certificates, or cards for sports wagering excepted and permissible pursuant to [", "].", " Nothing in ", " shall prohibit advertising a lottery by the Maryland State Lottery so long as Maryland does not prohibit advertising or otherwise publishing an account of a lottery by the District of Columbia."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/17/"},
{"chapter": "Chapter 15. Forgery; Frauds.", "title": ["§ 22–1501. Forgery. [Repealed]", "§ 22–1502. Forging or imitating brands or packaging of goods.", "§ 22–1503. Stealing, destroying, mutilating, secreting, or withholding will. [Repealed]", "§ 22–1504. Decedent’s estate — Secreting or converting property, documents, or assets. [Repealed]", "§ 22–1505. Taking away or concealing writings. [Repealed]", "§ 22–1506. Sale or concealment by conditional vendee, with intent to defraud. [Repealed]", "§ 22–1507. Fraud by use of slugs to operate coin-controlled mechanism [Repealed]", "§ 22–1508. Manufacture, sale, offer for sale, possession of slugs or device to operate coin-controlled mechanism [Repealed]", "§ 22–1509. “person” defined [Repealed]", "§ 22–1510. Making, drawing, or uttering check, draft, or order with intent to defraud; proof of intent; “credit” defined.", "§ 22–1511. Fraudulent advertising.", "§ 22–1512. Prosecution under § 22-1511.", "§ 22–1513. Penalty under § 22-1511.", "§ 22–1514. Fraudulent interference or collusion in jury selection."], "text": [], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/15/"},
{"chapter": "Chapter 14. False Pretenses; False Personation.", "title": ["§ 22–1401. False pretenses. [Repealed]", "§ 22–1402. Recordation of deed, contract, or conveyance with intent to extort money.", "§ 22–1403. False personation before court, officers, notaries.", "§ 22–1404. Falsely impersonating public officer or minister.", "§ 22–1405. False personation of inspector of departments of District.", "§ 22–1406. False personation of police officer.", "§ 22–1407. Wearing or using insignia of certain organizations. [Repealed]", "§ 22–1408. False certificate of acknowledgment. [Repealed]", "§ 22–1409. Use of official insignia; penalty for unauthorized use."], "text": [" Whoever falsely personates another person before any court of record or judge thereof, or clerk of court, or any officer in the District authorized to administer oaths or take the acknowledgment of deeds or other instruments or to grant marriage licenses or accepts domestic partnership registrations, with intent to defraud, shall be imprisoned for not less than 1 year nor more than 5 years.", " In addition to any other penalty provided under this section, a person may be fined an amount not more than the amount set forth in ", ".", " For the purposes of this section, the term “domestic partnership” shall have the same meaning as provided in ", ".", " The Metropolitan Police Department and the Fire and Emergency Medical Services Department shall have the sole and exclusive rights to have and use, in carrying out their respective missions, the official badges, patches, emblems, copyrights, descriptive or designating marks, and other official insignia displayed upon their current and future uniforms.", " Any person who, for any reason, makes or attempts to make unauthorized use of, or aids or attempts to aid another person in the unauthorized use or attempted unauthorized use of the official badges, patches, emblems, copyrights, descriptive or designated marks, or other official insignia of the Metropolitan Police Department or the Fire and Emergency Medical Services Department shall, upon conviction, be fined not more than the amount set forth in ", ", imprisoned for not more than one year, or both."], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/14/"},
{"chapter": "Chapter 3. Arson.", "title": ["§ 22–301. Definition and penalty.", "§ 22–302. Burning one’s own property with intent to defraud or injure another.", "§ 22–303. Malicious burning, destruction, or injury of another’s property.", "§ 22–304. Malicious burning of fences, woods, crops. [Repealed]"], "text": [], "address": "https://code.dccouncil.us/dc/council/code/titles/22/chapters/3/"}
]